[
    {
        "question": "Which famous political figure appointed william cushing, and also founded Pittsburgh>",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pittsburgh> <http://dbpedia.org/ontology/founder> ?uri. <http://dbpedia.org/resource/William_Cushing> <http://dbpedia.org/ontology/appointer> ?uri} ",
        "topic_entities": "http://dbpedia.org/resource/William_Cushing (William Cushing), http://dbpedia.org/resource/Pittsburgh (Pittsburgh)"
    },
    {
        "question": "Count all those whose youth club was managed by Luis Enrique.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/manager> <http://dbpedia.org/resource/Luis_Enrique_(footballer)> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }",
        "topic_entities": "http://dbpedia.org/resource/Luis_Enrique_(footballer) (Luis Enrique (footballer))"
    },
    {
        "question": "Is Microsoft office written in C++",
        "query": "ASK WHERE { <http://dbpedia.org/resource/Microsoft_Office> <http://dbpedia.org/property/programmingLanguage> <http://dbpedia.org/resource/C++> }",
        "topic_entities": "http://dbpedia.org/resource/Microsoft_Office (Microsoft Office), http://dbpedia.org/resource/C++ (C++)"
    },
    {
        "question": "Give me the total number of commander of the military conflicts whose commander is Roundhead (Wyandot).",
        "query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/commander> <http://dbpedia.org/resource/Roundhead_(Wyandot)> . ?x <http://dbpedia.org/ontology/commander> ?uri }",
        "topic_entities": "http://dbpedia.org/resource/Roundhead_(Wyandot) (Roundhead (Wyandot))"
    },
    {
        "question": "Which company's division is Audi India? Correct Question",
        "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/divisions> <http://dbpedia.org/resource/Audi_India> } ",
        "topic_entities": "http://dbpedia.org/resource/Audi_India (Audi India)"
    },
    {
        "question": "Count all the things licensed as Software as a service.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/license> <http://dbpedia.org/resource/Software_as_a_service>  . }",
        "topic_entities": "http://dbpedia.org/resource/Software_as_a_service (Software as a service)"
    },
    {
        "question": "Count the drinks originated in England.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/England>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Beverage>}",
        "topic_entities": "http://dbpedia.org/ontology/Beverage (Beverage), http://dbpedia.org/resource/England (England)"
    },
    {
        "question": "Give me some softwares which run on mac os",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Mac_OS>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}",
        "topic_entities": "http://dbpedia.org/ontology/Software (Software), http://dbpedia.org/resource/Mac_OS (Mac OS)"
    },
    {
        "question": "Does Walt Disney Studio have a subsidiary called PixarCascadia_",
        "query": "ASK WHERE { <http://dbpedia.org/resource/Walt_Disney_Studios_(division)> <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Pixar> }",
        "topic_entities": "http://dbpedia.org/resource/Walt_Disney_Studios_(division) (Walt Disney Studios (division)), http://dbpedia.org/resource/Pixar (Pixar)"
    },
    {
        "question": "List the religions of the commanders of Royal Thai Army.",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Royal_Thai_Army> <http://dbpedia.org/property/notableCommanders> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Royal_Thai_Army (Royal Thai Army)"
    },
    {
        "question": "Give me a count of everything made by the company which offers electronical manufacturing too.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/service> <http://dbpedia.org/resource/Electronics_manufacturing_services> . ?uri <http://dbpedia.org/ontology/manufacturer> ?x  . }",
        "topic_entities": "http://dbpedia.org/resource/Electronics_manufacturing_services (Electronics manufacturing services)"
    },
    {
        "question": "Name everyone working for a company owned by Roman Abramovich.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Roman_Abramovich> . ?uri <http://dbpedia.org/ontology/occupation> ?x  . }",
        "topic_entities": "http://dbpedia.org/resource/Roman_Abramovich (Roman Abramovich)"
    },
    {
        "question": "How many bacterias have taxonomy as Bacillales and domain as Bacteria? ",
        "query": " SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Bacillales> . ?uri <http://dbpedia.org/property/domain> <http://dbpedia.org/resource/Bacteria> } ",
        "topic_entities": "http://dbpedia.org/resource/Bacteria (Bacteria), http://dbpedia.org/resource/Bacillales (Bacillales)"
    },
    {
        "question": "List few authors whose education took place in Saint Petersburg ?   ",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/education> <http://dbpedia.org/resource/Saint_Petersburg>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}",
        "topic_entities": "http://dbpedia.org/ontology/Writer (Writer), http://dbpedia.org/resource/Saint_Petersburg (Saint Petersburg)"
    },
    {
        "question": "Whose doctoral student is etienne bieler\\xc9tienne_Bi\\xe9ler",
        "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/\u00c9tienne_Bi\u00e9ler> } ",
        "topic_entities": "http://dbpedia.org/resource/\u00c9tienne_Bi\u00e9ler (\u00c9tienne Bi\u00e9ler)"
    },
    {
        "question": "Name the ones who debuted in the San Francisco 49ers.",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/debutTeam> <http://dbpedia.org/resource/San_Francisco_49ers>  . }",
        "topic_entities": "http://dbpedia.org/resource/San_Francisco_49ers (San Francisco 49ers)"
    },
    {
        "question": "Name the part of Liverpool city region >",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Liverpool_City_Region> <http://dbpedia.org/ontology/part> ?uri } ",
        "topic_entities": "http://dbpedia.org/resource/Liverpool_City_Region (Liverpool City Region)"
    },
    {
        "question": "Count the different religions followed by Second Lieutenants in military.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/militaryRank> <http://dbpedia.org/resource/Second_lieutenant> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Second_lieutenant (Second lieutenant)"
    },
    {
        "question": "Is Eddie Bravo the trainer of Alan Jouban",
        "query": "ASK WHERE { <http://dbpedia.org/resource/Alan_Jouban> <http://dbpedia.org/ontology/trainer> <http://dbpedia.org/resource/Eddie_Bravo> }",
        "topic_entities": "http://dbpedia.org/resource/Alan_Jouban (Alan Jouban), http://dbpedia.org/resource/Eddie_Bravo (Eddie Bravo)"
    },
    {
        "question": "name the home stadium of FC Spartak Moscow season 2011-12",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2011\u201312_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/homeStadium> ?uri } ",
        "topic_entities": "http://dbpedia.org/resource/2011\u201312_FC_Spartak_Moscow_season (2011\u201312 FC Spartak Moscow season)"
    },
    {
        "question": "Count all those who've played for the youth club which owns the Rosario, Santa Fe stadium.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/ground> <http://dbpedia.org/resource/Rosario,_Santa_Fe> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }",
        "topic_entities": "http://dbpedia.org/resource/Rosario,_Santa_Fe (Rosario, Santa Fe)"
    },
    {
        "question": "Count the different religions practiced by people who are in the Malaysian and Chinese association.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/party> <http://dbpedia.org/resource/Malaysian_Chinese_Association> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Malaysian_Chinese_Association (Malaysian Chinese Association)"
    },
    {
        "question": "List all those whose relatives' nationality is United States.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/nationality> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/ontology/relative> ?x  . }",
        "topic_entities": "http://dbpedia.org/resource/United_States (United States)"
    },
    {
        "question": "Count the  origin of the beverages which have been originated in england /",
        "query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/origin> ?uri }",
        "topic_entities": "http://dbpedia.org/resource/England (England)"
    },
    {
        "question": "Count the religions followed by people living in British Columbia.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/British_Columbia> . ?x <http://dbpedia.org/property/religion> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/British_Columbia (British Columbia)"
    },
    {
        "question": "For everyone who died in paris, count their different fields of work.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/Paris> . ?x <http://dbpedia.org/property/fields> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Paris (Paris)"
    },
    {
        "question": "Name the members of youth clubs which have Camp Nou as their homeground.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/ground> <http://dbpedia.org/resource/Camp_Nou> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }",
        "topic_entities": "http://dbpedia.org/resource/Camp_Nou (Camp Nou)"
    },
    {
        "question": "Count the number of actors in Lucy Sullivan Is Getting Married.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { <http://dbpedia.org/resource/Lucy_Sullivan_Is_Getting_Married> <http://dbpedia.org/property/starring> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Lucy_Sullivan_Is_Getting_Married (Lucy Sullivan Is Getting Married)"
    },
    {
        "question": "Estimate the number of sports divisions at the universities under international association of universities.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/affiliation> <http://dbpedia.org/resource/International_Association_of_Universities> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/International_Association_of_Universities (International Association of Universities)"
    },
    {
        "question": "Name a few whose live in a place where Indian English is an official language",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/officialLanguage> <http://dbpedia.org/resource/Indian_English> . ?uri <http://dbpedia.org/ontology/residence> ?x  . }",
        "topic_entities": "http://dbpedia.org/resource/Indian_English (Indian English)"
    },
    {
        "question": "Give me a count of everything under the archipelago, where Papeete is the biggest town.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/largestCity> <http://dbpedia.org/resource/Papeete> . ?uri <http://dbpedia.org/property/archipelago> ?x  . }",
        "topic_entities": "http://dbpedia.org/resource/Papeete (Papeete)"
    },
    {
        "question": "Who all have been canonized by Pope Paul VI",
        "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/canonizedBy> <http://dbpedia.org/resource/Pope_Paul_VI> } ",
        "topic_entities": "http://dbpedia.org/resource/Pope_Paul_VI (Pope Paul VI)"
    },
    {
        "question": "List the base currency of the country whose anthem is Oj, svijetla majska zoro.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Oj,_svijetla_majska_zoro> . ?x <http://dbpedia.org/property/currency> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Oj,_svijetla_majska_zoro (Oj, svijetla majska zoro)"
    },
    {
        "question": "List the children of the parent of Marvin Bush.",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Marvin_Bush> <http://dbpedia.org/ontology/parent> ?x . ?x <http://dbpedia.org/property/children> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Marvin_Bush (Marvin Bush)"
    },
    {
        "question": "How many ",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Chicago_Bulls>  . }",
        "topic_entities": "http://dbpedia.org/resource/Chicago_Bulls (Chicago Bulls)"
    },
    {
        "question": "What is the almamater of the successor of F. A. Little, Jr.? ",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/F._A._Little,_Jr.> <http://dbpedia.org/ontology/successor> ?x . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/F._A._Little,_Jr. (F. A. Little, Jr.)"
    },
    {
        "question": "List everything in which saxophone players have been casted.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Saxophone> . ?uri <http://dbpedia.org/property/starring> ?x  . }",
        "topic_entities": "http://dbpedia.org/resource/Saxophone (Saxophone)"
    },
    {
        "question": "What is the venerated in of the Abraham and religion of the Saima Chowdhury",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Abraham> <http://dbpedia.org/property/veneratedIn> ?uri. <http://dbpedia.org/resource/Saima_Chowdhury> <http://dbpedia.org/property/religion> ?uri} ",
        "topic_entities": "http://dbpedia.org/resource/Abraham (Abraham), http://dbpedia.org/resource/Saima_Chowdhury (Saima Chowdhury)"
    },
    {
        "question": "Name the mascot of the military branch of William Harper.",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Harper_(Rhodesian_politician)> <http://dbpedia.org/ontology/militaryBranch> ?x . ?x <http://dbpedia.org/property/mascot> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/William_Harper_(Rhodesian_politician) (William Harper (Rhodesian politician))"
    },
    {
        "question": "What is the nationality of the J. T. Krogh which is also the  sovereign state of the Camilla Martin",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/J._T._Krogh> <http://dbpedia.org/ontology/nationality> ?uri. <http://dbpedia.org/resource/Camilla_Martin> <http://dbpedia.org/ontology/country> ?uri} ",
        "topic_entities": "http://dbpedia.org/resource/Camilla_Martin (Camilla Martin), http://dbpedia.org/resource/J._T._Krogh (J. T. Krogh)"
    },
    {
        "question": "Is lion an animal?",
        "query": "ASK WHERE { <http://dbpedia.org/resource/Lion> <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Animal> }",
        "topic_entities": "http://dbpedia.org/resource/Lion (Lion), http://dbpedia.org/resource/Animal (Animal)"
    },
    {
        "question": "Count all the scientologists.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Scientology>  . }",
        "topic_entities": "http://dbpedia.org/resource/Scientology (Scientology)"
    },
    {
        "question": "Which tenants of the Master Card center is also th draft team of Sam Carrrick ",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/MasterCard_Centre> <http://dbpedia.org/property/tenants> ?uri. <http://dbpedia.org/resource/Sam_Carrick> <http://dbpedia.org/property/draftTeam> ?uri} ",
        "topic_entities": "http://dbpedia.org/resource/Sam_Carrick (Sam Carrick), http://dbpedia.org/resource/MasterCard_Centre (MasterCard Centre)"
    },
    {
        "question": "What is a salthill?",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Salthill> <http://dbpedia.org/ontology/type> ?uri } ",
        "topic_entities": "http://dbpedia.org/resource/Salthill (Salthill)"
    },
    {
        "question": "Which state is the birth location of Ann Monroe Gilchrist Strong? ",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ann_Monroe_Gilchrist_Strong> <http://dbpedia.org/ontology/birthPlace> ?x . ?x <http://dbpedia.org/ontology/country> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Ann_Monroe_Gilchrist_Strong (Ann Monroe Gilchrist Strong)"
    },
    {
        "question": "List the awards given to the relatives of Gregorios Bernardakis.",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gregorios_Bernardakis> <http://dbpedia.org/ontology/relative> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Gregorios_Bernardakis (Gregorios Bernardakis)"
    },
    {
        "question": " Count the participants of the NBA.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/National_Basketball_Association>  . }",
        "topic_entities": "http://dbpedia.org/resource/National_Basketball_Association (National Basketball Association)"
    },
    {
        "question": "Count the total religions followed by the ones living in England.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/religion> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/England (England)"
    },
    {
        "question": "Is Serbian Titieca a doctoral student of Werner Heisenberghttp://dbpedia.org/resource/Werner_Heisenberg",
        "query": "ASK WHERE { <http://dbpedia.org/resource/Werner_Heisenberg> <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/\u0218erban_\u021ai\u021beica> }",
        "topic_entities": "http://dbpedia.org/resource/Werner_Heisenberg (Werner Heisenberg), http://dbpedia.org/resource/\u0218erban_\u021ai\u021beica (\u0218erban \u021ai\u021beica)"
    },
    {
        "question": "Does the white river flow into the connecticut river{u'_id': u'97e02dcf44aa43c1b7cc7a7c155b118f',",
        "query": "ASK WHERE { <http://dbpedia.org/resource/Connecticut_River> <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/White_River_(Vermont)> }",
        "topic_entities": "http://dbpedia.org/resource/Connecticut_River (Connecticut River), http://dbpedia.org/resource/White_River_(Vermont) (White River (Vermont))"
    },
    {
        "question": "Where did ed podolak go to high school",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ed_Podolak> <http://dbpedia.org/ontology/highschool> ?uri } ",
        "topic_entities": "http://dbpedia.org/resource/Ed_Podolak (Ed Podolak)"
    },
    {
        "question": "Give me the number of home stadiums of teams managed by John Spencer.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/manager> <http://dbpedia.org/resource/John_Spencer_(Scottish_footballer)> . ?x <http://dbpedia.org/ontology/homeStadium> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/John_Spencer_(Scottish_footballer) (John Spencer (Scottish footballer))"
    },
    {
        "question": "Count the number of judges who've come on CTV network shows.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/CTV_Television_Network> . ?x <http://dbpedia.org/property/judges> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/CTV_Television_Network (CTV Television Network)"
    },
    {
        "question": "What writers have nationality as Statelessness?  ",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/nationality> <http://dbpedia.org/resource/Statelessness>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}",
        "topic_entities": "http://dbpedia.org/ontology/Writer (Writer), http://dbpedia.org/resource/Statelessness (Statelessness)"
    },
    {
        "question": "Give me the count of artist in the company whose Artist is Jean- Fran\u00e7ois Cot\u00e9 ?",
        "query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/artist> <http://dbpedia.org/resource/Jean-Fran\u00e7ois_Cot\u00e9> . ?x <http://dbpedia.org/property/artist> ?uri }",
        "topic_entities": "http://dbpedia.org/resource/Jean-Fran\u00e7ois_Cot\u00e9 (Jean-Fran\u00e7ois Cot\u00e9)"
    },
    {
        "question": "List the sports played in private universities.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Private_university> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Private_university (Private university)"
    },
    {
        "question": "Who is the performer of album which has the song \"To Where You Are\" ?",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/To_Where_You_Are> <http://dbpedia.org/ontology/album> ?x . ?x <http://dbpedia.org/ontology/artist> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/To_Where_You_Are (To Where You Are)"
    },
    {
        "question": "List the awards won by the wife of Ingrid von Rosen.",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ingrid_von_Rosen> <http://dbpedia.org/property/spouse> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Ingrid_von_Rosen (Ingrid von Rosen)"
    },
    {
        "question": "Count the different genres of games published by Titus Software",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Titus_Software> . ?x <http://dbpedia.org/ontology/genre> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Titus_Software (Titus Software)"
    },
    {
        "question": "Count the awards given to the recepients of the Becket fund for religious liberty.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Becket_Fund_for_Religious_Liberty> . ?x <http://dbpedia.org/property/awards> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Becket_Fund_for_Religious_Liberty (Becket Fund for Religious Liberty)"
    },
    {
        "question": "Count all the places where companies located in Ontario operate.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario> . ?x <http://dbpedia.org/property/locations> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Ontario (Ontario)"
    },
    {
        "question": "Count the awards won by the people who graduated from the National and Kapodistrian University of Athens.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/National_and_Kapodistrian_University_of_Athens> . ?x <http://dbpedia.org/ontology/award> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/National_and_Kapodistrian_University_of_Athens (National and Kapodistrian University of Athens)"
    },
    {
        "question": "?What are the airline hubs of Cascade Airways",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cascade_Airways> <http://dbpedia.org/property/hubs> ?uri } ",
        "topic_entities": "http://dbpedia.org/resource/Cascade_Airways (Cascade Airways)"
    },
    {
        "question": "Count the different alma maters of people employed by the CNN",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/employer> <http://dbpedia.org/resource/CNN> . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/CNN (CNN)"
    },
    {
        "question": "Name a famous relative of barry voight",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Barry_Voight>  . }",
        "topic_entities": "http://dbpedia.org/resource/Barry_Voight (Barry Voight)"
    },
    {
        "question": "List places that are associated to cities in the state of Mecklenburg-Vorpommern.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/federalState> <http://dbpedia.org/resource/Mecklenburg-Vorpommern> . ?uri <http://dbpedia.org/property/cities> ?x  . }",
        "topic_entities": "http://dbpedia.org/resource/Mecklenburg-Vorpommern (Mecklenburg-Vorpommern)"
    },
    {
        "question": "Where is the mouth of the river whose tributary is Bjelimi\u0107ka  Rijeka ?",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/Bjelimi\u0107ka_Rijeka> . ?x <http://dbpedia.org/ontology/mouthCountry> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Bjelimi\u0107ka_Rijeka (Bjelimi\u0107ka Rijeka)"
    },
    {
        "question": "Name some books by Spanish speaking authors.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/language> <http://dbpedia.org/resource/Spanish_language> . ?uri <http://dbpedia.org/property/author> ?x  . }",
        "topic_entities": "http://dbpedia.org/resource/Spanish_language (Spanish language)"
    },
    {
        "question": "To which company is the service \"Nintendo eShop\" associated with?",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/services> <http://dbpedia.org/resource/Nintendo_eShop>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}",
        "topic_entities": "http://dbpedia.org/ontology/Company (Company), http://dbpedia.org/resource/Nintendo_eShop (Nintendo eShop)"
    },
    {
        "question": "Give me the characters who last appeared in Star Wars Episode 3",
        "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/last> <http://dbpedia.org/resource/Star_Wars:_Episode_III_\u2013_Revenge_of_the_Sith> } ",
        "topic_entities": "http://dbpedia.org/resource/Star_Wars:_Episode_III_\u2013_Revenge_of_the_Sith (Star Wars: Episode III \u2013 Revenge of the Sith)"
    },
    {
        "question": "Which river goes through cohoes, NY",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cohoes,_New_York> <http://dbpedia.org/ontology/river> ?uri } ",
        "topic_entities": "http://dbpedia.org/resource/Cohoes,_New_York (Cohoes, New York)"
    },
    {
        "question": "Did Steve Sampson manage a club of Santa Clara university",
        "query": "ASK WHERE { <http://dbpedia.org/resource/Steve_Sampson> <http://dbpedia.org/ontology/managerClub> <http://dbpedia.org/resource/Santa_Clara_University> }",
        "topic_entities": "http://dbpedia.org/resource/Santa_Clara_University (Santa Clara University), http://dbpedia.org/resource/Steve_Sampson (Steve Sampson)"
    },
    {
        "question": "Count the different causes of death of Christians.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Christianity> . ?x <http://dbpedia.org/ontology/deathCause> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Christianity (Christianity)"
    },
    {
        "question": "List the alma mater of the person who is wedded to Sissela Bok.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Sissela_Bok> . ?x <http://dbpedia.org/property/almaMater> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Sissela_Bok (Sissela Bok)"
    },
    {
        "question": "Mazhar Ul Haq High School, Beerwah is affiliated to Islamic Religion",
        "query": "ASK WHERE { <http://dbpedia.org/resource/Mazhar_Ul_Haq_High_School,_Beerwah> <http://dbpedia.org/property/religiousAffiliation> <http://dbpedia.org/resource/Islam> }",
        "topic_entities": "http://dbpedia.org/resource/Islam (Islam), http://dbpedia.org/resource/Mazhar_Ul_Haq_High_School,_Beerwah (Mazhar Ul Haq High School, Beerwah)"
    },
    {
        "question": "List all the tenants of the stadium where the WWF Summer Slam 2004 took place.",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/SummerSlam_(2004)> <http://dbpedia.org/property/venue> ?x . ?x <http://dbpedia.org/ontology/tenant> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/SummerSlam_(2004) (SummerSlam (2004))"
    },
    {
        "question": "Who is married to Tony Ramo",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/partner> <http://dbpedia.org/resource/Tony_Romo>  . }",
        "topic_entities": "http://dbpedia.org/resource/Tony_Romo (Tony Romo)"
    },
    {
        "question": "Name some people working at someplace owned by News Corp.",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/owners> <http://dbpedia.org/resource/News_Corp> . ?uri <http://dbpedia.org/ontology/employer> ?x  . }",
        "topic_entities": "http://dbpedia.org/resource/News_Corp (News Corp)"
    },
    {
        "question": "Count the tenants of the stadiums owned by toronto.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/owner> <http://dbpedia.org/resource/Toronto> . ?x <http://dbpedia.org/property/tenants> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Toronto (Toronto)"
    },
    {
        "question": "Count the number of religions followed by Janta Dal members.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/party> <http://dbpedia.org/resource/Janata_Dal> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Janata_Dal (Janata Dal)"
    },
    {
        "question": "Who did Bruce Bochy play for ? ",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bruce_Bochy> <http://dbpedia.org/ontology/team> ?uri } ",
        "topic_entities": "http://dbpedia.org/resource/Bruce_Bochy (Bruce Bochy)"
    }
]