[
    {
        "question": "what are some journals of academic Philosophy",
        "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/discipline> <http://dbpedia.org/resource/Philosophy> } ",
        "topic_entities": "http://dbpedia.org/resource/Philosophy (Philosophy)"
    },
    {
        "question": "What is the common award won by Charles LeMaire and Eric Roth",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Charles_LeMaire> <http://dbpedia.org/property/awards> ?uri. <http://dbpedia.org/resource/Eric_Roth> <http://dbpedia.org/ontology/award> ?uri} ",
        "topic_entities": "http://dbpedia.org/resource/Eric_Roth (Eric Roth), http://dbpedia.org/resource/Charles_LeMaire (Charles LeMaire)"
    },
    {
        "question": "For which team did both Butch Metzger and Brian Horwitz debuted ? ",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Butch_Metzger> <http://dbpedia.org/ontology/debutTeam> ?uri. <http://dbpedia.org/resource/Brian_Horwitz> <http://dbpedia.org/ontology/debutTeam> ?uri . }",
        "topic_entities": "http://dbpedia.org/resource/Brian_Horwitz (Brian Horwitz), http://dbpedia.org/resource/Butch_Metzger (Butch Metzger)"
    },
    {
        "question": "Who coached the marquet golden eagels during 2013",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2013\u201314_Marquette_Golden_Eagles_men's_basketball_team> <http://dbpedia.org/ontology/coach> ?uri } ",
        "topic_entities": "http://dbpedia.org/resource/2013\u201314_Marquette_Golden_Eagles_men's_basketball_team (2013\u201314 Marquette Golden Eagles men's basketball team)"
    },
    {
        "question": "What are some products manufactured by Sony? ",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony>  . }",
        "topic_entities": "http://dbpedia.org/resource/Sony (Sony)"
    },
    {
        "question": "With which musical artist is the music group which sung Mind Blowin' related to ?  ",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mind_Blowin'_(Smooth_song)> <http://dbpedia.org/ontology/musicalArtist> ?x . ?x <http://dbpedia.org/ontology/associatedMusicalArtist> ?uri  . }",
        "topic_entities": "http://dbpedia.org/resource/Mind_Blowin'_(Smooth_song) (Mind Blowin' (Smooth song))"
    },
    {
        "question": "What newspapers's owners is Schibsted",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/owners> <http://dbpedia.org/resource/Schibsted>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Newspaper>}",
        "topic_entities": "http://dbpedia.org/ontology/Newspaper (Newspaper), http://dbpedia.org/resource/Schibsted (Schibsted)"
    },
    {
        "question": "What fictional character's species is American Pekin duck",
        "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/species> <http://dbpedia.org/resource/American_Pekin_duck> } ",
        "topic_entities": "http://dbpedia.org/resource/American_Pekin_duck (American Pekin duck)"
    },
    {
        "question": "Count all the games whose distributors are located in America",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/country> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/property/distributor> ?x  . }",
        "topic_entities": "http://dbpedia.org/resource/United_States (United States)"
    },
    {
        "question": "Who is the spouse of Daniel Gibson? ",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/Daniel_Gibson>  . }",
        "topic_entities": "http://dbpedia.org/resource/Daniel_Gibson (Daniel Gibson)"
    },
    {
        "question": "Who wrote Heroman?",
        "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Heroman> <http://dbpedia.org/property/author> ?uri } ",
        "topic_entities": "http://dbpedia.org/resource/Heroman (Heroman)"
    }
]