[
    {
        "question": "List all boardgames by GMT.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
        "topic_entities": "http://dbpedia.org/resource/GMT_Games (GMT Games)"
    },
    {
        "question": "Give me all actors starring in movies directed by and starring William Shatner.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring res:William_Shatner { ?x dbo:starring ?uri } UNION { ?x dbp:starring ?uri } }",
        "topic_entities": "http://dbpedia.org/resource/William_Shatner (William Shatner)"
    },
    {
        "question": "Give me all Danish films.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:country res:Denmark }",
        "topic_entities": "http://dbpedia.org/ontology/Film (Film), http://dbpedia.org/resource/Denmark (Denmark)"
    },
    {
        "question": "Give me the grandchildren of Bruce Lee.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child <http://dbpedia.org/property/children> ?uri }",
        "topic_entities": "http://dbpedia.org/resource/Bruce_Lee (Bruce Lee)"
    },
    {
        "question": "Give me the Apollo 14 astronauts.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:mission res:Apollo_14 }",
        "topic_entities": "http://dbpedia.org/resource/Apollo_14 (Apollo 14)"
    },
    {
        "question": "Give me a list of all trumpet players that were bandleaders.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation res:Bandleader ; dbo:instrument res:Trumpet }",
        "topic_entities": "http://dbpedia.org/resource/Bandleader (Bandleader), http://dbpedia.org/resource/Trumpet (Trumpet)"
    },
    {
        "question": "Show me all museums in London.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London> }",
        "topic_entities": "http://dbpedia.org/ontology/Museum (Museum), http://dbpedia.org/resource/London (London)"
    },
    {
        "question": "Show me all basketball players that are higher than 2 meters.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }",
        "topic_entities": "http://dbpedia.org/ontology/BasketballPlayer (BasketballPlayer)"
    },
    {
        "question": "Give all swimmers that were born in Moscow.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Swimmer> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> }",
        "topic_entities": "http://dbpedia.org/ontology/Swimmer (Swimmer), http://dbpedia.org/resource/Moscow (Moscow)"
    },
    {
        "question": "Show a list of soccer clubs that play in the Bundesliga.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> }",
        "topic_entities": "http://dbpedia.org/ontology/SoccerClub (SoccerClub), http://dbpedia.org/resource/Bundesliga (Bundesliga)"
    },
    {
        "question": "Give me all Danish movies.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> }",
        "topic_entities": "http://dbpedia.org/ontology/Film (Film), http://dbpedia.org/resource/Denmark (Denmark)"
    },
    {
        "question": "Give me the capitals of all countries that the Himalayas run through.",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?country . ?country <http://dbpedia.org/ontology/capital> ?uri }",
        "topic_entities": "http://dbpedia.org/resource/Himalayas (Himalayas)"
    },
    {
        "question": "Give me all islands that belong to Japan.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Island> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan> }",
        "topic_entities": "http://dbpedia.org/ontology/Island (Island), http://dbpedia.org/resource/Japan (Japan)"
    },
    {
        "question": "Give me all Apollo 14 astronauts.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14> }",
        "topic_entities": "http://dbpedia.org/resource/Apollo_14 (Apollo 14)"
    },
    {
        "question": "Give me all soccer clubs in the Premier League.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> }",
        "topic_entities": "http://dbpedia.org/ontology/SoccerClub (SoccerClub), http://dbpedia.org/resource/Premier_League (Premier League)"
    },
    {
        "question": "Give me all ESA astronauts.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Astronaut> ; <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency> }",
        "topic_entities": "http://dbpedia.org/ontology/Astronaut (Astronaut), http://dbpedia.org/resource/European_Space_Agency (European Space Agency)"
    },
    {
        "question": "Give me all actors who were born in Berlin.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> }",
        "topic_entities": "http://dbpedia.org/ontology/Actor (Actor), http://dbpedia.org/resource/Berlin (Berlin)"
    },
    {
        "question": "Who created Goofy?",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/creator> ?uri }",
        "topic_entities": "http://dbpedia.org/resource/Goofy (Goofy)"
    },
    {
        "question": "Give me all the TV shows with Neil Patrick Harris.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> }",
        "topic_entities": "http://dbpedia.org/ontology/TelevisionShow (TelevisionShow), http://dbpedia.org/resource/Neil_Patrick_Harris (Neil Patrick Harris)"
    },
    {
        "question": "Give me all Swedish holidays.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> }",
        "topic_entities": "http://dbpedia.org/ontology/Holiday (Holiday), http://dbpedia.org/resource/Sweden (Sweden)"
    },
    {
        "question": "List all the musicals with music by Leonard Bernstein.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Musical> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> }",
        "topic_entities": "http://dbpedia.org/ontology/Musical (Musical), http://dbpedia.org/resource/Leonard_Bernstein (Leonard Bernstein)"
    },
    {
        "question": "Give me all types of eating disorders.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/class/yago/WikicatEatingDisorders> }",
        "topic_entities": ""
    },
    {
        "question": "Give me all books written by Danielle Steel.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Book> ; <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel> }",
        "topic_entities": "http://dbpedia.org/ontology/Book (Book), http://dbpedia.org/resource/Danielle_Steel (Danielle Steel)"
    },
    {
        "question": "Give me all Methodist politicians.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Politician> ; <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism> }",
        "topic_entities": "http://dbpedia.org/ontology/Politician (Politician), http://dbpedia.org/resource/Methodism (Methodism)"
    },
    {
        "question": "Give me the birthdays of all actors of the television show Charmed.",
        "query": "SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> ?actor . ?actor <http://dbpedia.org/ontology/birthDate> ?date }",
        "topic_entities": "http://dbpedia.org/resource/Charmed (Charmed)"
    },
    {
        "question": "Give me a list of all lakes in Denmark.",
        "query": "SELECT DISTINCT ?uri WHERE { { ?uri a <http://dbpedia.org/ontology/Lake> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> } UNION { ?uri a <http://dbpedia.org/class/yago/LakesOfDenmark> } }",
        "topic_entities": "http://dbpedia.org/ontology/Lake (Lake), http://dbpedia.org/resource/Denmark (Denmark)"
    },
    {
        "question": "List all episodes of the first season of the HBO television series The Sopranos!",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:The_Sopranos ; dbo:seasonNumber 1 }",
        "topic_entities": "http://dbpedia.org/resource/The_Sopranos (The Sopranos)"
    },
    {
        "question": "Give me all films produced by Hal Roach.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> }",
        "topic_entities": "http://dbpedia.org/ontology/Film (Film), http://dbpedia.org/resource/Hal_Roach (Hal Roach)"
    },
    {
        "question": "Give me a list of all bandleaders that play trumpet.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader> ; <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet> }",
        "topic_entities": "http://dbpedia.org/resource/Bandleader (Bandleader), http://dbpedia.org/resource/Trumpet (Trumpet)"
    },
    {
        "question": "Give me all movies with Tom Cruise.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise> }",
        "topic_entities": "http://dbpedia.org/ontology/Film (Film), http://dbpedia.org/resource/Tom_Cruise (Tom Cruise)"
    },
    {
        "question": "Give me all cities in New Jersey with more than 100000 inhabitants.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:isPartOf res:New_Jersey ; dbo:populationTotal ?inhabitants FILTER ( ?inhabitants > 100000 ) }",
        "topic_entities": "http://dbpedia.org/ontology/City (City), http://dbpedia.org/resource/New_Jersey (New Jersey)"
    },
    {
        "question": "Give me all B-sides of the Ramones.",
        "query": "SELECT DISTINCT ?string WHERE { ?x <http://dbpedia.org/ontology/musicalArtist> <http://dbpedia.org/resource/Ramones> ; <http://dbpedia.org/ontology/bSide> ?string }",
        "topic_entities": "http://dbpedia.org/resource/Ramones (Ramones)"
    },
    {
        "question": "List the seven kings of Rome.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome> }",
        "topic_entities": "http://dbpedia.org/resource/King_of_Rome (King of Rome)"
    },
    {
        "question": "Give me all people that were born in Vienna and died in Berlin.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vienna> ; <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Berlin> }",
        "topic_entities": "http://dbpedia.org/resource/Vienna (Vienna), http://dbpedia.org/resource/Berlin (Berlin)"
    },
    {
        "question": "Is Darth Vader Luke\u2019s father?",
        "query": "ASK WHERE { <http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Luke_Skywalker> }",
        "topic_entities": "http://dbpedia.org/resource/Darth_Vader (Darth Vader), http://dbpedia.org/resource/Luke_Skywalker (Luke Skywalker)"
    },
    {
        "question": "Give me all breeds of the German Shepherd dog.",
        "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd> }",
        "topic_entities": "http://dbpedia.org/resource/German_Shepherd (German Shepherd)"
    },
    {
        "question": "Is Cola a beverage?",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Cola rdf:type dbo:Beverage }",
        "topic_entities": "http://dbpedia.org/ontology/Beverage (Beverage), http://dbpedia.org/resource/Cola (Cola)"
    },
    {
        "question": "Who created Batman?",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Batman dbo:creator ?uri }",
        "topic_entities": "http://dbpedia.org/resource/Batman (Batman)"
    },
    {
        "question": "Give me all movies directed by Francis Ford Coppola.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:director res:Francis_Ford_Coppola }",
        "topic_entities": "http://dbpedia.org/ontology/Film (Film), http://dbpedia.org/resource/Francis_Ford_Coppola (Francis Ford Coppola)"
    },
    {
        "question": "Give me all launch pads operated by NASA.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator res:NASA }",
        "topic_entities": "http://dbpedia.org/ontology/LaunchPad (LaunchPad), http://dbpedia.org/resource/NASA (NASA)"
    },
    {
        "question": "List all the musicals with music by Elton John.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John }",
        "topic_entities": "http://dbpedia.org/ontology/Musical (Musical), http://dbpedia.org/resource/Elton_John (Elton John)"
    },
    {
        "question": "Give me the runtime of Toy Story.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?runtime WHERE { res:Toy_Story dbo:runtime ?runtime }",
        "topic_entities": "http://dbpedia.org/resource/Toy_Story (Toy Story)"
    },
    {
        "question": "List the children of Margaret Thatcher.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:child ?uri }",
        "topic_entities": "http://dbpedia.org/resource/Margaret_Thatcher (Margaret Thatcher)"
    },
    {
        "question": "Give me all actors starring in movies directed by William Shatner.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring ?uri }",
        "topic_entities": "http://dbpedia.org/resource/William_Shatner (William Shatner)"
    },
    {
        "question": "List all games by GMT.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
        "topic_entities": "http://dbpedia.org/resource/GMT_Games (GMT Games)"
    },
    {
        "question": "Give me all video games published by Mean Hamster Software.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:VideoGame ; dbo:publisher res:Mean_Hamster_Software }",
        "topic_entities": "http://dbpedia.org/ontology/VideoGame (VideoGame), http://dbpedia.org/resource/Mean_Hamster_Software (Mean Hamster Software)"
    },
    {
        "question": "Give me all members of Prodigy.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri }",
        "topic_entities": "http://dbpedia.org/resource/The_Prodigy (The Prodigy)"
    },
    {
        "question": "Which holidays are celebrated around the world? test2",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Holiday }",
        "topic_entities": "http://dbpedia.org/ontology/Holiday (Holiday)"
    },
    {
        "question": "Give me the birth place of Frank Sinatra.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?place WHERE { res:Frank_Sinatra dbo:birthPlace ?place }",
        "topic_entities": "http://dbpedia.org/resource/Frank_Sinatra (Frank Sinatra)"
    },
    {
        "question": "Show me all books in Asimov's Foundation series.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series }",
        "topic_entities": "http://dbpedia.org/resource/Foundation_series (Foundation series)"
    },
    {
        "question": "Give me the grandchildren of Elvis Presley.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Elvis_Presley dbo:child ?child . ?child dbo:child ?uri }",
        "topic_entities": "http://dbpedia.org/resource/Elvis_Presley (Elvis Presley)"
    },
    {
        "question": "Give me all books by William Goldman with more than 300 pages.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:William_Goldman ; dbo:numberOfPages ?x FILTER ( ?x > 300 ) }",
        "topic_entities": "http://dbpedia.org/ontology/Book (Book), http://dbpedia.org/resource/William_Goldman (William Goldman)"
    },
    {
        "question": "Show me the book that Muhammad Ali wrote.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:Muhammad_Ali }",
        "topic_entities": "http://dbpedia.org/ontology/Book (Book), http://dbpedia.org/resource/Muhammad_Ali (Muhammad Ali)"
    },
    {
        "question": "Show me Hemingway's autobiography.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:author res:Ernest_Hemingway ; dbo:literaryGenre res:Autobiography }",
        "topic_entities": "http://dbpedia.org/resource/Ernest_Hemingway (Ernest Hemingway), http://dbpedia.org/resource/Autobiography (Autobiography)"
    },
    {
        "question": "Give me all Canadian Grunge record labels.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:RecordLabel ; dbo:genre res:Grunge ; dbo:country res:Canada }",
        "topic_entities": "http://dbpedia.org/ontology/RecordLabel (RecordLabel), http://dbpedia.org/resource/Canada (Canada), http://dbpedia.org/resource/Grunge (Grunge)"
    },
    {
        "question": "Give me the currency of China.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:China dbo:currency ?uri }",
        "topic_entities": "http://dbpedia.org/resource/China (China)"
    },
    {
        "question": "Give me all Swedish oceanographers.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:field res:Oceanography ; dbo:birthPlace res:Sweden }",
        "topic_entities": "http://dbpedia.org/resource/Sweden (Sweden), http://dbpedia.org/resource/Oceanography (Oceanography)"
    },
    {
        "question": "Give me all actors starring in Last Action Hero.",
        "query": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Last_Action_Hero dbo:starring ?uri }",
        "topic_entities": "http://dbpedia.org/resource/Last_Action_Hero (Last Action Hero)"
    }
]