[
    {
        "question": "who started pixar?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kk9v)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.0kk9v ns:organization.organization.founders ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.0kk9v ( Pixar)"
    },
    {
        "question": "who did hera marry?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03g3c)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.03g3c ns:fictional_universe.fictional_character.married_to ?y .\n?y ns:fictional_universe.marriage_of_fictional_characters.spouses ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.03g3c ( Hera)"
    },
    {
        "question": "who speaks farsi?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.032f6)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.032f6 ns:language.human_language.countries_spoken_in ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.032f6 ( Persian Language)"
    },
    {
        "question": "who was louis riel?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04qqn)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.04qqn ns:people.person.profession ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.04qqn ( Louis Riel)"
    },
    {
        "question": "who's kobe bryant?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01kmd4)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.01kmd4 ns:people.person.profession ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.01kmd4 ( Kobe Bryant)"
    },
    {
        "question": "who was tex beneke?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.076yxy)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.076yxy ns:people.person.profession ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.076yxy ( Tex Beneke)"
    },
    {
        "question": "who owns skywest?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01nhdy)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.01nhdy ns:organization.organization.parent ?y .\n?y ns:organization.organization_relationship.parent ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.01nhdy ( SkyWest Airlines)"
    },
    {
        "question": "who is james dean?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01w32s8)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.01w32s8 ns:people.person.profession ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.01w32s8 ( James Dean)"
    },
    {
        "question": "who was dan cody?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07m5fb)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.07m5fb ns:people.person.profession ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.07m5fb ( Dan Cody)"
    },
    {
        "question": "who is aidan davis?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.080p6xw)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.080p6xw ns:people.person.profession ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.080p6xw ( Aidan Davis)"
    },
    {
        "question": "where is mallorca?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g52z)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.0g52z ns:geography.island.body_of_water ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.0g52z ( Majorca)"
    },
    {
        "question": "who was louis xvi?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dj9w)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.0dj9w ns:royalty.noble_person.titles ?y .\n?y ns:royalty.noble_title_tenure.noble_title ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.0dj9w ( Louis XVI of France)"
    },
    {
        "question": "who's betty white?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.025mb_)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.025mb_ ns:people.person.profession ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.025mb_ ( Betty White)"
    },
    {
        "question": "who shot j lennon?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vsl3_)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.01vsl3_ ns:user.alexander.misc.murdered_person.murdered_by ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.01vsl3_ ( John Lennon)"
    },
    {
        "question": "who started google?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0387r)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.0387r ns:law.invention.inventor ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.0387r ( Google Search)"
    },
    {
        "question": "who is john garcia?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_lpf)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.03_lpf ns:people.person.profession ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.03_lpf ( John Garcia)"
    },
    {
        "question": "where is usc from?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03tw2s)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.03tw2s ns:location.location.containedby ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.03tw2s ( University of South Carolina)"
    },
    {
        "question": "where is madeira?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_z1)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.04_z1 ns:base.aareas.schema.administrative_area.administrative_parent ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.04_z1 ( Madeira)"
    },
    {
        "question": "where is bosnia?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0166b)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.0166b ns:base.locations.countries.continent ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.0166b ( Bosnia and Herzegovina)"
    },
    {
        "question": "who is aidan quinn?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.045c66)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.045c66 ns:people.person.profession ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.045c66 ( Aidan Quinn)"
    },
    {
        "question": "what city uses gmt?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03bdv)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.03bdv ns:time.time_zone.locations_in_this_time_zone ?x .\n?x ns:base.biblioness.bibs_location.loc_type ?sk0 .\nFILTER (str(?sk0) = \"City\")\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.03bdv ( Greenwich Mean Time Zone)"
    },
    {
        "question": "who owns audi 2011?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k50)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.0k50 ns:organization.organization.parent ?y .\n?y ns:organization.organization_relationship.parent ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.0k50 ( Audi)"
    },
    {
        "question": "what boudicca do?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01fz6)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.01fz6 ns:common.topic.notable_types ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.01fz6 ( Boudica)"
    },
    {
        "question": "what nestle owns?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01556g)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.01556g ns:business.business_operation.industry ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.01556g ( Nestl\u00e9)"
    },
    {
        "question": "what is kate spade?",
        "query": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06bkdx)\nFILTER (!isLiteral(?x) || lang(?x) = '' || langMatches(lang(?x), 'en'))\nns:m.06bkdx ns:people.person.profession ?x .\n}\n",
        "topic_entities": "http://rdf.freebase.com/ns/m.06bkdx ( Kate Spade)"
    }
]