[
    {
        "question": "What are the smallest, largest and average forest areas that are within a district which is placed south of Staffordshire?",
        "sparql": " SELECT (MIN(strdf:area(?forest_geoWKT)) AS ?areas_min) (MAX(strdf:area(?forest_geoWKT)) AS ?areas_max) (AVG(strdf:area(?forest_geoWKT)) AS ?areas_avg) WHERE { yago:Staffordshire geo:hasGeometry ?Suffolk_geo . ?Suffolk_geo geo:asWKT ?Suffolk_geoWKT . ?district rdf:type y2geoo:OS_District ; geo:hasGeometry ?district_geo . ?district_geo geo:asWKT ?district_geoWKT FILTER strdf:below(?district_geoWKT, ?Suffolk_geoWKT) ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?forest_geo . ?forest_geo geo:asWKT ?forest_geoWKT FILTER geof:sfWithin(?forest_geoWKT, ?district_geoWKT) } "
    },
    {
        "question": "Are there lakes located inside forests in Ireland?",
        "sparql": " ASK WHERE { ?for rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?o . ?o geo:asWKT ?forestGeo . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?lakeGeo . yago:Republic_of_Ireland geo:hasGeometry ?ir . ?ir geo:asWKT ?irWKT FILTER ( geof:sfContains(?forestGeo, ?lakeGeo) && geof:sfWithin(?lakeGeo, ?irWKT) ) } "
    },
    {
        "question": "What is the largest forest in Texas by area?",
        "sparql": " SELECT ?forest (strdf:area(?fWKT) AS ?farea) WHERE { yago:Texas geo:hasGeometry ?usGeo . ?usGeo geo:asWKT ?usWKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?fGeo . ?fGeo geo:asWKT ?fWKT FILTER geof:sfWithin(?fWKT, ?usWKT) } ORDER BY DESC(?farea) LIMIT 1 "
    },
    {
        "question": "What is the number of lakes that are connected to a forest?",
        "sparql": " SELECT (COUNT(DISTINCT ?x) AS ?lakes) WHERE { ?x rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT . ?o rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?oGeom . ?oGeom geo:asWKT ?iWKT FILTER geof:sfIntersects(?xWKT, ?iWKT) } "
    },
    {
        "question": "Where is Southampton situated?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Southampton geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "What is the total land area within Manchester's boundaries?",
        "sparql": " SELECT DISTINCT (strdf:area(?xWKT) AS ?totalArea) WHERE { yago:Manchester geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT } "
    },
    {
        "question": "Is Belfast west of London?",
        "sparql": " ASK WHERE { y2geor:geoentity_City_of_Belfast_3333223 geo:hasGeometry ?xgeo . ?xgeo geo:asWKT ?xWKT . yago:geoentity_City_of_London_2643744 geo:hasGeometry ?ygeo . ?ygeo geo:asWKT ?yWKT FILTER strdf:left(?xWKT, ?yWKT) } "
    },
    {
        "question": "Which county of Great Britain has the most lakes?",
        "sparql": " SELECT ?county (COUNT(?park) AS ?parkCount) WHERE { ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?countyWKT . ?park rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?parkWKT FILTER geof:sfWithin(?parkWKT, ?countyWKT) } GROUP BY ?county ORDER BY DESC(?parkCount) LIMIT 1 "
    },
    {
        "question": "How many citizens does Astypalaia have?",
        "sparql": " SELECT ?p WHERE { yago:Astypalaia y2geoo:hasGAG_Population ?p } "
    },
    {
        "question": "Where is Nafpaktia located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Nafpaktia geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which districts border with the Stafford district?",
        "sparql": " SELECT DISTINCT ?district WHERE { yago:geoentity_Stafford_District_7290631 geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcWKT . ?district rdf:type y2geoo:OS_District ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?cWKT FILTER geof:sfTouches(?lcWKT, ?cWKT) } "
    },
    {
        "question": "Which are the unitary authorities of England that border with Scotland?",
        "sparql": " SELECT DISTINCT ?d WHERE { ?d rdf:type y2geoo:OS_UnitaryAuthority ; geo:hasGeometry ?cGeom . ?cGeom geo:asWKT ?cWKT . yago:Scotland geo:hasGeometry ?geom . ?geom geo:asWKT ?iWKT . yago:England geo:hasGeometry ?geom1 . ?geom1 geo:asWKT ?iWKT1 FILTER ( geof:sfWithin(?cWKT, ?iWKT1) && geof:sfTouches(?cWKT, ?iWKT) ) } "
    },
    {
        "question": "Which district of the United Kingdom has the most villages?",
        "sparql": " SELECT DISTINCT ?district WHERE { ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?district rdf:type y2geoo:OS_District ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . yago:United_Kingdom geo:hasGeometry ?UKgeo . ?UKgeo geo:asWKT ?UKWKT FILTER ( geof:sfWithin(?geoWKT2, ?UKWKT) && geof:sfWithin(?geoWKT1, ?geoWKT2) ) } GROUP BY ?district ORDER BY DESC(COUNT(?village)) LIMIT 1 "
    },
    {
        "question": "What are the largest lakes that belong to counties south of Epping Forest?",
        "sparql": " SELECT DISTINCT ?locality (strdf:area(?locality_geoWKT) AS ?lakeArea) WHERE { yago:Epping_Forest geo:hasGeometry ?for_geo . ?for_geo geo:asWKT ?for_geoWKT . ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?county_geo . ?county_geo geo:asWKT ?county_geoWKT FILTER strdf:above(?for_geoWKT, ?county_geoWKT) ?locality rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?locality_geo . ?locality_geo geo:asWKT ?locality_geoWKT FILTER geof:sfWithin(?locality_geoWKT, ?county_geoWKT) } ORDER BY DESC(?lakeArea) LIMIT 1 "
    },
    {
        "question": "How many lakes overlap with Greek municipalities?",
        "sparql": " SELECT (COUNT(DISTINCT ?Lake) AS ?lakes) WHERE { ?m rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?MDGeo . ?MDGeo geo:asWKT ?MDPolygon . ?Lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?LakeGeo . ?LakeGeo geo:asWKT ?LakePolygon . yago:Greece geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT FILTER ( geof:sfWithin(?MDPolygon, ?geoWKT) && geof:sfOverlaps(?MDPolygon, ?LakePolygon) ) } "
    },
    {
        "question": "Is Samos east of Mykonos?",
        "sparql": " ASK WHERE { yago:Samos geo:hasGeometry ?geo1 . ?geo1 geo:asWKT ?wkt1 . yago:Mykonos geo:hasGeometry ?geo2 . ?geo2 geo:asWKT ?wkt2 FILTER strdf:right(?wkt1, ?wkt2) } "
    }
]