[
    {
        "question": "Which municipalities in Greece have parks?",
        "sparql": " SELECT DISTINCT ?municipality WHERE { ?municipality rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?munWKT . ?beach rdf:type y2geoo:OSM_park ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?beachWKT FILTER geof:sfWithin(?beachWKT, ?munWKT) } "
    },
    {
        "question": "Which counties are west of County Wexford?",
        "sparql": " SELECT DISTINCT ?x WHERE { { ?x rdf:type y2geoo:OSI_County_Council } UNION { ?x rdf:type y2geoo:OSI_City_and_County_Council } ?x geo:hasGeometry ?gx . ?gx geo:asWKT ?xWKT . yago:County_Wexford geo:hasGeometry ?gy . ?gy geo:asWKT ?yWKT FILTER strdf:left(?xWKT, ?yWKT) } "
    },
    {
        "question": "Which towns in County Longford with area bigger than 0.01 are west of Dublin?",
        "sparql": " SELECT ?town WHERE { ?town rdf:type y2geoo:OSM_town ; geo:hasGeometry ?tg . ?tg geo:asWKT ?tgeoWKT . yago:County_Longford geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT FILTER strdf:within(?tgeoWKT, ?geoWKT) FILTER ( strdf:area(?tgeoWKT) > 0.01 ) yago:Dublin geo:hasGeometry ?dg . ?dg geo:asWKT ?dgeoWKT FILTER strdf:left(?geoWKT, ?dgeoWKT) } "
    },
    {
        "question": "Which municipality in Attica is less than 50km away from Corinth?",
        "sparql": " SELECT DISTINCT ?forest WHERE { <http://yago-knowledge.org/resource/Attica_(region)> geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?forest rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?ov . ?ov geo:asWKT ?geoWKTv . yago:geoentity_Dimos_Corinth_8133673 geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER geof:sfWithin(?geoWKTv, ?geoWKT1) FILTER ( geof:distance(?geoWKTv, ?geoWKT2, uom:metre) < 50000 ) } "
    },
    {
        "question": "Which lakes are entirely contained by a Greek municipality?",
        "sparql": " SELECT DISTINCT ?l WHERE { ?m rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?mg . ?mg geo:asWKT ?mw . ?l rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lw . yago:Greece geo:hasGeometry ?grgeo . ?grgeo geo:asWKT ?grWKT FILTER ( geof:sfWithin(?mw, ?grWKT) && geof:sfWithin(?lw, ?mw) ) } "
    },
    {
        "question": "Is Norwich at least 200 kilometers away from Greece?",
        "sparql": " ASK WHERE { yago:geoentity_Norwich_District_7290598 geo:hasGeometry ?norwichGeometry . ?norwichGeometry geo:asWKT ?wktNorwich . yago:Greece geo:hasGeometry ?londonGeometry . ?londonGeometry geo:asWKT ?wktLondon FILTER ( geof:distance(?wktNorwich, ?wktLondon, uom:metre) >= 200000 ) } "
    },
    {
        "question": "Which municipalities does the Central Athens Regional Unit contain?",
        "sparql": " SELECT DISTINCT ?y WHERE { yago:geoentity_Perifereiak\u00ed_En\u00f3tita_Kentriko\u00fa_Tom\u00e9a_Athin\u00f3n_8200482 geo:hasGeometry ?gx . ?gx geo:asWKT ?xWKT . ?y rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?gy . ?gy geo:asWKT ?yWKT FILTER geof:sfContains(?xWKT, ?yWKT) } "
    },
    {
        "question": "Which are Dublin's neighboring townlands?",
        "sparql": " SELECT DISTINCT ?townland WHERE { yago:Dublin geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?WKT1 . ?townland rdf:type y2geoo:OSI_Townland ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?WKT2 FILTER geof:sfTouches(?WKT2, ?WKT1) } "
    },
    {
        "question": "Which metropolitan districts are adjacent to Liverpool?",
        "sparql": " SELECT DISTINCT ?metrdist WHERE { yago:Liverpool geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcWKT . ?metrdist rdf:type y2geoo:OS_MetropolitanDistrict ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?cWKT FILTER geof:sfTouches(?lcWKT, ?cWKT) } "
    },
    {
        "question": "Which town of Ireland is closest to Northern Ireland?",
        "sparql": " SELECT ?town (geof:distance(?tWKT, ?niWKT, uom:metre) AS ?dist) WHERE { yago:Northern_Ireland geo:hasGeometry ?niGeo . ?niGeo geo:asWKT ?niWKT . ?town rdf:type y2geoo:OSM_town ; geo:hasGeometry ?tGeo . ?tGeo geo:asWKT ?tWKT . yago:Republic_of_Ireland geo:hasGeometry ?iGeo . ?iGeo geo:asWKT ?iWKT FILTER geof:sfWithin(?tWKT, ?iWKT) } ORDER BY ?dist LIMIT 1 "
    },
    {
        "question": "Which canals cross Dublin?",
        "sparql": " SELECT DISTINCT ?canal WHERE { yago:Dublin geo:hasGeometry ?dgeo . ?dgeo geo:asWKT ?dWKT . ?canal rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?pgeo . ?pgeo geo:asWKT ?pWKT FILTER geof:sfCrosses(?dWKT, ?pWKT) } "
    },
    {
        "question": "Which of the municipalities that border Thessaloniki has the biggest area?",
        "sparql": " SELECT ?neighboring (strdf:area(?yWKT) AS ?totalArea) WHERE { yago:geoentity_Dimos_Thessaloniki_8133841 geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT . ?neighboring rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?yGeom . ?yGeom geo:asWKT ?yWKT FILTER geof:sfTouches(?xWKT, ?yWKT) } ORDER BY DESC(?totalArea) LIMIT 1 "
    },
    {
        "question": "Which islands are north of Dublin?",
        "sparql": " SELECT DISTINCT ?p WHERE { ?p rdf:type y2geoo:OSM_island ; geo:hasGeometry ?o . ?o geo:asWKT ?bWKT . yago:Dublin geo:hasGeometry ?g . ?g geo:asWKT ?dWKT FILTER strdf:above(?bWKT, ?dWKT) } "
    },
    {
        "question": "How many parks exist in English counties?",
        "sparql": " SELECT (COUNT(DISTINCT ?park) AS ?parks) WHERE { ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT . ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?x2Geo . ?x2Geo geo:asWKT ?x2WKT FILTER geof:sfWithin(?x1WKT, ?x2WKT) } "
    },
    {
        "question": "How many Greek regional units contain islands?",
        "sparql": " SELECT (COUNT(DISTINCT ?ru) AS ?rus) WHERE { ?ru rdf:type y2geoo:GAG_RegionalUnit ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 . ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?wkt2 FILTER geof:sfContains(?wkt1, ?wkt2) } "
    },
    {
        "question": "Which is the largest district that borders Oxford?",
        "sparql": " SELECT DISTINCT ?Mdistrict (strdf:area(?cWKT) AS ?area) WHERE { yago:Oxford geo:hasGeometry ?egeo . ?egeo geo:asWKT ?eWKT . ?Mdistrict rdf:type y2geoo:OS_District ; geo:hasGeometry ?cgeo . ?cgeo geo:asWKT ?cWKT FILTER geof:sfTouches(?eWKT, ?cWKT) } ORDER BY DESC(?area) LIMIT 1 "
    },
    {
        "question": "Where is Distomo-Arachova-Antikyra located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Distomo-Arachova-Antikyra geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Is there a lagoon located north of a beach in Thasos?",
        "sparql": " ASK WHERE { yago:Thasos geo:hasGeometry ?o2 . ?o2 geo:asWKT ?xWKT2 . ?x2 rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?x2Geom . ?x2Geom geo:asWKT ?iWKT2 . ?x1 rdf:type y2geoo:OSM_lagoon ; geo:hasGeometry ?x1Geom . ?x1Geom geo:asWKT ?iWKT1 FILTER ( ( geof:sfWithin(?iWKT1, ?xWKT2) && geof:sfWithin(?iWKT2, ?xWKT2) ) && strdf:above(?iWKT1, ?iWKT2) ) } "
    },
    {
        "question": "Which counties border the county of Bedford?",
        "sparql": " SELECT DISTINCT ?CountryCouncil WHERE { yago:Bedford geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?CountryCouncil rdf:type y2geoo:OS_County ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?cWKT FILTER geof:sfTouches(?geoWKT, ?cWKT) } "
    },
    {
        "question": "Is County Mayo bordering County Sligo?",
        "sparql": " ASK WHERE { yago:County_Mayo geo:hasGeometry ?o . ?o geo:asWKT ?WKT . yago:County_Sligo geo:hasGeometry ?o1 . ?o1 geo:asWKT ?WKT1 FILTER geof:sfTouches(?WKT, ?WKT1) } "
    },
    {
        "question": "How many streams interect beaches and lagoons?",
        "sparql": " SELECT (COUNT(DISTINCT ?stream) AS ?streams) WHERE { ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?cWKT . ?park rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?bWKT . ?l rdf:type y2geoo:OSM_lagoon ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?lWKT FILTER geof:sfIntersects(?cWKT, ?bWKT) FILTER geof:sfIntersects(?cWKT, ?lWKT) } "
    },
    {
        "question": "Which lakes are entirely contained by a Greek region?",
        "sparql": " SELECT DISTINCT ?l WHERE { ?m rdf:type y2geoo:GAG_Region ; geo:hasGeometry ?mg . ?mg geo:asWKT ?mw . ?l rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lw . yago:Greece geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT FILTER ( geof:sfWithin(?mw, ?geoWKT) && geof:sfWithin(?lw, ?mw) ) } "
    },
    {
        "question": "Are there any bays next to parks in Dublin?",
        "sparql": " ASK WHERE { yago:Dublin geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?prkWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geoPrk . ?geoPrk geo:asWKT ?lWKT . ?bay rdf:type y2geoo:OSM_bay ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?cWKT FILTER ( geof:sfWithin(?lWKT, ?prkWKT) && geof:sfTouches(?cWKT, ?lWKT) ) } "
    },
    {
        "question": "Where is Galatsi located?",
        "sparql": " SELECT ?geoWKT WHERE { yago:Galatsi geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "How many streams are within a nature reserve?",
        "sparql": " SELECT (COUNT(DISTINCT ?stream) AS ?streams) WHERE { ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?sWKT . ?reserve rdf:type y2geoo:OSM_nature_reserve ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?rWKT FILTER geof:sfWithin(?sWKT, ?rWKT) } "
    },
    {
        "question": "Is there a lake that intersects with all the regional units of Epirus?",
        "sparql": " ASK WHERE { { SELECT ?lake WHERE { ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lakeGeo . ?lakeGeo geo:asWKT ?lakeWKT . ?region rdf:type y2geoo:GAG_RegionalUnit ; geo:hasGeometry ?regionGeo . ?regionGeo geo:asWKT ?regionWKT . <http://yago-knowledge.org/resource/Epirus_(region)> geo:hasGeometry ?eGeo . ?eGeo geo:asWKT ?eWKT FILTER ( geof:sfContains(?eWKT, ?regionWKT) && geof:sfIntersects(?lakeWKT, ?regionWKT) ) } GROUP BY ?lake HAVING ( COUNT(?region) = 4 ) } } "
    },
    {
        "question": "What are the parks situated on islands of the US?",
        "sparql": " SELECT DISTINCT ?p1 WHERE { ?p1 rdf:type y2geoo:OSM_park ; geo:hasGeometry ?p1geo . ?p1geo geo:asWKT ?p1WKT . ?p2 rdf:type y2geoo:OSM_island ; geo:hasGeometry ?p2geo . ?p2geo geo:asWKT ?p2WKT . yago:United_States geo:hasGeometry ?o1 . ?o1 geo:asWKT ?gWKT FILTER ( geof:sfWithin(?p2WKT, ?gWKT) && geof:sfWithin(?p1WKT, ?p2WKT) ) } "
    },
    {
        "question": "Is Samos west of Rhodes?",
        "sparql": " ASK WHERE { yago:Samos geo:hasGeometry ?samos_geo . ?samos_geo geo:asWKT ?samosWKT . yago:Rhodes geo:hasGeometry ?rodos_geo . ?rodos_geo geo:asWKT ?rodosWKT FILTER strdf:left(?samosWKT, ?rodosWKT) } "
    },
    {
        "question": "Which beaches are near Naxos?",
        "sparql": " SELECT DISTINCT ?beach WHERE { yago:Naxos geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER ( geof:distance(?lcnWKT, ?lWKT, uom:metre) < 5000 ) } "
    },
    {
        "question": "Which wards comprise the city of Belfast?",
        "sparql": " SELECT DISTINCT ?ward WHERE { ?ward rdf:type y2geoo:OSNI_Ward ; geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT . yago:geoentity_City_of_Belfast_3333223 geo:hasGeometry ?x2Geo . ?x2Geo geo:asWKT ?x2WKT FILTER geof:sfWithin(?x1WKT, ?x2WKT) } "
    },
    {
        "question": "Is Peristeri west of Zografou?",
        "sparql": " ASK WHERE { yago:Peristeri geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?WKT1 . yago:Zografou geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?WKT2 FILTER strdf:left(?WKT1, ?WKT2) } "
    },
    {
        "question": "Where is Kastanas beach located?",
        "sparql": " SELECT ?wkt WHERE { yago:geoentity_Paral\u00eda_Kastan\u00e1s_10277719 geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?wkt } "
    },
    {
        "question": "Which bays are east of parks in Dublin?",
        "sparql": " SELECT DISTINCT ?bay WHERE { yago:Dublin geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?cWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geoPrk . ?geoPrk geo:asWKT ?parkWKT . ?bay rdf:type y2geoo:OSM_bay ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?bayWKT FILTER ( geof:sfWithin(?parkWKT, ?cWKT) && strdf:right(?bayWKT, ?parkWKT) ) } "
    },
    {
        "question": "Which are the two smallest districts that border Cumbria?",
        "sparql": " SELECT DISTINCT ?Mdistrict (strdf:area(?cWKT) AS ?area) WHERE { yago:Cumbria geo:hasGeometry ?egeo . ?egeo geo:asWKT ?eWKT . ?Mdistrict rdf:type y2geoo:OS_District ; geo:hasGeometry ?cgeo . ?cgeo geo:asWKT ?cWKT FILTER geof:sfTouches(?eWKT, ?cWKT) } ORDER BY ASC(?area) LIMIT 2 "
    },
    {
        "question": "Which forests are found within the boundaries of Norfolk?",
        "sparql": " SELECT DISTINCT ?l WHERE { yago:Norfolk geo:hasGeometry ?mg . ?mg geo:asWKT ?mw . ?l rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lw FILTER geof:sfContains(?mw, ?lw) } "
    },
    {
        "question": "Which forests are contained in the barony of Coshlea?",
        "sparql": " SELECT DISTINCT ?l WHERE { y2geor:osientity_2AE19629112213A3E055000000000001 geo:hasGeometry ?mg . ?mg geo:asWKT ?mw . ?l rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lw FILTER geof:sfContains(?mw, ?lw) } "
    },
    {
        "question": "Which villages are west of bays in the Peloponnese region?",
        "sparql": " SELECT DISTINCT ?village WHERE { <http://yago-knowledge.org/resource/Peloponnese_(region)> geo:hasGeometry ?geom1 . ?geom1 geo:asWKT ?pWKT . ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?geomV . ?geomV geo:asWKT ?vWKT . ?bay rdf:type y2geoo:OSM_bay ; geo:hasGeometry ?geomB . ?geomB geo:asWKT ?bWKT FILTER ( geof:sfWithin(?vWKT, ?pWKT) && strdf:left(?vWKT, ?bWKT) ) } "
    },
    {
        "question": "Is Ladis north of Dublin?",
        "sparql": " ASK WHERE { yago:Ladis geo:hasGeometry ?ladisGeom . ?ladisGeom geo:asWKT ?ladisWKT . yago:Dublin geo:hasGeometry ?dublinGeom . ?dublinGeom geo:asWKT ?dublinWKT FILTER strdf:above(?ladisWKT, ?dublinWKT) } "
    },
    {
        "question": "Is Bedford east of Essex?",
        "sparql": " ASK WHERE { yago:Bedford geo:hasGeometry ?o . ?o geo:asWKT ?WKT . yago:Essex geo:hasGeometry ?o1 . ?o1 geo:asWKT ?WKT1 FILTER strdf:right(?WKT, ?WKT1) } "
    },
    {
        "question": "What is the average US county population?",
        "sparql": " SELECT (AVG(xsd:float(?population)) AS ?avg) WHERE { ?county y2geoo:hasGADM_Description \"County\" ; geo:hasGeometry ?c . ?c geo:asWKT ?cWKT . yago:United_States geo:hasGeometry ?usGeo . ?usGeo geo:asWKT ?usWKT . ?county y2geoo:POPULATION ?population FILTER geof:sfWithin(?cWKT, ?usWKT) } "
    },
    {
        "question": "Where is Swansea located?",
        "sparql": " SELECT ?geoWKT WHERE { yago:Swansea geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which counties border the city of Cork?",
        "sparql": " SELECT DISTINCT ?county WHERE { yago:geoentity_Cork_City_7778678 geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } ?county geo:hasGeometry ?geomC . ?geomC geo:asWKT ?cWKT FILTER geof:sfTouches(?geoWKT, ?cWKT) } "
    },
    {
        "question": "Which region of Greece has the biggest area?",
        "sparql": " SELECT DISTINCT ?region (strdf:area(?geoWKT) AS ?regionArea) WHERE { ?region rdf:type y2geoo:GAG_Region ; geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } ORDER BY DESC(?regionArea) LIMIT 1 "
    },
    {
        "question": "How far is Cumbria from Birmingham?",
        "sparql": " SELECT DISTINCT (geof:distance(?A, ?B, uom:metre) AS ?distance) WHERE { yago:Cumbria geo:hasGeometry ?a . ?a geo:asWKT ?A . yago:Birmingham geo:hasGeometry ?b . ?b geo:asWKT ?B } "
    },
    {
        "question": "How many baronies border with city councils?",
        "sparql": " SELECT (COUNT(DISTINCT ?o) AS ?os) WHERE { ?x rdf:type y2geoo:OSI_City_Council ; geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT . ?o rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?oGeom . ?oGeom geo:asWKT ?iWKT FILTER geof:sfTouches(?xWKT, ?iWKT) } "
    },
    {
        "question": "Which Texan county has the most lakes?",
        "sparql": " SELECT ?county (COUNT(?lake) AS ?lakeCount) WHERE { ?county y2geoo:hasGADM_Description \"County\" ; geo:hasGeometry ?countyGeom . ?countyGeom geo:asWKT ?countyWKT . yago:Texas geo:hasGeometry ?tGeom . ?tGeom geo:asWKT ?texasWKT FILTER geof:sfWithin(?countyWKT, ?texasWKT) ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lakeGeom . ?lakeGeom geo:asWKT ?lakeWkt FILTER geof:sfWithin(?lakeWkt, ?countyWKT) } GROUP BY ?county ORDER BY DESC(?lakeCount) LIMIT 1 "
    },
    {
        "question": "Is Limerick closer to Waterford than Dublin?",
        "sparql": " ASK WHERE { yago:geoentity_Limerick_City_and_County_Council_11611445 geo:hasGeometry ?tgeom . ?tgeom geo:asWKT ?twkt . yago:geoentity_Waterford_City_and_County_Council_11611446 geo:hasGeometry ?ageom . ?ageom geo:asWKT ?awkt . yago:Dublin geo:hasGeometry ?igeom . ?igeom geo:asWKT ?iwkt FILTER ( geof:distance(?twkt, ?awkt, uom:metre) < geof:distance(?iwkt, ?awkt, uom:metre) ) } "
    },
    {
        "question": "Is the population of the most nothern city in Scotland less than the population of the most southern city in Scotland?",
        "sparql": " ASK WHERE { { SELECT ?cpop1 WHERE { yago:Scotland geo:hasGeometry ?sGeo . ?sGeo geo:asWKT ?sWKT . ?city rdf:type y2geoo:OSM_city ; yago:hasPopulation ?cpop1 ; geo:hasGeometry ?cGeo . ?cGeo geo:asWKT ?cWKT . ?southCity rdf:type y2geoo:OSM_city ; geo:hasGeometry ?scGeo . ?scGeo geo:asWKT ?scWKT FILTER ( geof:sfWithin(?scWKT, ?sWKT) && geof:sfWithin(?scWKT, ?sWKT) ) FILTER NOT EXISTS { FILTER ( ( ?city != ?southCity ) && strdf:above(?scWKT, ?cWKT) ) } } } { SELECT ?cpop2 WHERE { yago:Scotland geo:hasGeometry ?s2Geo . ?s2Geo geo:asWKT ?s2WKT . ?city2 rdf:type y2geoo:OSM_city ; yago:hasPopulation ?cpop2 ; geo:hasGeometry ?c2Geo . ?c2Geo geo:asWKT ?c2WKT . ?southCity2 rdf:type y2geoo:OSM_city ; geo:hasGeometry ?sc2Geo . ?sc2Geo geo:asWKT ?sc2WKT FILTER ( geof:sfWithin(?sc2WKT, ?s2WKT) && geof:sfWithin(?sc2WKT, ?s2WKT) ) FILTER NOT EXISTS { FILTER ( ( ?city2 != ?southCity2 ) && strdf:above(?sc2WKT, ?c2WKT) ) } } } FILTER ( xsd:integer(?cpop1) < xsd:integer(?cpop2) ) } "
    },
    {
        "question": "Where is Oxfordshire located?",
        "sparql": " SELECT ?WKT WHERE { yago:Oxfordshire geo:hasGeometry ?o . ?o geo:asWKT ?WKT } "
    },
    {
        "question": "Which civil parish bordering Killinane occupies the smallest area?",
        "sparql": " SELECT DISTINCT ?x WHERE { ?x rdf:type y2geoo:OSI_Civil_Parish ; geo:hasGeometry ?xgeo . ?xgeo geo:asWKT ?xWKT . yago:geoentity_Kilkieran_3302356 geo:hasGeometry ?ygeo . ?ygeo geo:asWKT ?yWKT FILTER geof:sfTouches(?xWKT, ?yWKT) } ORDER BY ASC(strdf:area(?xWKT)) LIMIT 1 "
    },
    {
        "question": "Where is the location of Lake Kerkini?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Lake_Kerkini geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "What is the number of Counties that intersect with lakes?",
        "sparql": " SELECT (COUNT(DISTINCT ?county) AS ?counties) WHERE { { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } UNION { ?county rdf:type y2geoo:OS_County } ?county geo:hasGeometry ?geomc . ?geomc geo:asWKT ?WKT1 . ?forest rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geomf . ?geomf geo:asWKT ?WKT2 FILTER geof:sfIntersects(?WKT2, ?WKT1) } "
    },
    {
        "question": "Which lakes are located in Kilkis?",
        "sparql": " SELECT DISTINCT ?lake WHERE { yago:geoentity_Dimos_Kilkis_8133969 geo:hasGeometry ?o1 . ?o1 geo:asWKT ?munGeo . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?lakeWKT FILTER geof:sfWithin(?lakeWKT, ?munGeo) } "
    },
    {
        "question": "Which Greek regional units have less than 10000 inhabitants?",
        "sparql": " SELECT ?region WHERE { ?region rdf:type y2geoo:GAG_RegionalUnit ; y2geoo:hasGAG_Population ?pop FILTER ( ?pop < 10000 ) } "
    },
    {
        "question": "Show me the biggest park in Liverpool",
        "sparql": " SELECT ?park (strdf:area(?pWKT) AS ?parkArea) WHERE { yago:Liverpool geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?lWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?pWKT FILTER geof:sfWithin(?pWKT, ?lWKT) } ORDER BY DESC(?parkArea) LIMIT 1 "
    },
    {
        "question": "Which is the largest bay in the Republic of Ireland?",
        "sparql": " SELECT DISTINCT ?bay (strdf:area(?bWKT) AS ?bArea) WHERE { ?bay rdf:type y2geoo:OSM_bay ; geo:hasGeometry ?geomB . ?geomB geo:asWKT ?bWKT . yago:Republic_of_Ireland geo:hasGeometry ?iGeom . ?iGeom geo:asWKT ?iWKT FILTER geof:sfIntersects(?bWKT, ?iWKT) } ORDER BY DESC(?bArea) LIMIT 1 "
    },
    {
        "question": "Is Crete south of Attica?",
        "sparql": " ASK WHERE { yago:Crete geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . <http://yago-knowledge.org/resource/Attica_(region)> geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER strdf:below(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "How many parks are located within city limits?",
        "sparql": " SELECT (COUNT(DISTINCT ?park) AS ?parks) WHERE { ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT . ?city rdf:type y2geoo:OSM_city ; geo:hasGeometry ?x2Geo . ?x2Geo geo:asWKT ?x2WKT FILTER geof:sfWithin(?x1WKT, ?x2WKT) } "
    },
    {
        "question": "Does Peristeri intersect with Nea Smyrni?",
        "sparql": " ASK WHERE { yago:Peristeri geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT . yago:Nea_Smyrni geo:hasGeometry ?g2 . ?g2 geo:asWKT ?geoWKT2 FILTER geof:sfIntersects(?geoWKT, ?geoWKT2) } "
    },
    {
        "question": "Which streams in the Republic of Ireland are tributaries?",
        "sparql": " SELECT DISTINCT ?river WHERE { ?river rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?wkt2 . yago:Republic_of_Ireland geo:hasGeometry ?g3 . ?g3 geo:asWKT ?wkt3 FILTER ( ( geof:sfWithin(?wkt2, ?wkt3) && geof:sfIntersects(?wkt1, ?wkt2) ) && geof:sfCrosses(?wkt1, ?wkt2) ) } "
    },
    {
        "question": "Which districts share a border with Wakefield district?",
        "sparql": " SELECT DISTINCT ?district WHERE { yago:City_of_Wakefield geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?district rdf:type y2geoo:OS_District ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER geof:sfTouches(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Which regions border the Central Macedonia region?",
        "sparql": " SELECT DISTINCT ?region WHERE { yago:Central_Macedonia geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?region rdf:type y2geoo:GAG_Region ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER geof:sfTouches(?geoWKT1, ?geoWKT2) } "
    },
    {
        "question": "Which is the largest lake south of Thessaloniki and north of Athens?",
        "sparql": " SELECT ?lake (strdf:area(?lakeWKT) AS ?forestArea) WHERE { yago:Greece geo:hasGeometry ?o5 . ?o5 geo:asWKT ?greeceWKT . yago:geoentity_Dimos_Thessaloniki_8133841 geo:hasGeometry ?o1 . ?o1 geo:asWKT ?thessWKT . yago:geoentity_Dimos_Athens_8133876 geo:hasGeometry ?o2 . ?o2 geo:asWKT ?athensWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o3 . ?o3 geo:asWKT ?lakeWKT FILTER ( ( geof:sfContains(?greeceWKT, ?lakeWKT) && strdf:below(?lakeWKT, ?thessWKT) ) && strdf:above(?lakeWKT, ?athensWKT) ) } ORDER BY DESC(?forestArea) LIMIT 1 "
    },
    {
        "question": "How many towns have beaches in the Republic of Ireland?",
        "sparql": " SELECT (COUNT(DISTINCT ?town) AS ?towns) WHERE { ?town rdf:type y2geoo:OSM_town ; geo:hasGeometry ?geomT . ?geomT geo:asWKT ?fWKT . ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT . yago:Republic_of_Ireland geo:hasGeometry ?iGeom . ?iGeom geo:asWKT ?iWKT FILTER ( ( geof:sfWithin(?lWKT, ?iWKT) && geof:sfWithin(?fWKT, ?iWKT) ) && geof:sfTouches(?lWKT, ?fWKT) ) } "
    },
    {
        "question": "What is the largest lake in Scotland?",
        "sparql": " SELECT ?city (strdf:area(?cWKT) AS ?area) WHERE { ?city rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geoc . ?geoc geo:asWKT ?cWKT . yago:Scotland geo:hasGeometry ?geom . ?geom geo:asWKT ?sWKT FILTER geof:sfContains(?sWKT, ?cWKT) } ORDER BY DESC(?area) LIMIT 1 "
    },
    {
        "question": "Is there a stream near Greenwich?",
        "sparql": " ASK WHERE { ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT . yago:geoentity_Greenwich_3333147 geo:hasGeometry ?x2Geo . ?x2Geo geo:asWKT ?x2WKT FILTER ( geof:distance(?x1WKT, ?x2WKT, uom:metre) < 5000 ) } "
    },
    {
        "question": "Which municipalities in Central Athens that intersect with a park have a population of more than 10.000 people?",
        "sparql": " SELECT DISTINCT ?municipality WHERE { ?municipality rdf:type y2geoo:GAG_Municipality ; y2geoo:hasGAG_Population ?population ; geo:hasGeometry ?om . ?om geo:asWKT ?geoWKT . yago:geoentity_Perifereiak\u00ed_En\u00f3tita_Kentriko\u00fa_Tom\u00e9a_Athin\u00f3n_8200482 geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?parkGeometry . ?parkGeometry geo:asWKT ?parkWKT FILTER geof:sfWithin(?geoWKT, ?geoWKT1) FILTER strdf:intersects(?geoWKT, ?parkWKT) FILTER ( ?population > 10000 ) } "
    },
    {
        "question": "Is Oxfordshire more than 100km away from Kent?",
        "sparql": " ASK WHERE { yago:Oxfordshire geo:hasGeometry ?geo . ?geo geo:asWKT ?oxfWKT . yago:Kent geo:hasGeometry ?geo2 . ?geo2 geo:asWKT ?kentWKT FILTER ( geof:distance(?oxfWKT, ?kentWKT, uom:metre) > 100000 ) } "
    },
    {
        "question": "Which forests are within baronies in the Republic of Ireland?",
        "sparql": " SELECT DISTINCT ?for WHERE { ?for rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?o . ?o geo:asWKT ?forestGeo . ?barony rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?baronyGeo . yago:Republic_of_Ireland geo:hasGeometry ?ir . ?ir geo:asWKT ?irWKT FILTER ( geof:sfWithin(?forestGeo, ?baronyGeo) && geof:sfWithin(?baronyGeo, ?irWKT) ) } "
    },
    {
        "question": "Which municipality of Greece has the smallest number of inhabitants?",
        "sparql": " SELECT DISTINCT ?mun WHERE { ?mun rdf:type y2geoo:GAG_Municipality ; y2geoo:hasGAG_Population ?population } ORDER BY ASC(?population) LIMIT 1 "
    },
    {
        "question": "Which lake in Northern Ireland intersects with the most counties?",
        "sparql": " SELECT ?lake WHERE { { SELECT ?lake ?county WHERE { yago:Northern_Ireland geo:hasGeometry ?niGeo . ?niGeo geo:asWKT ?niWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lGeo . ?lGeo geo:asWKT ?lWKT . ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?cGeo . ?cGeo geo:asWKT ?cWKT FILTER ( ( geof:sfWithin(?lWKT, ?niWKT) && geof:sfWithin(?cWKT, ?niWKT) ) && geof:sfIntersects(?lWKT, ?cWKT) ) } } } GROUP BY ?lake ?county ORDER BY DESC(COUNT(?county)) LIMIT 1 "
    },
    {
        "question": "Where is Arkansas located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Arkansas geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which localities are located east of forests in County Wicklow?",
        "sparql": " SELECT DISTINCT ?a WHERE { yago:County_Wicklow geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?a rdf:type y2geoo:OSM_locality ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?b rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER ( ( geof:sfWithin(?geoWKT1, ?geoWKT) && geof:sfWithin(?geoWKT2, ?geoWKT) ) && strdf:right(?geoWKT1, ?geoWKT2) ) } "
    },
    {
        "question": "Which villages border towns in England?",
        "sparql": " SELECT DISTINCT ?a WHERE { yago:England geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?a rdf:type y2geoo:OSM_village ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?b rdf:type y2geoo:OSM_town ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER ( ( geof:sfWithin(?geoWKT1, ?geoWKT) && geof:sfWithin(?geoWKT2, ?geoWKT) ) && geof:sfTouches(?geoWKT1, ?geoWKT2) ) } "
    },
    {
        "question": "How many streams cross a nature reserve in Oxford?",
        "sparql": " SELECT (COUNT(DISTINCT ?stream) AS ?streams) WHERE { ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?sWKT . ?reserve rdf:type y2geoo:OSM_nature_reserve ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?rWKT . yago:Oxford geo:hasGeometry ?egeo . ?egeo geo:asWKT ?eWKT FILTER ( ( geof:sfWithin(?sWKT, ?eWKT) && geof:sfWithin(?rWKT, ?eWKT) ) && geof:sfCrosses(?sWKT, ?rWKT) ) } "
    },
    {
        "question": "Give me 5 islands that have at least three lakes?",
        "sparql": " SELECT ?island WHERE { ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?island_geom . ?island_geom geo:asWKT ?island_wkt { SELECT ?island (COUNT(?lake) AS ?lake_count) WHERE { ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lake_geom . ?lake_geom geo:asWKT ?lake_wkt . ?lake geo:sfWithin ?island } GROUP BY ?island } FILTER ( ?lake_count >= 3 ) } LIMIT 5 "
    },
    {
        "question": "Which are the two smallest municipalities in Greece?",
        "sparql": " SELECT DISTINCT ?county (strdf:area(?cWKT) AS ?totalArea) WHERE { { ?county rdf:type y2geoo:GAG_Municipality } ?county geo:hasGeometry ?geoC . ?geoC geo:asWKT ?cWKT } ORDER BY ?totalArea LIMIT 2 "
    },
    {
        "question": "What is the population of the municipality of Gravia?",
        "sparql": " SELECT ?population WHERE { yago:Gravia y2geoo:hasGAG_Population ?population } "
    },
    {
        "question": "What is the area of the Republic of Ireland?",
        "sparql": " SELECT (strdf:area(?geoWKT) AS ?area) WHERE { yago:Republic_of_Ireland geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT } "
    },
    {
        "question": "Where is Alaska situated?",
        "sparql": " SELECT ?geoWKT WHERE { yago:Alaska geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which municipalities border the municipality of Athens?",
        "sparql": " SELECT DISTINCT ?municipality WHERE { yago:geoentity_Dimos_Athens_8133876 geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?municipality rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER geof:sfTouches(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Which rural area south of Longford has the smallest forest?",
        "sparql": " SELECT DISTINCT ?rural_areas (strdf:area(?geoWKT) AS ?totalArea) WHERE { yago:County_Longford geo:hasGeometry ?Suffolk_geo . ?Suffolk_geo geo:asWKT ?Suffolk_geoWKT . ?rural_areas rdf:type y2geoo:OSI_Rural_Area ; geo:hasGeometry ?rural_areas_geo . ?rural_areas_geo geo:asWKT ?rural_areas_geoWKT FILTER strdf:below(?rural_areas_geoWKT, ?Suffolk_geoWKT) ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER geof:sfWithin(?geoWKT2, ?rural_areas_geoWKT) } ORDER BY ASC(?totalArea) LIMIT 1 "
    },
    {
        "question": "Which bays are near Doolin?",
        "sparql": " SELECT DISTINCT ?bay WHERE { yago:Doolin geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?bay rdf:type y2geoo:OSM_bay ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER ( geof:distance(?lcnWKT, ?lWKT, uom:metre) < 5000 ) } "
    },
    {
        "question": "Is Scotland north of London?",
        "sparql": " ASK WHERE { yago:Scotland geo:hasGeometry ?xgeo . ?xgeo geo:asWKT ?xWKT . yago:geoentity_City_of_London_2643744 geo:hasGeometry ?ygeo . ?ygeo geo:asWKT ?yWKT FILTER strdf:above(?yWKT, ?xWKT) } "
    }
]