[
    {
        "question": "How big is the park in Essex?",
        "sparql": " SELECT DISTINCT (strdf:area(?parkGeo) AS ?parkArea) WHERE { yago:Essex geo:hasGeometry ?o1 . ?o1 geo:asWKT ?countyGeo . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?parkGeo FILTER geof:sfWithin(?parkGeo, ?countyGeo) } "
    },
    {
        "question": "Which Irish Baronies contain both a lake and a forest?",
        "sparql": " SELECT DISTINCT ?barony WHERE { ?barony rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?mg . ?mg geo:asWKT ?mw . ?l rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lw . ?f rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?fg . ?fg geo:asWKT ?fw FILTER geof:sfWithin(?fw, ?mw) FILTER geof:sfWithin(?lw, ?mw) } "
    },
    {
        "question": "Which US states border with Arkansas?",
        "sparql": " SELECT ?state WHERE { yago:United_States geo:hasGeometry ?usGeo . ?usGeo geo:asWKT ?usWKT . yago:Arkansas geo:hasGeometry ?cGeo . ?cGeo geo:asWKT ?cWKT . ?state rdf:type y2geoo:GADM_2ndOrder_AdministrativeUnit ; geo:hasGeometry ?sGeo . ?sGeo geo:asWKT ?sWKT FILTER ( geof:sfWithin(?sWKT, ?usWKT) && geof:sfTouches(?sWKT, ?cWKT) ) } "
    },
    {
        "question": "Which is the smallest municipality of Greece?",
        "sparql": " SELECT ?muni (strdf:area(?wkt) AS ?area) WHERE { ?muni rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?geom . ?geom geo:asWKT ?wkt . yago:Greece geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER geof:sfWithin(?wkt, ?geoWKT1) } ORDER BY DESC(?area) LIMIT 1 "
    },
    {
        "question": "Which forests intersect with villages in the State of Illinois?",
        "sparql": " SELECT DISTINCT ?forest WHERE { ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?vg . ?vg geo:asWKT ?vgeoWKT . yago:Illinois geo:hasGeometry ?g2 . ?g2 geo:asWKT ?geoWKT FILTER strdf:within(?vgeoWKT, ?geoWKT) ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?fg . ?fg geo:asWKT ?fgeoWKT FILTER geof:sfIntersects(?vgeoWKT, ?fgeoWKT) } "
    },
    {
        "question": "Which county in England has the largest number of lakes?",
        "sparql": " SELECT DISTINCT ?county WHERE { ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?lcnWKT) } GROUP BY ?county ORDER BY DESC(COUNT(?lWKT)) LIMIT 1 "
    },
    {
        "question": "Which are all the parks in Dublin?",
        "sparql": " SELECT DISTINCT ?park WHERE { yago:Dublin geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?lcnWKT) } "
    },
    {
        "question": "Which parks are in Liverpool?",
        "sparql": " SELECT DISTINCT ?park WHERE { yago:Liverpool geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?lcnWKT) } "
    },
    {
        "question": "In Tullyhaw Barony, which streams are west of a townland?",
        "sparql": " SELECT DISTINCT ?forest WHERE { yago:geoentity_Tully_2635377 geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?forest rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?geomF . ?geomF geo:asWKT ?fWKT . ?town rdf:type y2geoo:OSI_Townland ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER ( ( geof:sfWithin(?fWKT, ?lcnWKT) && geof:sfWithin(?lWKT, ?lcnWKT) ) && strdf:left(?fWKT, ?lWKT) ) } "
    },
    {
        "question": "Which countries are south of the Republic of Ireland",
        "sparql": " SELECT DISTINCT ?Country WHERE { ?Country rdf:type y2geoo:GADM_1stOrder_AdministrativeUnit ; geo:hasGeometry ?CountryGeo . ?CountryGeo geo:asWKT ?CountryGeometry . yago:Republic_of_Ireland geo:hasGeometry ?IrelandGeo . ?IrelandGeo geo:asWKT ?IrelandGeometry FILTER strdf:below(?CountryGeometry, ?IrelandGeometry) } "
    },
    {
        "question": "Which forests in England are also east of Liverpool?",
        "sparql": " SELECT DISTINCT ?forest WHERE { ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?ol . ?ol geo:asWKT ?geoWKT . yago:England geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . yago:Liverpool geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER strdf:right(?geoWKT, ?geoWKT2) FILTER geof:sfWithin(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Which 3 municipalities in Epirus have the biggest population?",
        "sparql": " SELECT DISTINCT ?municipality WHERE { <http://yago-knowledge.org/resource/Epirus_(region)> geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?WKT1 . ?municipality rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?WKT2 FILTER geof:sfWithin(?WKT2, ?WKT1) ?municipality y2geoo:hasGAG_Population ?population } ORDER BY DESC(?population) LIMIT 3 "
    },
    {
        "question": "Which parks are entirely contained in counties that are east of the county of Longford?",
        "sparql": " SELECT DISTINCT ?l WHERE { yago:County_Longford geo:hasGeometry ?ng . ?ng geo:asWKT ?nw . ?m rdf:type y2geoo:OS_County ; geo:hasGeometry ?mg . ?mg geo:asWKT ?mw FILTER strdf:left(?nw, ?mw) ?l rdf:type y2geoo:OSM_park ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lw FILTER geof:sfWithin(?lw, ?mw) } "
    },
    {
        "question": "Which are the three largest district wards that intersect with Plymouth?",
        "sparql": " SELECT DISTINCT ?park (strdf:area(?WKT1) AS ?areas) WHERE { yago:Plymouth geo:hasGeometry ?o . ?o geo:asWKT ?WKT . ?park rdf:type y2geoo:OS_DistrictWard ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?WKT1 FILTER geof:sfIntersects(?WKT1, ?WKT) } ORDER BY DESC(?areas) LIMIT 3 "
    },
    {
        "question": "Is Doolin south of Dublin?",
        "sparql": " ASK WHERE { yago:Doolin geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:Dublin geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER strdf:below(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Which municipalities in Greece have a lake inside their boundaries?",
        "sparql": " SELECT DISTINCT ?dhmoi WHERE { yago:Greece geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?dhmoi rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . yago:Greece geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT3 FILTER ( ( ( geof:sfWithin(?geoWKT1, ?geoWKT) && geof:sfWithin(?geoWKT2, ?geoWKT) ) && geof:sfWithin(?geoWKT1, ?geoWKT2) ) && geof:sfWithin(?geoWKT2, ?geoWKT3) ) } "
    },
    {
        "question": "Where is Lough Ree located?",
        "sparql": " SELECT ?x1WKT WHERE { yago:Lough_Ree geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT } "
    },
    {
        "question": "Where is Dublin located?",
        "sparql": " SELECT ?geoWKT WHERE { yago:Dublin geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which municipalities are on the border of Peristeri?",
        "sparql": " SELECT DISTINCT ?municipality WHERE { yago:Peristeri geo:hasGeometry ?o . ?o geo:asWKT ?WKT . ?municipality rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?WKT1 FILTER geof:sfTouches(?WKT, ?WKT1) } "
    },
    {
        "question": "Where is Loch Ness located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Loch_Ness geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Give me ten lakes of the United Kingdom.",
        "sparql": " SELECT DISTINCT ?x WHERE { ?x rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?GeoX . ?GeoX geo:asWKT ?PolygonX . yago:United_Kingdom geo:hasGeometry ?GeoY . ?GeoY geo:asWKT ?PolygonY FILTER geof:sfWithin(?PolygonX, ?PolygonY) } LIMIT 10 "
    },
    {
        "question": "Which streams flow through cities?",
        "sparql": " SELECT DISTINCT ?x WHERE { ?x rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?cGeom1 . ?cGeom1 geo:asWKT ?cWKT1 . ?y rdf:type y2geoo:OSM_city ; geo:hasGeometry ?cGeom2 . ?cGeom2 geo:asWKT ?cWKT2 FILTER geof:sfCrosses(?cWKT1, ?cWKT2) } "
    },
    {
        "question": "Is Suffolk north of County Cork?",
        "sparql": " ASK WHERE { yago:Suffolk geo:hasGeometry ?geo1 . ?geo1 geo:asWKT ?wkt1 . yago:County_Cork geo:hasGeometry ?geo2 . ?geo2 geo:asWKT ?wkt2 FILTER strdf:above(?wkt1, ?wkt2) } "
    },
    {
        "question": "Where is Lake Trichonida located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Lake_Trichonida geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "What is the population of Psara?",
        "sparql": " SELECT ?pop WHERE { yago:Psara y2geoo:hasGAG_Population ?pop } "
    },
    {
        "question": "How many lakes are within Irish counties?",
        "sparql": " SELECT (COUNT(DISTINCT ?lake) AS ?lakes) WHERE { ?CountyCouncil rdf:type y2geoo:OSI_County_Council ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?A . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geom . ?geom geo:asWKT ?B FILTER geof:sfWithin(?B, ?A) } "
    },
    {
        "question": "What population does Icaria have?",
        "sparql": " SELECT ?population WHERE { yago:Icaria y2geoo:hasGAG_Population ?population } "
    },
    {
        "question": "Which parks are in Northern Ireland?",
        "sparql": " SELECT DISTINCT ?park WHERE { yago:Northern_Ireland geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?lcnWKT) } "
    },
    {
        "question": "How many lakes intersect canals?",
        "sparql": " SELECT (COUNT(DISTINCT ?lake) AS ?lakes) WHERE { ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lakeGeometry . ?lakeGeometry geo:asWKT ?lakeWKT . ?canal rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?canalGeometry . ?canalGeometry geo:asWKT ?canalWKT FILTER geof:sfIntersects(?lakeWKT, ?canalWKT) } "
    },
    {
        "question": "Where is Petroupoli located?",
        "sparql": " SELECT DISTINCT ?dimos_geoWKT WHERE { yago:Petroupoli geo:hasGeometry ?dimos_geo . ?dimos_geo geo:asWKT ?dimos_geoWKT } "
    },
    {
        "question": "How many lakes are in Michigan?",
        "sparql": " SELECT (COUNT(?lake) AS ?numLakes) WHERE { ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lakeGeom . ?lakeGeom geo:asWKT ?lakeWKT . yago:Michigan geo:hasGeometry ?mGeom . ?mGeom geo:asWKT ?mWKT FILTER geof:sfWithin(?lakeWKT, ?mWKT) } "
    },
    {
        "question": "Is Kent west of Norfolk?",
        "sparql": " ASK WHERE { yago:Kent geo:hasGeometry ?g1 . yago:Norfolk geo:hasGeometry ?g2 . ?g1 geo:asWKT ?w1 . ?g2 geo:asWKT ?w2 FILTER strdf:left(?w1, ?w2) } "
    },
    {
        "question": "How many islands have no towns, villages or cities?",
        "sparql": " SELECT (COUNT(?island) AS ?islands) WHERE { ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?iGeo . ?iGeo geo:asWKT ?iWKT FILTER NOT EXISTS { ?town rdf:type y2geoo:OSM_town ; geo:hasGeometry ?tGeo . ?tGeo geo:asWKT ?tWKT FILTER geof:sfWithin(?tWKT, ?iWKT) } FILTER NOT EXISTS { ?city rdf:type y2geoo:OSM_city ; geo:hasGeometry ?cGeo . ?cGeo geo:asWKT ?cWKT FILTER geof:sfWithin(?cWKT, ?iWKT) } FILTER NOT EXISTS { ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?vGeo . ?vGeo geo:asWKT ?vWKT FILTER geof:sfWithin(?vWKT, ?iWKT) } } "
    },
    {
        "question": "Where is Rafina located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Rafina-Pikermi geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "How many constituent countries make up the UK?",
        "sparql": " SELECT (COUNT(DISTINCT ?country) AS ?countries) WHERE { yago:United_Kingdom geo:hasGeometry ?ukGeo . ?ukGeo geo:asWKT ?ukWKT . ?country rdf:type y2geoo:GADM_2ndOrder_AdministrativeUnit ; geo:hasGeometry ?cGeo . ?cGeo geo:asWKT ?cWKT FILTER geof:sfWithin(?cWKT, ?ukWKT) } "
    },
    {
        "question": "Which district wards are located north of Manchester?",
        "sparql": " SELECT DISTINCT ?District_Ward WHERE { yago:Manchester geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcWKT . ?District_Ward rdf:type y2geoo:OS_DistrictWard ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?cWKT FILTER strdf:above(?lcWKT, ?cWKT) } "
    },
    {
        "question": "Which Greek villages are located east of a beach?",
        "sparql": " SELECT DISTINCT ?a WHERE { yago:Greece geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?a rdf:type y2geoo:OSM_village ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?b rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER ( ( geof:sfWithin(?geoWKT1, ?geoWKT) && geof:sfWithin(?geoWKT2, ?geoWKT) ) && strdf:right(?geoWKT1, ?geoWKT2) ) } "
    },
    {
        "question": "What is the number of lakes that border forests?",
        "sparql": " SELECT (COUNT(DISTINCT ?x) AS ?lakes) WHERE { ?x rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?xgeo . ?xgeo geo:asWKT ?xWKT . ?y rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?ygeo . ?ygeo geo:asWKT ?yWKT FILTER geof:sfTouches(?xWKT, ?yWKT) } "
    },
    {
        "question": "In Greece, is there a village that is next to a nature reserve?",
        "sparql": " ASK WHERE { ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 . ?nature_reserve rdf:type y2geoo:OSM_nature_reserve ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?wkt2 . yago:Greece geo:hasGeometry ?g3 . ?g3 geo:asWKT ?wkt3 FILTER ( geof:sfWithin(?wkt2, ?wkt3) && geof:sfTouches(?wkt1, ?wkt2) ) } "
    },
    {
        "question": "Is Rhodes west of Patmos?",
        "sparql": " ASK WHERE { yago:Rhodes geo:hasGeometry ?geo1 . ?geo1 geo:asWKT ?wkt1 . yago:Patmos geo:hasGeometry ?geo2 . ?geo2 geo:asWKT ?wkt2 FILTER strdf:left(?wkt1, ?wkt2) } "
    },
    {
        "question": "Which localities are south of lakes in County Cavan?",
        "sparql": " SELECT DISTINCT ?locality WHERE { yago:County_Cavan geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?locality rdf:type y2geoo:OSM_locality ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 FILTER ( ( geof:sfWithin(?geoWKT2, ?geoWKT1) && geof:sfWithin(?geoWKT3, ?geoWKT1) ) && strdf:below(?geoWKT2, ?geoWKT3) ) } "
    },
    {
        "question": "Which are the three largest lakes of the Republic of Ireland?",
        "sparql": " SELECT ?lake WHERE { { SELECT ?lake (strdf:area(?lWKT) AS ?area) WHERE { yago:Republic_of_Ireland geo:hasGeometry ?geom . ?geom geo:asWKT ?mWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geol . ?geol geo:asWKT ?lWKT FILTER geof:sfContains(?mWKT, ?lWKT) } } } ORDER BY DESC(?area) LIMIT 3 "
    },
    {
        "question": "Is Crete an island?",
        "sparql": " ASK WHERE { yago:Crete rdf:type y2geoo:OSM_island } "
    },
    {
        "question": "Where is Lesbos located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Lesbos geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Is Patmos east of Rhodes?",
        "sparql": " ASK WHERE { yago:Rhodes geo:hasGeometry ?geo1 . ?geo1 geo:asWKT ?wkt1 . yago:Patmos geo:hasGeometry ?geo2 . ?geo2 geo:asWKT ?wkt2 FILTER strdf:right(?wkt2, ?wkt1) } "
    },
    {
        "question": "Is Dublin north of Kilkenny?",
        "sparql": " ASK WHERE { yago:Dublin geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:Kilkenny geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER strdf:above(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "How many times larger is the Republic of Ireland from Northern Ireland?",
        "sparql": " SELECT (( strdf:area(?iWKT) / strdf:area(?niWKT) ) AS ?timesLarger) WHERE { yago:Republic_of_Ireland geo:hasGeometry ?iGeo . ?iGeo geo:asWKT ?iWKT . yago:Northern_Ireland geo:hasGeometry ?niGeo . ?niGeo geo:asWKT ?niWKT } LIMIT 1 "
    },
    {
        "question": "What is the location of County Cork?",
        "sparql": " SELECT ?geoWKT WHERE { yago:County_Cork geo:hasGeometry ?geom . ?geom geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which lake is closest to the municipality of Athens?",
        "sparql": " SELECT DISTINCT ?lake WHERE { ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lake_geom . ?lake_geom geo:asWKT ?lake_wkt . yago:geoentity_Dimos_Athens_8133876 geo:hasGeometry ?o . ?o geo:asWKT ?muni_wkt } ORDER BY geof:distance(?muni_wkt, ?lake_wkt, uom:metre) LIMIT 1 "
    },
    {
        "question": "Is Bristol in Wales?",
        "sparql": " ASK WHERE { yago:Wales geo:hasGeometry ?WalesGeo . ?WalesGeo geo:asWKT ?WalesPolygon . yago:Bristol geo:hasGeometry ?BristolGeo . ?BristolGeo geo:asWKT ?BristolPolygon FILTER geof:sfWithin(?BristolPolygon, ?WalesPolygon) } "
    },
    {
        "question": "Which are the two smallest parks in the Republic of Ireland?",
        "sparql": " SELECT DISTINCT ?park (strdf:area(?wkt1) AS ?totalArea) WHERE { ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 . yago:Republic_of_Ireland geo:hasGeometry ?g2 . ?g2 geo:asWKT ?wkt2 FILTER geof:sfWithin(?wkt1, ?wkt2) } ORDER BY ?totalArea LIMIT 2 "
    },
    {
        "question": "How many parks have lakes in or as parts of them in County Mayo?",
        "sparql": " SELECT (COUNT(DISTINCT ?park) AS ?parks) WHERE { ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geomP . ?geomP geo:asWKT ?lWKT_P . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geomF . ?geomF geo:asWKT ?lWKT_F . yago:County_Mayo geo:hasGeometry ?geo1 . ?geo1 geo:asWKT ?geoWKT1 FILTER ( ( geof:sfWithin(?lWKT_F, ?geoWKT1) && geof:sfWithin(?lWKT_P, ?geoWKT1) ) && geof:sfIntersects(?lWKT_P, ?lWKT_F) ) } "
    },
    {
        "question": "What is the number of lakes in each county that has lakes?",
        "sparql": " SELECT DISTINCT ?county (COUNT(?lake) AS ?lake_count) WHERE { ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER geof:sfIntersects(?lWKT, ?lcWKT) } GROUP BY ?county "
    },
    {
        "question": "Which counties border with Lincolnshire?",
        "sparql": " SELECT DISTINCT ?county WHERE { yago:Lincolnshire geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcWKT . ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?cWKT FILTER geof:sfTouches(?lcWKT, ?cWKT) } "
    },
    {
        "question": "Which lakes are entirely contained in baronies west of Coshlea?",
        "sparql": " SELECT DISTINCT ?l WHERE { y2geor:osientity_2AE19629112213A3E055000000000001 geo:hasGeometry ?ng . ?ng geo:asWKT ?nw . ?m rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?mg . ?mg geo:asWKT ?mw FILTER strdf:right(?nw, ?mw) ?l rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lw FILTER geof:sfWithin(?lw, ?mw) } "
    },
    {
        "question": "How many district wards are within districts?",
        "sparql": " SELECT (COUNT(DISTINCT ?DistrictWard) AS ?wards) WHERE { ?District rdf:type y2geoo:OS_District ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?A . ?DistrictWard rdf:type y2geoo:OS_DistrictWard ; geo:hasGeometry ?geom . ?geom geo:asWKT ?B FILTER geof:sfWithin(?B, ?A) } "
    },
    {
        "question": "Is Lough Leane in County Kerry ?",
        "sparql": " ASK WHERE { yago:County_Kerry geo:hasGeometry ?kgeo . ?kgeo geo:asWKT ?kWKT . yago:Lough_Leane geo:hasGeometry ?lgeo . ?lgeo geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?kWKT) } "
    },
    {
        "question": "Is Dublin on an island?",
        "sparql": " ASK WHERE { ?x rdf:type y2geoo:OSM_island ; geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT . yago:Dublin geo:hasGeometry ?iGeom . ?iGeom geo:asWKT ?iWKT FILTER geof:sfIntersects(?iWKT, ?xWKT) } "
    },
    {
        "question": "Can you identify the woodland areas in the districts situated to the south of Staffordshire?",
        "sparql": " SELECT DISTINCT ?district WHERE { yago:Staffordshire geo:hasGeometry ?Staffordshire_geo . ?Staffordshire_geo geo:asWKT ?Staffordshire_geoWKT . ?district rdf:type y2geoo:OS_District ; geo:hasGeometry ?district_geo . ?district_geo geo:asWKT ?district_geoWKT FILTER strdf:below(?district_geoWKT, ?Staffordshire_geoWKT) ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?forest_geo . ?forest_geo geo:asWKT ?forest_geoWKT FILTER geof:sfWithin(?forest_geoWKT, ?district_geoWKT) } "
    },
    {
        "question": "How many lakeside villages are there?",
        "sparql": " SELECT (COUNT(DISTINCT ?village) AS ?villages) WHERE { ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?geoV . ?geoV geo:asWKT ?vWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geoL . ?geoL geo:asWKT ?lWKT FILTER geof:sfTouches(?lWKT, ?vWKT, uom:metre) } "
    },
    {
        "question": "Give me the population of islands located in Greece.",
        "sparql": " SELECT DISTINCT ?pop ?x WHERE { ?x rdf:type y2geoo:OSM_island ; geo:hasGeometry ?xGeom ; y2geoo:hasGAG_Population ?pop . ?xGeom geo:asWKT ?xWKT . yago:Greece geo:hasGeometry ?o1 . ?o1 geo:asWKT ?iWKT FILTER geof:sfWithin(?xWKT, ?iWKT) } "
    },
    {
        "question": "Which district wards are within Essex?",
        "sparql": " SELECT DISTINCT ?districtWard WHERE { yago:Essex geo:hasGeometry ?o . ?o geo:asWKT ?WKT . ?districtWard rdf:type y2geoo:OS_DistrictWard ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?WKT1 FILTER geof:sfWithin(?WKT1, ?WKT) } "
    },
    {
        "question": "Where is Pallini located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Pallini geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Where is Texas located?",
        "sparql": " SELECT ?WKT WHERE { yago:Texas geo:hasGeometry ?o . ?o geo:asWKT ?WKT } "
    },
    {
        "question": "Which lakes in England are also west of Manchester?",
        "sparql": " SELECT DISTINCT ?lake WHERE { ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?ol . ?ol geo:asWKT ?geoWKT . yago:England geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . yago:Manchester geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER strdf:left(?geoWKT, ?geoWKT2) FILTER geof:sfWithin(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "How many counties does Texas have?",
        "sparql": " SELECT (COUNT(?county) AS ?counties) WHERE { yago:Texas geo:hasGeometry ?tGeo . ?tGeo geo:asWKT ?tWKT . ?county rdf:type y2geoo:GADM_3rdOrder_AdministrativeUnit ; geo:hasGeometry ?cGeo . ?cGeo geo:asWKT ?cWKT FILTER geof:sfWithin(?cWKT, ?tWKT) } "
    },
    {
        "question": "Is Bristol west of Liverpool?",
        "sparql": " ASK WHERE { yago:Bristol geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . yago:Liverpool geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER strdf:left(?geoWKT1, ?geoWKT2) } "
    },
    {
        "question": "Where is Cambridge located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:geoentity_Cambridge_District_7290660 geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which states only have counties with 1000 inhabitants or more?",
        "sparql": " SELECT ?state WHERE { ?state rdf:type yago:wikicategory_States_of_the_United_States ; geo:hasGeometry ?stateGeom . ?stateGeom geo:asWKT ?stateWKT FILTER NOT EXISTS { ?county y2geoo:hasGADM_Description \"County\" ; geo:hasGeometry ?cGeom . ?cGeom geo:asWKT ?cWKT FILTER geof:sfContains(?stateWKT, ?cWKT) ?county y2geoo:POPULATION ?pop BIND(xsd:double(?pop) AS ?popd) FILTER ( ?popd < 1000 ) } } "
    },
    {
        "question": "Which bays are at most 5000 meters from Doolin?",
        "sparql": " SELECT DISTINCT ?bay WHERE { yago:Doolin geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?bay rdf:type y2geoo:OSM_bay ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER ( geof:distance(?lcnWKT, ?lWKT, uom:metre) < 5000 ) } "
    },
    {
        "question": "How far is Alaska from Florida?",
        "sparql": " SELECT (geof:distance(?aWKT, ?fWKT, uom:metre) AS ?distance) WHERE { yago:Alaska geo:hasGeometry ?aGeo . ?aGeo geo:asWKT ?aWKT . yago:Florida geo:hasGeometry ?fGeo . ?fGeo geo:asWKT ?fWKT } "
    },
    {
        "question": "Which forests are entirely contained in baronies east of Coshlea?",
        "sparql": " SELECT DISTINCT ?l WHERE { y2geor:osientity_2AE19629112213A3E055000000000001 geo:hasGeometry ?ng . ?ng geo:asWKT ?nw . ?m rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?mg . ?mg geo:asWKT ?mw FILTER strdf:left(?nw, ?mw) ?l rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lw FILTER geof:sfWithin(?lw, ?mw) } "
    },
    {
        "question": "Which is the biggest lake in County Kerry?",
        "sparql": " SELECT ?lake WHERE { { SELECT ?lake (strdf:area(?WKT2) AS ?area) WHERE { yago:County_Kerry geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?WKT1 . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?WKT2 FILTER geof:sfWithin(?WKT2, ?WKT1) } ORDER BY DESC(?area) LIMIT 1 } } "
    },
    {
        "question": "What is the average size of a lake in England?",
        "sparql": " SELECT (AVG(strdf:area(?cWKT)) AS ?averageArea) WHERE { yago:England geo:hasGeometry ?eGeo . ?eGeo geo:asWKT ?eWKT . ?canal rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?cGeo . ?cGeo geo:asWKT ?cWKT FILTER geof:sfWithin(?cWKT, ?eWKT) } "
    },
    {
        "question": "What is the population of the Municipality of Moschato Tavros?",
        "sparql": " SELECT ?population WHERE { yago:Moschato-Tavros y2geoo:hasGAG_Population ?population } "
    },
    {
        "question": "How many inhabitants does Piraeus have?",
        "sparql": " SELECT ?population WHERE { yago:Piraeus y2geoo:hasGAG_Population ?population } "
    },
    {
        "question": "Which forests are less than 25km away from County Sligo?",
        "sparql": " SELECT DISTINCT ?forest WHERE { yago:County_Sligo geo:hasGeometry ?o . ?o geo:asWKT ?WKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?WKT1 FILTER ( geof:distance(?WKT, ?WKT1, uom:metre) < 25000 ) } "
    },
    {
        "question": "How many rivers cross Irish townlands in County Kildare?",
        "sparql": " SELECT (COUNT(DISTINCT ?river) AS ?rivers) WHERE { ?river rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 . ?county rdf:type y2geoo:OSI_Townland ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?wkt2 . yago:County_Kildare geo:hasGeometry ?kildare_geo . ?kildare_geo geo:asWKT ?kildare_geoWKT FILTER ( ( geof:sfWithin(?wkt1, ?kildare_geoWKT) && geof:sfWithin(?wkt2, ?kildare_geoWKT) ) && geof:sfCrosses(?wkt1, ?wkt2) ) } "
    },
    {
        "question": "Which municipalities are adjacent to Chalandri?",
        "sparql": " SELECT DISTINCT ?dimos WHERE { yago:Chalandri geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?dimos rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?cWKT FILTER geof:sfTouches(?geoWKT, ?cWKT) } "
    },
    {
        "question": "Where is Corfu located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Corfu geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which States are larger than England?",
        "sparql": " SELECT ?state WHERE { { SELECT ?state (strdf:area(?eWKT) AS ?eArea) (strdf:area(?sWKT) AS ?sArea) WHERE { yago:United_States geo:hasGeometry ?usGeo . ?usGeo geo:asWKT ?usWKT . yago:England geo:hasGeometry ?eGeo . ?eGeo geo:asWKT ?eWKT . ?state rdf:type y2geoo:GADM_2ndOrder_AdministrativeUnit ; geo:hasGeometry ?sGeo . ?sGeo geo:asWKT ?sWKT FILTER geof:sfWithin(?sWKT, ?usWKT) } } FILTER ( ?sArea > ?eArea ) } "
    },
    {
        "question": "Where Glasgow is located?",
        "sparql": " SELECT ?wkt WHERE { yago:geoentity_Glasgow_City_3333231 geo:hasGeometry ?geom . ?geom geo:asWKT ?wkt } "
    },
    {
        "question": "Which towns are a short distance away from NYC?",
        "sparql": " SELECT DISTINCT ?bay WHERE { yago:New_York_City geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?bay rdf:type y2geoo:OSM_town ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER ( geof:distance(?lcnWKT, ?lWKT, uom:metre) < 5000 ) } "
    },
    {
        "question": "What is the name and the area of the parks that are in Wards of Northern Ireland that are east of Dublin?",
        "sparql": " SELECT ?locality ?parkArea WHERE { { SELECT ?locality (strdf:area(?locality_geoWKT) AS ?parkArea) ?locality_geoWKT ?geoWKT WHERE { yago:Dublin geo:hasGeometry ?city_geometry . ?city_geometry geo:asWKT ?geoWKT . ?ward rdf:type y2geoo:OSNI_Ward ; geo:hasGeometry ?ward_geo . ?ward_geo geo:asWKT ?ward_geoWKT . ?locality rdf:type y2geoo:OSM_park ; geo:hasGeometry ?locality_geo . ?locality_geo geo:asWKT ?locality_geoWKT FILTER geof:sfWithin(?locality_geoWKT, ?ward_geoWKT) } } FILTER strdf:right(?locality_geoWKT, ?geoWKT) } "
    },
    {
        "question": "Is Norilsk north of Dublin?",
        "sparql": " ASK WHERE { yago:Dublin geo:hasGeometry ?dublinGeometry . ?dublinGeometry geo:asWKT ?wktDublin . yago:Norilsk geo:hasGeometry ?norilskGeometry . ?norilskGeometry geo:asWKT ?wktNorilsk FILTER strdf:above(?wktNorilsk, ?wktDublin) } "
    },
    {
        "question": "Where is Taghsheenod Glebe located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:geoentity_Taghsheenod_2961290 geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which forests contain streams in the State of Iowa?",
        "sparql": " SELECT DISTINCT ?forest WHERE { yago:Iowa geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER ( ( geof:sfWithin(?geoWKT1, ?geoWKT) && geof:sfWithin(?geoWKT2, ?geoWKT) ) && geof:sfContains(?geoWKT1, ?geoWKT2) ) } "
    },
    {
        "question": "How many people live in Missouri?",
        "sparql": " SELECT (SUM(xsd:double(?pop)) AS ?population) WHERE { yago:Missouri geo:hasGeometry ?aGeo . ?aGeo geo:asWKT ?aWKT . ?county y2geoo:hasGADM_Description \"County\" ; geo:hasGeometry ?cGeom . ?cGeom geo:asWKT ?cWKT FILTER geof:sfWithin(?cWKT, ?aWKT) ?county y2geoo:POPULATION ?pop } "
    },
    {
        "question": "Where is the Loch Leven National Nature Reserve located?",
        "sparql": " SELECT ?wkt WHERE { yago:geoentity_Loch_Leven_2643816 geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?wkt } "
    },
    {
        "question": "Is Essex located in Cambridgeshire?",
        "sparql": " ASK WHERE { yago:Essex geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT . yago:Cambridge geo:hasGeometry ?g2 . ?g2 geo:asWKT ?geoWKT2 FILTER geof:sfWithin(?geoWKT, ?geoWKT2) } "
    },
    {
        "question": "How many Greek villages are either in a lake or in a forest?",
        "sparql": " SELECT (COUNT(DISTINCT ?village) AS ?count) WHERE { { SELECT DISTINCT ?village WHERE { ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?vg . ?vg geo:asWKT ?vw . yago:Greece geo:hasGeometry ?geo . ?geo geo:asWKT ?geoWKT FILTER geof:sfWithin(?vw, ?geoWKT) ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lw FILTER geof:sfWithin(?vw, ?lw) } } UNION { SELECT DISTINCT ?village WHERE { ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?vg . ?vg geo:asWKT ?vw . yago:Greece geo:hasGeometry ?geo . ?geo geo:asWKT ?geoWKT FILTER geof:sfWithin(?vw, ?geoWKT) ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?fg . ?fg geo:asWKT ?fw FILTER geof:sfWithin(?vw, ?fw) } } } "
    },
    {
        "question": "Which are the smallest 5 lakes north of Dublin?",
        "sparql": " SELECT DISTINCT ?y (strdf:area(?yWKT) AS ?totalArea) WHERE { ?y rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?ygeo . ?ygeo geo:asWKT ?yWKT . y2geor:gadmentity_Dublin_IRL.6_1 geo:hasGeometry ?xgeo . ?xgeo geo:asWKT ?xWKT FILTER strdf:above(?yWKT, ?xWKT) } ORDER BY ASC(?totalArea) LIMIT 5 "
    }
]