[
    {
        "question": "Which streams are north of lakes in Central Macedonia?",
        "sparql": " SELECT DISTINCT ?stream WHERE { ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?wkt2 . yago:Central_Macedonia geo:hasGeometry ?g3 . ?g3 geo:asWKT ?wkt3 FILTER ( geof:sfWithin(?wkt2, ?wkt3) && strdf:above(?wkt1, ?wkt2) ) } "
    },
    {
        "question": "Is the city of Norilsk north of the city of Dublin?",
        "sparql": " ASK WHERE { yago:Dublin geo:hasGeometry ?dublinGeometry . ?dublinGeometry geo:asWKT ?wktDublin . yago:Norilsk geo:hasGeometry ?norilskGeometry . ?norilskGeometry geo:asWKT ?wktNorilsk FILTER strdf:above(?wktNorilsk, ?wktDublin) } "
    },
    {
        "question": "Which parks are less than 10km away from the city of Manchester?",
        "sparql": " SELECT DISTINCT ?park WHERE { yago:Manchester geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?geoWKTr FILTER ( geof:distance(?geoWKT, ?geoWKTr, uom:metre) <= 10000 ) } "
    },
    {
        "question": "Is Ierapetra east of Chania?",
        "sparql": " ASK WHERE { yago:Ierapetra geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT_Ierapetra . yago:geoentity_Chania_8133762 geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT_Chania FILTER strdf:right(?geoWKT_Ierapetra, ?geoWKT_Chania) } "
    },
    {
        "question": "Where is the municipality of Athens located?",
        "sparql": " SELECT ?geoWKT WHERE { yago:geoentity_Dimos_Athens_8133876 geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which villages are north of lakes, in County Cumbria?",
        "sparql": " SELECT DISTINCT ?village WHERE { yago:Cumbria geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER ( ( geof:sfWithin(?geoWKT1, ?geoWKT) && geof:sfWithin(?geoWKT2, ?geoWKT) ) && strdf:above(?geoWKT1, ?geoWKT2) ) } "
    },
    {
        "question": "Which municipalities border Thebes?",
        "sparql": " SELECT DISTINCT ?municipality WHERE { yago:geoentity_Dimos_Thebes_8133908 geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?WKT1 . ?municipality rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?WKT2 FILTER geof:sfTouches(?WKT2, ?WKT1) } "
    },
    {
        "question": "Which are the inflows and outflows of Lake Michigan?",
        "sparql": " SELECT ?river WHERE { ?river rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?rgeom . ?rgeom geo:asWKT ?rwkt . yago:Lake_Michigan geo:hasGeometry ?lgeom . ?lgeom geo:asWKT ?lwkt FILTER geof:sfIntersects(?rwkt, ?lwkt) } "
    },
    {
        "question": "What is the population of the municipality of Oinofyta?",
        "sparql": " SELECT ?population WHERE { yago:Oinofyta y2geoo:hasGAG_Population ?population } "
    },
    {
        "question": "How many canals in England are west of villages in Camrbridgeshire?",
        "sparql": " SELECT (COUNT(DISTINCT ?x) AS ?canals) WHERE { yago:Cambridge geo:hasGeometry ?oGeo . ?oGeo geo:asWKT ?oWKT . yago:England geo:hasGeometry ?eGeo . ?eGeo geo:asWKT ?eWKT . ?x rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?xgeo . ?xgeo geo:asWKT ?xWKT . ?y rdf:type y2geoo:OSM_village ; geo:hasGeometry ?ygeo . ?ygeo geo:asWKT ?yWKT FILTER ( ( geof:sfContains(?eWKT, ?xWKT) && geof:sfContains(?oWKT, ?yWKT) ) && strdf:left(?xWKT, ?yWKT) ) } "
    },
    {
        "question": "Which is the largest lake southeast of Galway?",
        "sparql": " SELECT ?lake (strdf:area(?lWKT) AS ?lArea) WHERE { yago:County_Galway geo:hasGeometry ?cgGeo . ?cgGeo geo:asWKT ?cgWKT . yago:Republic_of_Ireland geo:hasGeometry ?iGeo . ?iGeo geo:asWKT ?iWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lGeo . ?lGeo geo:asWKT ?lWKT FILTER ( ( geof:sfWithin(?lWKT, ?iWKT) && strdf:below(?lWKT, ?cgWKT) ) && strdf:right(?lWKT, ?cgWKT) ) } ORDER BY DESC(?lArea) LIMIT 1 "
    },
    {
        "question": "Which streams in Ireland are tributaries?",
        "sparql": " SELECT DISTINCT ?river WHERE { ?river rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?wkt2 . yago:Republic_of_Ireland geo:hasGeometry ?g3 . ?g3 geo:asWKT ?wkt3 FILTER ( ( geof:sfWithin(?wkt2, ?wkt3) && geof:sfIntersects(?wkt1, ?wkt2) ) && geof:sfCrosses(?wkt1, ?wkt2) ) } "
    },
    {
        "question": "In Breckland district, which forests are south of streams?",
        "sparql": " SELECT DISTINCT ?forest WHERE { yago:Breckland_District geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 FILTER ( ( geof:sfWithin(?geoWKT2, ?geoWKT1) && geof:sfWithin(?geoWKT3, ?geoWKT1) ) && strdf:below(?geoWKT2, ?geoWKT3) ) } "
    },
    {
        "question": "Is the barony of Kinsale south of the city of Kilkenny?",
        "sparql": " ASK WHERE { yago:Kinsale geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . yago:Kilkenny geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER strdf:below(?geoWKT1, ?geoWKT2) } "
    },
    {
        "question": "What is the population of Nikaia-Agios Ioannis Rentis?",
        "sparql": " SELECT ?o WHERE { yago:Nikaia-Agios_Ioannis_Rentis y2geoo:hasGAG_Population ?o } "
    },
    {
        "question": "How many counties border the largest county of the Republic of Ireland?",
        "sparql": " SELECT (COUNT(?county) AS ?counties) WHERE { { SELECT ?largestCounty ?lcWKT WHERE { { ?largestCounty rdf:type y2geoo:OSI_County_Council } UNION { ?largestCounty rdf:type y2geoo:OSI_City_and_County_Council } ?largestCounty geo:hasGeometry ?lcGeo . ?lcGeo geo:asWKT ?lcWKT BIND(strdf:area(?lcWKT) AS ?lcArea) } ORDER BY DESC(?lcArea) LIMIT 1 } { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } ?county geo:hasGeometry ?cGeo . ?cGeo geo:asWKT ?cWKT . yago:Republic_of_Ireland geo:hasGeometry ?irlG . ?irlG geo:asWKT ?irlWKT FILTER geof:sfWithin(?cWKT, ?irlWKT) ?county geo:sfTouches ?largestCounty } "
    },
    {
        "question": "Which English district has the most lakes?",
        "sparql": " SELECT DISTINCT ?district WHERE { ?village rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?district rdf:type y2geoo:OS_District ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . yago:England geo:hasGeometry ?egeo . ?egeo geo:asWKT ?eWKT FILTER ( geof:sfWithin(?geoWKT2, ?eWKT) && geof:sfWithin(?geoWKT1, ?geoWKT2) ) } GROUP BY ?district ORDER BY DESC(COUNT(?village)) LIMIT 1 "
    },
    {
        "question": "Which is the largest park in Greece?",
        "sparql": " SELECT ?park (strdf:area(?pWKT) AS ?area) WHERE { yago:Greece geo:hasGeometry ?geo . ?geo geo:asWKT ?gWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?parkGeo . ?parkGeo geo:asWKT ?pWKT FILTER geof:sfContains(?gWKT, ?pWKT) } ORDER BY DESC(?area) LIMIT 1 "
    },
    {
        "question": "Which is the largest island in Ireland?",
        "sparql": " SELECT DISTINCT ?x (strdf:area(?lWKT) AS ?area) WHERE { yago:Republic_of_Ireland geo:hasGeometry ?geom . ?geom geo:asWKT ?mWKT . ?lake rdf:type y2geoo:OSM_island ; geo:hasGeometry ?geol . ?geol geo:asWKT ?lWKT FILTER geof:sfContains(?mWKT, ?lWKT) } ORDER BY ?area LIMIT 1 "
    },
    {
        "question": "Which is the largest park by area in Dublin?",
        "sparql": " SELECT DISTINCT ?park (strdf:area(?pWKT) AS ?totalArea) WHERE { ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?pGeom . ?pGeom geo:asWKT ?pWKT . yago:Dublin geo:hasGeometry ?lcGeom . ?lcGeom geo:asWKT ?lcWKT FILTER geof:sfWithin(?pWKT, ?lcWKT) } ORDER BY DESC(?totalArea) LIMIT 1 "
    },
    {
        "question": "How much of Greece is covered by lakes?",
        "sparql": " SELECT (( ( ?lake_area_sum / ?greece_area ) * 100 ) AS ?percentage) WHERE { { SELECT (SUM(?lake_area) AS ?lake_area_sum) ?greece_area WHERE { { SELECT (strdf:area(?lake_wkt) AS ?lake_area) (strdf:area(?greece_wkt) AS ?greece_area) WHERE { ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lake_geom . ?lake_geom geo:asWKT ?lake_wkt . yago:Greece geo:hasGeometry ?greece_geom . ?greece_geom geo:asWKT ?greece_wkt FILTER geof:sfWithin(?lake_wkt, ?greece_wkt) } } } GROUP BY ?greece_area } } "
    },
    {
        "question": "Where is the Isle of Portland located?",
        "sparql": " SELECT ?geoWKT WHERE { yago:Isle_of_Portland geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT } "
    },
    {
        "question": "Does Bristol belong to Wales?",
        "sparql": " ASK WHERE { yago:Wales geo:hasGeometry ?WalesGeo . ?WalesGeo geo:asWKT ?WalesPolygon . yago:Bristol geo:hasGeometry ?BristolGeo . ?BristolGeo geo:asWKT ?BristolPolygon FILTER geof:sfWithin(?BristolGeo, ?WalesGeo) } "
    },
    {
        "question": "Is the Sennen Cove beach east of Helston?",
        "sparql": " ASK WHERE { yago:Sennen_Cove geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 . yago:Helston geo:hasGeometry ?g2 . ?g2 geo:asWKT ?wkt2 FILTER strdf:right(?wkt1, ?wkt2) } "
    },
    {
        "question": "Give me five cities in Texas?",
        "sparql": " SELECT DISTINCT ?city WHERE { ?city rdf:type y2geoo:OSM_city ; geo:hasGeometry ?city_geom . ?city_geom geo:asWKT ?city_wkt . yago:Texas geo:hasGeometry ?cgeom . ?cgeom geo:asWKT ?ukCkt FILTER geof:sfWithin(?city_wkt, ?ukCkt) } LIMIT 5 "
    },
    {
        "question": "How many beaches are in municipalities of Greece?",
        "sparql": " SELECT (COUNT(?beach) AS ?NoOfBeaches) WHERE { ?Municp rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?MunicpGeo . ?MunicpGeo geo:asWKT ?MunicpWKT . ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?beachGeo . ?beachGeo geo:asWKT ?beachWKT FILTER geof:sfWithin(?beachWKT, ?MunicpWKT) } "
    },
    {
        "question": "Which forests in Essex are west of a lake?",
        "sparql": " SELECT DISTINCT ?forest WHERE { yago:Essex geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?geomF . ?geomF geo:asWKT ?fWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER ( geof:sfWithin(?fWKT, ?lcnWKT) && strdf:left(?fWKT, ?lWKT) ) } "
    },
    {
        "question": "Which 5 counties of the UK have the most forests?",
        "sparql": " SELECT DISTINCT ?county WHERE { ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?geoC . ?geoC geo:asWKT ?cWKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?geoF . ?geoF geo:asWKT ?fWKT FILTER geof:sfWithin(?fWKT, ?cWKT) } GROUP BY ?county ORDER BY DESC(COUNT(?forest)) LIMIT 5 "
    },
    {
        "question": "What are the names of the lakes in the Northern Irish wards west of Wales?",
        "sparql": " SELECT DISTINCT ?locality WHERE { yago:Wales geo:hasGeometry ?city_geometry . ?city_geometry geo:asWKT ?geoWKT . ?ward rdf:type y2geoo:OSNI_Ward ; geo:hasGeometry ?ward_geo . ?ward_geo geo:asWKT ?ward_geoWKT FILTER strdf:left(?ward_geoWKT, ?geoWKT) ?locality rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?locality_geo . ?locality_geo geo:asWKT ?locality_geoWKT FILTER geof:sfWithin(?locality_geoWKT, ?ward_geoWKT) } "
    },
    {
        "question": "Which is the most populated region of Greece?",
        "sparql": " SELECT ?region WHERE { ?region rdf:type y2geoo:GAG_Region ; y2geoo:hasGAG_Population ?p ; geo:hasGeometry ?geo1 . ?geo1 geo:asWKT ?g1WKT . yago:Greece geo:hasGeometry ?geo . ?geo geo:asWKT ?gWKT FILTER geof:sfWithin(?g1WKT, ?gWKT) } ORDER BY DESC(?p) LIMIT 1 "
    },
    {
        "question": "What is the total count of villages located on the border of cities?",
        "sparql": " SELECT (COUNT(DISTINCT ?village) AS ?villages) WHERE { ?City rdf:type y2geoo:OSM_city ; geo:hasGeometry ?CityGeo . ?CityGeo geo:asWKT ?CityPolygon . ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?villageGeo . ?villageGeo geo:asWKT ?villagePolygon FILTER geof:sfTouches(?villagePolygon, ?CityPolygon) } "
    },
    {
        "question": "Which city in England is adjacent to the most lakes?",
        "sparql": " SELECT ?city WHERE { yago:England geo:hasGeometry ?eGeo . ?eGeo geo:asWKT ?eWKT . ?city rdf:type y2geoo:OSM_city ; geo:hasGeometry ?cGeo . ?cGeo geo:asWKT ?cWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lGeo . ?lGeo geo:asWKT ?lWKT FILTER ( geof:sfWithin(?cWKT, ?eWKT) && strdf:touches(?cWKT, ?lWKT) ) } GROUP BY ?city ORDER BY DESC(COUNT(?lake)) LIMIT 1 "
    },
    {
        "question": "Which park within Dublin is the smallest by area?",
        "sparql": " SELECT DISTINCT ?park (strdf:area(?cWKT) AS ?totalArea) WHERE { ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?cWKT . yago:Dublin geo:hasGeometry ?geomE . ?geomE geo:asWKT ?eWKT FILTER geof:sfWithin(?cWKT, ?eWKT) } ORDER BY ASC(?totalArea) LIMIT 1 "
    },
    {
        "question": "What is the population of Lincoln in Montana?",
        "sparql": " SELECT (xsd:integer(?population) AS ?pop) WHERE { <http://yago-knowledge.org/resource/Lincoln_County,_Montana> y2geoo:POPULATION ?population } "
    },
    {
        "question": "What is the population of the municipalities that border Kastoria?",
        "sparql": " SELECT DISTINCT ?municipality ?population WHERE { yago:Kastoria geo:hasGeometry ?o3 . ?o3 geo:asWKT ?kastoriaWKT . ?municipality rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?munWKT . ?municipality y2geoo:hasGAG_Population ?population FILTER geof:sfTouches(?kastoriaWKT, ?munWKT) } "
    },
    {
        "question": "Is Whitehall located to the west of Trafalgar Square?",
        "sparql": " ASK WHERE { yago:Whitehall geo:hasGeometry ?a . ?a geo:asWKT ?A . yago:Trafalgar_Square geo:hasGeometry ?b . ?b geo:asWKT ?B FILTER strdf:left(?A, ?B) } "
    },
    {
        "question": "Which nature reserves in Ireland have lakes within their boundaries?",
        "sparql": " SELECT DISTINCT ?p1 WHERE { ?p1 rdf:type y2geoo:OSM_nature_reserve ; geo:hasGeometry ?p1geo . ?p1geo geo:asWKT ?p1WKT . ?p2 rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?p2geo . ?p2geo geo:asWKT ?p2WKT . yago:Republic_of_Ireland geo:hasGeometry ?o1 . ?o1 geo:asWKT ?iWKT FILTER ( geof:sfWithin(?p1WKT, ?iWKT) && geof:sfContains(?p1WKT, ?p2WKT) ) } "
    },
    {
        "question": "Does the municipality of Athens border Kallithea?",
        "sparql": " ASK WHERE { yago:geoentity_Dimos_Athens_8133876 geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:Kallithea geo:hasGeometry ?o1 ; rdf:type ?type . ?o1 geo:asWKT ?geoWKT1 FILTER geof:sfTouches(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "How many Greek regions contain islands and forests?",
        "sparql": " SELECT (COUNT(DISTINCT ?r) AS ?rs) WHERE { ?r rdf:type y2geoo:GAG_Region ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 . ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?wkt2 . ?f rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?g3 . ?g3 geo:asWKT ?wkt3 FILTER geof:sfContains(?wkt1, ?wkt2) FILTER geof:sfContains(?wkt1, ?wkt3) } "
    },
    {
        "question": "How many municipalities have a park in Attica?",
        "sparql": " SELECT (COUNT(DISTINCT ?island) AS ?islands) WHERE { ?island rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?geomI . ?geomI geo:asWKT ?iWKT . ?forest rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geomB . ?geomB geo:asWKT ?bWKT . yago:geoentity_Apokentrom\u00e9ni_Dio\u00edkisi_Attik\u00eds_8200474 geo:hasGeometry ?geomC . ?geomC geo:asWKT ?cWKT FILTER ( ( geof:sfWithin(?bWKT, ?cWKT) && geof:sfWithin(?iWKT, ?cWKT) ) && geof:sfWithin(?bWKT, ?iWKT) ) } "
    },
    {
        "question": "Which municipalities south of Kastoria have a lake?",
        "sparql": " SELECT DISTINCT ?municipality WHERE { yago:Kastoria geo:hasGeometry ?o3 . ?o3 geo:asWKT ?kastoriaWKT . ?municipality rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?munWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?lakeWKT FILTER geof:sfWithin(?lakeWKT, ?munWKT) FILTER strdf:below(?munWKT, ?kastoriaWKT) } "
    },
    {
        "question": "What is the total number of baronies which have nature reserves?",
        "sparql": " SELECT (COUNT(DISTINCT ?x) AS ?baronies) WHERE { ?x rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?cGeom1 . ?cGeom1 geo:asWKT ?cWKT1 . ?y rdf:type y2geoo:OSM_nature_reserve ; geo:hasGeometry ?cGeom2 . ?cGeom2 geo:asWKT ?cWKT2 FILTER geof:sfWithin(?cWKT2, ?cWKT1) } "
    },
    {
        "question": "Which is the largest rural area?",
        "sparql": " SELECT ?rural (strdf:area(?ruralWKT) AS ?area) WHERE { ?rural rdf:type y2geoo:OSI_Rural_Area ; geo:hasGeometry ?ruralGeom . ?ruralGeom geo:asWKT ?ruralWKT } ORDER BY DESC(?area) LIMIT 1 "
    },
    {
        "question": "Which county has the most inhabitants in the US?",
        "sparql": " SELECT ?county WHERE { ?county y2geoo:hasGADM_Description \"County\" ; geo:hasGeometry ?c . ?c geo:asWKT ?cWKT . yago:United_States geo:hasGeometry ?usGeo . ?usGeo geo:asWKT ?usWKT . ?county y2geoo:POPULATION ?pop FILTER geof:sfWithin(?cWKT, ?usWKT) } ORDER BY DESC(xsd:double(?pop)) LIMIT 1 "
    },
    {
        "question": "How many Scottish lakes are there?",
        "sparql": " SELECT (COUNT(?slake) AS ?lakes) WHERE { yago:Scotland geo:hasGeometry ?sGeo . ?sGeo geo:asWKT ?sWKT . ?slake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?slGeo . ?slGeo geo:asWKT ?slWKT FILTER geof:sfWithin(?slWKT, ?sWKT) } "
    },
    {
        "question": "Which is the biggest forest in County Wexford?",
        "sparql": " SELECT ?forest WHERE { yago:County_Wexford geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?WKT1 . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?WKT2 FILTER geof:sfWithin(?WKT2, ?WKT1) } ORDER BY DESC(strdf:area(?WKT2)) LIMIT 1 "
    },
    {
        "question": "What is Dublin's administrative type?",
        "sparql": " SELECT ?e WHERE { yago:Dublin rdf:type ?e } "
    },
    {
        "question": "How many parks does Greece have?",
        "sparql": " SELECT (COUNT(DISTINCT ?p) AS ?parks) WHERE { ?p rdf:type y2geoo:OSM_park ; geo:hasGeometry ?o . ?o geo:asWKT ?pWKT . yago:Greece geo:hasGeometry ?g . ?g geo:asWKT ?gWKT FILTER geof:sfWithin(?pWKT, ?gWKT) } "
    },
    {
        "question": "Which county councils exist in the Republic of Ireland?",
        "sparql": " SELECT DISTINCT ?county WHERE { yago:Republic_of_Ireland geo:hasGeometry ?geomIre . ?geomIre geo:asWKT ?wktIre . ?county rdf:type y2geoo:OSI_County_Council ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?wktC FILTER geof:sfWithin(?wktC, ?wktIre) } "
    },
    {
        "question": "Find beaches in Alonnisos.",
        "sparql": " SELECT DISTINCT ?beach WHERE { ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 . yago:Alonnisos geo:hasGeometry ?g2 . ?g2 geo:asWKT ?wkt2 FILTER geof:sfIntersects(?wkt1, ?wkt2) } "
    },
    {
        "question": "Is there a village that is next to a nature reserve in England?",
        "sparql": " ASK WHERE { ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 . ?nature_reserve rdf:type y2geoo:OSM_nature_reserve ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?wkt2 . yago:England geo:hasGeometry ?g3 . ?g3 geo:asWKT ?wkt3 FILTER ( geof:sfWithin(?wkt2, ?wkt3) && geof:sfTouches(?wkt1, ?wkt2) ) } "
    },
    {
        "question": "With which municipalities does Athens share borders?",
        "sparql": " SELECT DISTINCT ?x1 WHERE { ?x1 rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?geometry . ?geometry geo:asWKT ?x1WKT . yago:geoentity_Dimos_Athens_8133876 geo:hasGeometry ?athensGeo . ?athensGeo geo:asWKT ?athWKT FILTER geof:sfTouches(?x1WKT, ?athWKT) } "
    },
    {
        "question": "Which municipalities border with Moschato Tavros?",
        "sparql": " SELECT DISTINCT ?municipality WHERE { yago:Moschato-Tavros geo:hasGeometry ?o . ?o geo:asWKT ?WKT . ?municipality rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?WKT1 FILTER geof:sfTouches(?WKT, ?WKT1) } "
    },
    {
        "question": "What is the population density of the municipality of Thessaloniki?",
        "sparql": " SELECT (( xsd:float(?pop) / xsd:float(?area) ) AS ?result) WHERE { yago:geoentity_Dimos_Thessaloniki_8133841 geo:hasGeometry ?g . ?g geo:asWKT ?wkt BIND(strdf:area(?wkt) AS ?area) yago:geoentity_Dimos_Thessaloniki_8133841 y2geoo:hasGAG_Population ?pop } "
    },
    {
        "question": "Is there a lake on the border of an English county?",
        "sparql": " ASK WHERE { ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 . ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?wkt2 FILTER geof:sfTouches(?wkt1, ?wkt2) } "
    },
    {
        "question": "How many canals are east of villages in County Kerry?",
        "sparql": " SELECT (COUNT(DISTINCT ?x) AS ?canals) WHERE { yago:County_Kerry geo:hasGeometry ?oGeo . ?oGeo geo:asWKT ?oWKT . ?x rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?xgeo . ?xgeo geo:asWKT ?xWKT . ?y rdf:type y2geoo:OSM_village ; geo:hasGeometry ?ygeo . ?ygeo geo:asWKT ?yWKT FILTER ( geof:sfContains(?oWKT, ?yWKT) && strdf:right(?xWKT, ?yWKT) ) } "
    },
    {
        "question": "What are the top five largest counties by area in the United Kingdom that are located north of the City of London?",
        "sparql": " SELECT DISTINCT ?y (strdf:area(?yWKT) AS ?totalArea) WHERE { yago:United_Kingdom geo:hasGeometry ?uGeom . ?uGeom geo:asWKT ?uWKT . ?y rdf:type y2geoo:OS_County ; geo:hasGeometry ?ygeo . ?ygeo geo:asWKT ?yWKT . yago:geoentity_City_of_London_2643744 geo:hasGeometry ?xgeo . ?xgeo geo:asWKT ?xWKT FILTER geof:sfWithin(?yWKT, ?uWKT) FILTER strdf:above(?yWKT, ?xWKT) } ORDER BY DESC(?totalArea) LIMIT 5 "
    },
    {
        "question": "Which municipalities border Athens?",
        "sparql": " SELECT DISTINCT ?municipality WHERE { yago:geoentity_Dimos_Athens_8133876 geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT . ?municipality rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?geoWKT2 FILTER geof:sfTouches(?geoWKT, ?geoWKT2) } "
    },
    {
        "question": "Which is the largest forest by area in England?",
        "sparql": " SELECT DISTINCT ?forest (strdf:area(?fWKT) AS ?totalArea) WHERE { ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?fGeom . ?fGeom geo:asWKT ?fWKT . yago:England geo:hasGeometry ?lcGeom . ?lcGeom geo:asWKT ?lcWKT FILTER geof:sfWithin(?fWKT, ?lcWKT) } ORDER BY DESC(?totalArea) LIMIT 1 "
    },
    {
        "question": "Is Cardiff north of Manchester?",
        "sparql": " ASK WHERE { yago:Cardiff geo:hasGeometry ?geom1 . ?geom1 geo:asWKT ?wkt1 . yago:Manchester geo:hasGeometry ?geom2 . ?geom2 geo:asWKT ?wkt2 FILTER strdf:above(?wkt1, ?wkt2) } "
    },
    {
        "question": "Which forests are bordering lakes in the Republic of Ireland?",
        "sparql": " SELECT DISTINCT ?a WHERE { yago:Republic_of_Ireland geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?a rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?b rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER ( ( geof:sfWithin(?geoWKT1, ?geoWKT) && geof:sfWithin(?geoWKT2, ?geoWKT) ) && geof:sfTouches(?geoWKT1, ?geoWKT2) ) } "
    },
    {
        "question": "Which is the biggest district that borders Greater London?",
        "sparql": " SELECT ?district WHERE { yago:Greater_London geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?WKT1 . ?district rdf:type y2geoo:OS_District ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?WKT2 FILTER geof:sfTouches(?WKT2, ?WKT1) } ORDER BY DESC(strdf:area(?WKT2)) LIMIT 1 "
    },
    {
        "question": "Which Civil Parish borders the Kilkieran?",
        "sparql": " SELECT DISTINCT ?x WHERE { ?x rdf:type y2geoo:OSI_Civil_Parish ; geo:hasGeometry ?xgeo . ?xgeo geo:asWKT ?xWKT . yago:geoentity_Kilkieran_3302356 geo:hasGeometry ?ygeo . ?ygeo geo:asWKT ?yWKT FILTER geof:sfTouches(?xWKT, ?yWKT) } "
    },
    {
        "question": "Which forests have a lake inside them in the US?",
        "sparql": " SELECT DISTINCT ?forest WHERE { ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?fWKT . ?lagoon rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?lWKT . yago:United_States geo:hasGeometry ?rep3 . ?rep3 geo:asWKT ?cWKT FILTER geof:sfContains(?cWKT, ?fWKT) FILTER geof:sfWithin(?lWKT, ?fWKT) } "
    },
    {
        "question": "Can you determine the names of the lakes in Greece that are completely encompassed within a single municipality?",
        "sparql": " SELECT DISTINCT ?l WHERE { ?m rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?mg . ?mg geo:asWKT ?mw . ?l rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lw FILTER geof:sfWithin(?lw, ?mw) } "
    },
    {
        "question": "Where is Aghaboy located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { y2geor:osientity_2AE19629C17E13A3E055000000000001 geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "How many municipalities contain canals?",
        "sparql": " SELECT (COUNT(DISTINCT ?municipality) AS ?municipalities) WHERE { ?municipality rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?l rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER geof:sfContains(?lcnWKT, ?lWKT) } "
    },
    {
        "question": "Where is Scotland located?",
        "sparql": " SELECT ?xWKT WHERE { yago:Scotland geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT } "
    },
    {
        "question": "Which lakes are within 50km of Dublin?",
        "sparql": " SELECT DISTINCT ?lake WHERE { yago:Dublin geo:hasGeometry ?dublin_geo . ?dublin_geo geo:asWKT ?dublin_geoWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lake_geo . ?lake_geo geo:asWKT ?lake_geoWKT FILTER ( geof:distance(?dublin_geoWKT, ?lake_geoWKT, uom:metre) <= 50000 ) } "
    },
    {
        "question": "Where is the Ballymoe barony located?",
        "sparql": " SELECT ?gWKT WHERE { yago:Ballymoe geo:hasGeometry ?g . ?g geo:asWKT ?gWKT } "
    },
    {
        "question": "How many parks does Wales have?",
        "sparql": " SELECT (COUNT(?park) AS ?numParks) WHERE { yago:Wales geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?lcnWKT) } "
    },
    {
        "question": "Is Manchester to the east of Liverpool?",
        "sparql": " ASK WHERE { yago:Manchester geo:hasGeometry ?mgeom . ?mgeom geo:asWKT ?mwkt . yago:Liverpool geo:hasGeometry ?lgeom . ?lgeom geo:asWKT ?lwkt FILTER strdf:right(?mwkt, ?lwkt) } "
    },
    {
        "question": "What is the total number of counties that border with forests in England?",
        "sparql": " SELECT (COUNT(DISTINCT ?county) AS ?counties) WHERE { { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } UNION { ?county rdf:type y2geoo:OS_County } ?county geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcWKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT . yago:England geo:hasGeometry ?eGeom . ?eGeom geo:asWKT ?eWKT FILTER ( geof:sfWithin(?lcWKT, ?eWKT) && strdf:touches(?lWKT, ?lcWKT) ) } "
    },
    {
        "question": "Is Canada east of China?",
        "sparql": " ASK WHERE { yago:Canada geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:China geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER strdf:right(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Which States of the US border with at most 2 other States?",
        "sparql": " SELECT DISTINCT ?state WHERE { yago:United_States geo:hasGeometry ?usGeo . ?usGeo geo:asWKT ?usWKT . ?state rdf:type y2geoo:GADM_2ndOrder_AdministrativeUnit ; geo:hasGeometry ?sGeo . ?sGeo geo:asWKT ?sWKT . ?state2 rdf:type y2geoo:GADM_2ndOrder_AdministrativeUnit ; geo:hasGeometry ?s2Geo . ?s2Geo geo:asWKT ?s2WKT FILTER ( ( ( ( ?state != ?state2 ) && geof:sfWithin(?sWKT, ?usWKT) ) && geof:sfWithin(?s2WKT, ?usWKT) ) && geof:sfTouches(?sWKT, ?s2WKT) ) } GROUP BY ?state HAVING ( COUNT(?state2) <= 2 ) "
    },
    {
        "question": "What is the total area of Greece?",
        "sparql": " SELECT (strdf:area(?wkt) AS ?area) WHERE { yago:Greece geo:hasGeometry ?geom . ?geom geo:asWKT ?wkt } "
    },
    {
        "question": "Which forests are entirely within an Irish Barony?",
        "sparql": " SELECT DISTINCT ?l WHERE { yago:Republic_of_Ireland geo:hasGeometry ?irlG . ?irlG geo:asWKT ?irlWKT . ?m rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?mg . ?mg geo:asWKT ?mw . ?l rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lw FILTER ( geof:sfWithin(?mw, ?irlWKT) && geof:sfWithin(?lw, ?mw) ) } "
    },
    {
        "question": "What is the total number of lakes and the total number of streams located within the city limits of Cork?",
        "sparql": " SELECT (COUNT(DISTINCT ?lake) AS ?total_lakes) (COUNT(DISTINCT ?stream) AS ?total_streams) WHERE { yago:geoentity_Cork_City_7778678 geo:hasGeometry ?o . ?o geo:asWKT ?A . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geomB . ?geomB geo:asWKT ?B . ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?C FILTER geof:sfWithin(?B, ?A) FILTER geof:sfWithin(?C, ?A) } "
    },
    {
        "question": "Which villages are north of lakes and parks in County Cumbria?",
        "sparql": " SELECT DISTINCT ?village WHERE { yago:Cumbria geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?park rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 FILTER ( ( ( ( geof:sfWithin(?geoWKT1, ?geoWKT) && geof:sfWithin(?geoWKT2, ?geoWKT) ) && geof:sfWithin(?geoWKT3, ?geoWKT) ) && strdf:above(?geoWKT1, ?geoWKT2) ) && strdf:above(?geoWKT1, ?geoWKT3) ) } "
    },
    {
        "question": "How many nature reserves intersect with towns?",
        "sparql": " SELECT (COUNT(DISTINCT ?natureReserve) AS ?natureReserves) WHERE { ?town rdf:type y2geoo:OSM_town ; geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?natureReserve rdf:type y2geoo:OSM_nature_reserve ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER geof:sfIntersects(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Which county is the biggest by population in Nevada?",
        "sparql": " SELECT ?county WHERE { yago:Nevada geo:hasGeometry ?geom . ?geom geo:asWKT ?mWKT . ?county y2geoo:hasGADM_Description \"County\" ; geo:hasGeometry ?geom2 . ?geom2 geo:asWKT ?cWKT FILTER geof:sfContains(?mWKT, ?cWKT) ?county y2geoo:POPULATION ?pop } ORDER BY DESC(xsd:double(?pop)) LIMIT 1 "
    },
    {
        "question": "Where is City of London located?",
        "sparql": " SELECT DISTINCT ?xWKT WHERE { yago:geoentity_City_of_London_2643744 geo:hasGeometry ?xgeo . ?xgeo geo:asWKT ?xWKT } "
    },
    {
        "question": "How many towns intersect with woodlands?",
        "sparql": " SELECT (COUNT(DISTINCT ?island) AS ?islands) WHERE { ?region rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?o . ?o geo:asWKT ?WKT . ?island rdf:type y2geoo:OSM_town ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?WKT1 FILTER geof:sfIntersects(?WKT1, ?WKT) } "
    }
]