[
    {
        "question": "How many rivers are on islands in Greece?",
        "sparql": " SELECT (COUNT(DISTINCT ?river) AS ?rivers) WHERE { yago:Greece geo:hasGeometry ?oGeo . ?oGeo geo:asWKT ?oWKT . ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?islandGeom . ?islandGeom geo:asWKT ?xWKT . ?river rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?riverGeom . ?riverGeom geo:asWKT ?yWKT FILTER ( geof:sfContains(?oWKT, ?xWKT) && geof:sfWithin(?yWKT, ?xWKT) ) } "
    },
    {
        "question": "Which lakes are entirely within an Irish Barony?",
        "sparql": " SELECT DISTINCT ?l WHERE { yago:Republic_of_Ireland geo:hasGeometry ?irlG . ?irlG geo:asWKT ?irlWKT . ?m rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?mg . ?mg geo:asWKT ?mw . ?l rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lw FILTER ( geof:sfWithin(?mw, ?irlWKT) && geof:sfWithin(?lw, ?mw) ) } "
    },
    {
        "question": "How many canals are there in Alabama?",
        "sparql": " SELECT (COUNT(?lake) AS ?canals) WHERE { yago:Alabama geo:hasGeometry ?geom . ?geom geo:asWKT ?mWKT . ?lake rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?geol . ?geol geo:asWKT ?lWKT FILTER geof:sfContains(?mWKT, ?lWKT) } "
    },
    {
        "question": "What is the largest body of water located in the region of County Kerry?",
        "sparql": " SELECT DISTINCT ?lake (strdf:area(?sWKT) AS ?area) WHERE { yago:County_Kerry geo:hasGeometry ?lgeo . ?lgeo geo:asWKT ?lWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?sgeo . ?sgeo geo:asWKT ?sWKT FILTER geof:sfWithin(?sWKT, ?lWKT) } ORDER BY DESC(?area) LIMIT 1 "
    },
    {
        "question": "Which lakes intersect with forests in the Republic of Ireland?",
        "sparql": " SELECT DISTINCT ?vill WHERE { yago:Republic_of_Ireland geo:hasGeometry ?geoC . ?geoC geo:asWKT ?cWKT . ?vill rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geoL . ?geoL geo:asWKT ?lWKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?geoF . ?geoF geo:asWKT ?fWKT FILTER ( geof:sfWithin(?fWKT, ?cWKT) && geof:sfIntersects(?lWKT, ?fWKT) ) } "
    },
    {
        "question": "Where is Lough Ramor located?",
        "sparql": " SELECT DISTINCT ?wkt WHERE { yago:Lough_Ramor geo:hasGeometry ?geo . ?geo geo:asWKT ?wkt } "
    },
    {
        "question": "What is the number of bays that are adjacent to villages?",
        "sparql": " SELECT (COUNT(DISTINCT ?bay) AS ?bays) WHERE { ?bay rdf:type y2geoo:OSM_bay ; geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT . ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?x2Geo . ?x2Geo geo:asWKT ?x2WKT FILTER geof:sfTouches(?x1WKT, ?x2WKT) } "
    },
    {
        "question": "Which districts of Cambridge have forests?",
        "sparql": " SELECT DISTINCT ?district WHERE { ?district rdf:type y2geoo:OS_District ; geo:hasGeometry ?districtGeo . ?districtGeo geo:asWKT ?districtWKT . ?lake rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?lakeGeo . ?lakeGeo geo:asWKT ?lakeWKT . yago:Cambridge geo:hasGeometry ?x2Geo . ?x2Geo geo:asWKT ?x2WKT FILTER geof:sfWithin(?districtWKT, ?x2WKT) FILTER geof:sfWithin(?lakeWKT, ?districtWKT) } "
    },
    {
        "question": "Which reservoirs are east of 3rd order administrative units in Ireland?",
        "sparql": " SELECT DISTINCT ?res WHERE { yago:Republic_of_Ireland geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT . ?res rdf:type y2geoo:OSM_reservoir ; geo:hasGeometry ?resGeom . ?resGeom geo:asWKT ?resWKT FILTER geof:sfWithin(?resWKT, ?xWKT) ?town rdf:type y2geoo:GADM_3rdOrder_AdministrativeUnit ; geo:hasGeometry ?townGeom . ?townGeom geo:asWKT ?townWKT FILTER strdf:right(?resWKT, ?townWKT) } "
    },
    {
        "question": "Which is the largest lake in Kansas?",
        "sparql": " SELECT DISTINCT ?lake (strdf:area(?lWKT) AS ?area) WHERE { yago:Kansas geo:hasGeometry ?geom . ?geom geo:asWKT ?mWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geol . ?geol geo:asWKT ?lWKT FILTER geof:sfContains(?mWKT, ?lWKT) } ORDER BY DESC(?area) LIMIT 1 "
    },
    {
        "question": "Find all the Greek parks.",
        "sparql": " SELECT DISTINCT ?p WHERE { ?p rdf:type y2geoo:OSM_park ; geo:hasGeometry ?o . ?o geo:asWKT ?pWKT . yago:Greece geo:hasGeometry ?g . ?g geo:asWKT ?gWKT FILTER geof:sfWithin(?pWKT, ?gWKT) } "
    },
    {
        "question": "Which regional unit in the region of Thessaly has a beach?",
        "sparql": " SELECT DISTINCT ?city WHERE { yago:Thessaly geo:hasGeometry ?THGeo . ?THGeo geo:asWKT ?A . ?city rdf:type y2geoo:GAG_RegionalUnit ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?C . ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?geomB . ?geomB geo:asWKT ?B FILTER ( geof:sfWithin(?C, ?A) && geof:sfWithin(?B, ?C) ) } "
    },
    {
        "question": "What is Londonderry's surface area?",
        "sparql": " SELECT DISTINCT ?area WHERE { y2geor:osnientity_Londonderry_1414 y2geoo:hasOSNI_Area ?area } "
    },
    {
        "question": "Are there forests that are entirely contained in a region which is south of Corfu?",
        "sparql": " ASK WHERE { ?m rdf:type y2geoo:GAG_Region . yago:Corfu geo:hasGeometry ?cg . ?m geo:hasGeometry ?mg . ?cg geo:asWKT ?cw . ?mg geo:asWKT ?mw FILTER strdf:below(?mw, ?cw) ?l rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lw FILTER geof:sfWithin(?lw, ?mw) } "
    },
    {
        "question": "Does Lemnos have any beaches?",
        "sparql": " ASK WHERE { yago:Lemnos geo:hasGeometry ?lemnos_geo . ?lemnos_geo geo:asWKT ?lemnosWKT . ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?fWKT FILTER geof:sfWithin(?fWKT, ?lemnosWKT) } "
    },
    {
        "question": "Which is the longest canal in England?",
        "sparql": " SELECT ?canal WHERE { yago:England geo:hasGeometry ?eGeo . ?eGeo geo:asWKT ?eWKT . ?canal rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?cGeo . ?cGeo geo:asWKT ?cWKT FILTER geof:sfWithin(?cWKT, ?eWKT) } ORDER BY DESC(strdf:area(?cWKT)) LIMIT 1 "
    },
    {
        "question": "Do Cambridge and Oxford intersect?",
        "sparql": " ASK WHERE { yago:geoentity_Cambridge_District_7290660 geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?WKT1 . yago:Oxford geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?WKT2 FILTER geof:sfIntersects(?WKT1, ?WKT2) } "
    },
    {
        "question": "Which towns are west of lakes in Thrace?",
        "sparql": " SELECT DISTINCT ?town WHERE { yago:geoentity_Eastern_Macedonia_and_Thrace_6697803 geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?town rdf:type y2geoo:OSM_village ; geo:hasGeometry ?geomP . ?geomP geo:asWKT ?lWKT_P . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geomF . ?geomF geo:asWKT ?lWKT_F FILTER ( ( geof:sfWithin(?lWKT_F, ?lcnWKT) && geof:sfWithin(?lWKT_P, ?lcnWKT) ) && strdf:left(?lWKT_P, ?lWKT_F) ) } "
    },
    {
        "question": "Which Irish county has the fewest townlands?",
        "sparql": " SELECT DISTINCT ?county (COUNT(?town) AS ?num) WHERE { { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } ?town rdf:type y2geoo:OSI_Townland . ?county geo:hasGeometry ?geoc . ?geoc geo:asWKT ?cWKT . ?town geo:hasGeometry ?geot . ?geot geo:asWKT ?tWKT FILTER geof:sfWithin(?tWKT, ?cWKT) } GROUP BY ?county ORDER BY ?num LIMIT 1 "
    },
    {
        "question": "Which regional units of Greece share a border with three regional units?",
        "sparql": " SELECT ?municipalUnit WHERE { ?municipalUnit rdf:type y2geoo:GAG_RegionalUnit ; geo:hasGeometry ?muGeo . ?muGeo geo:asWKT ?muWKT . ?municipalUnit2 rdf:type y2geoo:GAG_RegionalUnit ; geo:hasGeometry ?mu2Geo . ?mu2Geo geo:asWKT ?mu2WKT FILTER ( ( ?municipalUnit != ?municipalUnit2 ) && geof:sfTouches(?muWKT, ?mu2WKT) ) } GROUP BY ?municipalUnit HAVING ( COUNT(?municipalUnit2) = 3 ) "
    },
    {
        "question": "Which islands are situated within the boundaries of lakes?",
        "sparql": " SELECT ?village WHERE { ?village rdf:type y2geoo:OSM_island ; geo:hasGeometry ?villageGeom . ?villageGeom geo:asWKT ?xWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lakeGeom . ?lakeGeom geo:asWKT ?yWKT FILTER geof:sfContains(?yWKT, ?xWKT) } "
    },
    {
        "question": "Which municipalities are on Thessaly's border?",
        "sparql": " SELECT DISTINCT ?rg WHERE { yago:Thessaly geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tgWKT . ?rg rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?rggeo . ?rggeo geo:asWKT ?rgWKT FILTER geof:sfTouches(?tgWKT, ?rgWKT) } "
    },
    {
        "question": "Which parks are located within the boundaries of cities in Orange County, California",
        "sparql": " SELECT DISTINCT ?park WHERE { ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?pg . ?pg geo:asWKT ?pgeoWKT . ?city rdf:type y2geoo:OSM_city ; geo:hasGeometry ?cg . ?cg geo:asWKT ?cgeoWKT . <http://yago-knowledge.org/resource/Orange_County,_California> geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT FILTER ( strdf:within(?cgeoWKT, ?geoWKT) && strdf:within(?pgeoWKT, ?cgeoWKT) ) } "
    },
    {
        "question": "How many beaches are in Greek municipalities?",
        "sparql": " SELECT (COUNT(DISTINCT ?beach) AS ?beaches) WHERE { ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT . ?region rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?x2Geo . ?x2Geo geo:asWKT ?x2WKT FILTER geof:sfWithin(?x1WKT, ?x2WKT) } "
    },
    {
        "question": "Does Dublin share a border with Clane?",
        "sparql": " ASK WHERE { yago:Dublin geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:Clane geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER geof:sfTouches(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "What is the largest state by area in the USA?",
        "sparql": " SELECT ?state (strdf:area(?sWKT) AS ?area) WHERE { yago:United_States geo:hasGeometry ?usGeo . ?usGeo geo:asWKT ?usWKT . ?state rdf:type y2geoo:GADM_2ndOrder_AdministrativeUnit ; geo:hasGeometry ?sGeo . ?sGeo geo:asWKT ?sWKT FILTER geof:sfWithin(?sWKT, ?usWKT) } ORDER BY ?area LIMIT 1 "
    },
    {
        "question": "Give me one lake in Greece that is west of a canal.",
        "sparql": " SELECT DISTINCT ?x2 WHERE { yago:Greece geo:hasGeometry ?o2 . ?o2 geo:asWKT ?xWKT2 . ?x2 rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?x2Geom . ?x2Geom geo:asWKT ?iWKT2 . ?x1 rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?x1Geom . ?x1Geom geo:asWKT ?iWKT1 FILTER ( geof:sfWithin(?iWKT2, ?xWKT2) && strdf:left(?iWKT2, ?iWKT1) ) } LIMIT 1 "
    },
    {
        "question": "Is Kastoria north of Livadeia?",
        "sparql": " ASK WHERE { yago:Kastoria geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:Livadeia geo:hasGeometry ?o1 ; rdf:type ?type . ?o1 geo:asWKT ?geoWKT1 FILTER strdf:above(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Which counties border County Mayo?",
        "sparql": " SELECT DISTINCT ?county WHERE { yago:County_Mayo geo:hasGeometry ?geo1 . ?geo1 geo:asWKT ?geoWKT1 { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } ?county geo:hasGeometry ?geo2 . ?geo2 geo:asWKT ?geoWKT2 FILTER geof:sfTouches(?geoWKT1, ?geoWKT2) } "
    },
    {
        "question": "Which lakes are in the Epirus region?",
        "sparql": " SELECT DISTINCT ?lake WHERE { <http://yago-knowledge.org/resource/Epirus_(region)> geo:hasGeometry ?geoC . ?geoC geo:asWKT ?cWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geoL . ?geoL geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?cWKT) } "
    },
    {
        "question": "Where is municipality of Nafplio located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:geoentity_Dimos_Nafplio_8133806 geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which US counties intersect with Missouri?",
        "sparql": " SELECT ?county WHERE { yago:United_States geo:hasGeometry ?usGeo . ?usGeo geo:asWKT ?usWKT . yago:Missouri geo:hasGeometry ?cGeo . ?cGeo geo:asWKT ?cWKT . ?county rdf:type y2geoo:GADM_3rdOrder_AdministrativeUnit ; geo:hasGeometry ?ctGeo . ?ctGeo geo:asWKT ?ctWKT FILTER ( geof:sfWithin(?ctWKT, ?usWKT) && geof:sfIntersects(?ctWKT, ?cWKT) ) } "
    },
    {
        "question": "Which island is located south of island Hoy?",
        "sparql": " SELECT ?island WHERE { yago:geoentity_Hoy_2646475 geo:hasGeometry ?geo1 . ?geo1 geo:asWKT ?wkt1 . ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?geo2 . ?geo2 geo:asWKT ?wkt2 FILTER strdf:below(?wkt2, ?wkt1) } ORDER BY geof:distance(?wkt1, ?wkt2) LIMIT 1 "
    },
    {
        "question": "How many islands does Scotland have?",
        "sparql": " SELECT (COUNT(?island) AS ?numIslands) WHERE { yago:Scotland geo:hasGeometry ?sGeom . ?sGeom geo:asWKT ?sWKT . ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?iGeom . ?iGeom geo:asWKT ?iWKT FILTER geof:sfWithin(?iWKT, ?sWKT) } "
    },
    {
        "question": "How many islands does Ireland have?",
        "sparql": " SELECT (COUNT(?island) AS ?islands) WHERE { ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?islandGeom . ?islandGeom geo:asWKT ?islandWKT . yago:Republic_of_Ireland geo:hasGeometry ?irelandGeom . ?irelandGeom geo:asWKT ?irelandWKT FILTER geof:sfWithin(?islandWKT, ?irelandWKT) } "
    },
    {
        "question": "Which town in England with a river crossing it has the largest area?",
        "sparql": " SELECT ?town (strdf:area(?townWKT) AS ?totalArea) WHERE { yago:United_Kingdom geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT . ?town rdf:type y2geoo:OSM_town ; geo:hasGeometry ?townGeom . ?townGeom geo:asWKT ?townWKT FILTER geof:sfWithin(?townWKT, ?xWKT) ?river rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?rivGeom . ?rivGeom geo:asWKT ?rivWKT FILTER geof:sfCrosses(?rivWKT, ?townWKT) } ORDER BY DESC(?totalArea) LIMIT 1 "
    },
    {
        "question": "What is the total area of the river Garw?",
        "sparql": " SELECT DISTINCT (strdf:area(?geoWKT) AS ?totalArea) WHERE { yago:River_Garw geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which county bordering the city of Cork contains the largest lake?",
        "sparql": " SELECT DISTINCT ?county (strdf:area(?B) AS ?biggest_lake) WHERE { yago:geoentity_Cork_City_7778678 geo:hasGeometry ?o . ?o geo:asWKT ?A { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } ?county geo:hasGeometry ?geomC . ?geomC geo:asWKT ?C . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geomB . ?geomB geo:asWKT ?B FILTER geof:sfTouches(?C, ?A) FILTER geof:sfWithin(?B, ?C) } ORDER BY DESC(?biggest_lake) LIMIT 1 "
    },
    {
        "question": "Is Athlone northeast of Portumna?",
        "sparql": " ASK WHERE { yago:Athlone geo:hasGeometry ?o2 . ?o2 geo:asWKT ?athloneWKT . yago:Portumna geo:hasGeometry ?o . ?o geo:asWKT ?portumnaWKT FILTER strdf:right(?athloneWKT, ?portumnaWKT) FILTER strdf:above(?athloneWKT, ?portumnaWKT) } "
    },
    {
        "question": "Which municipalities that belong to Periferiaki Enotita Nison and have less than 3000 residents individually, contain islands?",
        "sparql": " SELECT DISTINCT ?dimos WHERE { yago:geoentity_Perifereiak\u00ed_En\u00f3tita_N\u00edson_8200487 geo:hasGeometry ?aGeo . ?aGeo geo:asWKT ?A . ?dimos geo:hasGeometry ?dimos_geo . ?dimos_geo geo:asWKT ?dimos_geoWKT . ?dimos y2geoo:hasGAG_Population ?dimos_pop FILTER ( ?dimos_pop < 3000 ) ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?island_geo . ?island_geo geo:asWKT ?island_geoWKT FILTER ( geof:sfWithin(?dimos_geoWKT, ?A) && geof:sfIntersects(?island_geoWKT, ?dimos_geoWKT) ) } "
    },
    {
        "question": "Which counties have no forests?",
        "sparql": " SELECT DISTINCT ?county WHERE { { ?county rdf:type y2geoo:OS_County } UNION { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } ?county geo:hasGeometry ?countyGeom . ?countyGeom geo:asWKT ?countyWKT FILTER NOT EXISTS { ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?fGeom . ?fGeom geo:asWKT ?fWKT FILTER geof:sfContains(?countyWKT, ?fWKT) } } "
    },
    {
        "question": "Which townlands are south of streams and baronies in the county of Longford?",
        "sparql": " SELECT DISTINCT ?forest WHERE { yago:County_Longford geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?forest rdf:type y2geoo:OSI_Townland ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?park rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 FILTER ( ( ( ( geof:sfWithin(?geoWKT1, ?geoWKT) && geof:sfWithin(?geoWKT2, ?geoWKT) ) && geof:sfWithin(?geoWKT3, ?geoWKT) ) && strdf:below(?geoWKT1, ?geoWKT2) ) && strdf:below(?geoWKT1, ?geoWKT3) ) } "
    },
    {
        "question": "Which streams are located on the islands of Greece?",
        "sparql": " SELECT DISTINCT ?lake WHERE { ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?ig . ?ig geo:asWKT ?igeoWKT . yago:Greece geo:hasGeometry ?g2 . ?g2 geo:asWKT ?geoWKT FILTER geof:sfWithin(?igeoWKT, ?geoWKT) ?lake rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lgeoWKT FILTER geof:sfWithin(?lgeoWKT, ?igeoWKT) } "
    },
    {
        "question": "Which counties are near Nottingham?",
        "sparql": " SELECT DISTINCT ?counties WHERE { yago:Nottinghamshire geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 . ?counties rdf:type y2geoo:OS_County ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?wkt2 FILTER ( ( ?counties != yago:Nottinghamshire ) && ( geof:distance(?wkt1, ?wkt2, uom:metre) < 5000 ) ) } "
    },
    {
        "question": "Which municipality bordering Agia Paraskevi has the largest population ?",
        "sparql": " SELECT DISTINCT ?dimos WHERE { yago:Agia_Paraskevi geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?dimos rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?cWKT . ?dimos y2geoo:hasGAG_Population ?pop FILTER geof:sfTouches(?geoWKT, ?cWKT) } ORDER BY DESC(?pop) LIMIT 1 "
    },
    {
        "question": "Is England to the west of Greece?",
        "sparql": " ASK WHERE { yago:England geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . yago:Greece geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER strdf:left(?geoWKT1, ?geoWKT2) } "
    },
    {
        "question": "What are the adjacent districts surrounding Greater London?",
        "sparql": " SELECT ?district WHERE { ?district rdf:type y2geoo:OS_District ; geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT . yago:Greater_London geo:hasGeometry ?x2Geo . ?x2Geo geo:asWKT ?x2WKT FILTER geof:sfTouches(?x1WKT, ?x2WKT) } "
    },
    {
        "question": "What is the population of Andravida?",
        "sparql": " SELECT ?population WHERE { yago:Andravida y2geoo:hasGAG_Population ?population } "
    },
    {
        "question": "Which counties border County Donegal?",
        "sparql": " SELECT DISTINCT ?county WHERE { yago:County_Donegal geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } ?county geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER geof:sfTouches(?geoWKT1, ?geoWKT2) } "
    },
    {
        "question": "Is Cork City west of Dublin?",
        "sparql": " ASK WHERE { yago:geoentity_Cork_City_7778678 geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:Dublin geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER strdf:left(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "What is the number of nature reserves that are located on islands?",
        "sparql": " SELECT (COUNT(DISTINCT ?nature_reserve) AS ?nature_reserves) WHERE { ?nature_reserve rdf:type y2geoo:OSM_nature_reserve ; geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT . ?islands rdf:type y2geoo:OSM_island ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?geoWKT2 FILTER geof:sfWithin(?geoWKT, ?geoWKT2) } "
    },
    {
        "question": "which beaches are near Nea Smirni?",
        "sparql": " SELECT DISTINCT ?x WHERE { ?x rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?beachGeo . ?beachGeo geo:asWKT ?beachPolygon . yago:Nea_Smyrni geo:hasGeometry ?NsGeo . ?NsGeo geo:asWKT ?NsGeometry FILTER ( geof:distance(?NsGeometry, ?beachPolygon, uom:metre) < 5000 ) } "
    },
    {
        "question": "Which parks are in New York City?",
        "sparql": " SELECT DISTINCT ?park WHERE { yago:New_York_City geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?lcnWKT) } "
    },
    {
        "question": "Does Greece have more towns than Ireland?",
        "sparql": " ASK WHERE { { SELECT (COUNT(?gtown) AS ?greekTowns) (COUNT(?itown) AS ?irishTowns) WHERE { y2geor:Greece geo:hasGeometry ?gGeo . ?gGeo geo:asWKT ?gWKT . yago:Republic_of_Ireland geo:hasGeometry ?iGeo . ?iGeo geo:asWKT ?iWKT . ?gtown rdf:type y2geoo:OSM_town ; geo:hasGeometry ?gtGeo . ?gtGeo geo:asWKT ?gtWKT . ?itown rdf:type y2geoo:OSM_town ; geo:hasGeometry ?itGeo . ?itGeo geo:asWKT ?itWKT FILTER ( geof:sfWithin(?itWKT, ?iWKT) && geof:sfWithin(?gtWKT, ?gWKT) ) } } FILTER ( ?greekTowns > ?irishTowns ) } "
    },
    {
        "question": "Which 2 counties are the smallest by area?",
        "sparql": " SELECT DISTINCT ?county (strdf:area(?cWKT) AS ?totalArea) WHERE { { ?county rdf:type y2geoo:OS_County } UNION { ?county rdf:type y2geoo:OSI_County_Council } ?county geo:hasGeometry ?geoC . ?geoC geo:asWKT ?cWKT } ORDER BY ?totalArea LIMIT 2 "
    },
    {
        "question": "Where is Ullswater on a map?",
        "sparql": " SELECT ?WKT WHERE { yago:Ullswater geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?WKT } "
    },
    {
        "question": "Which forests intersect with rural areas in the Republic of Ireland?",
        "sparql": " SELECT DISTINCT ?forest WHERE { ?x rdf:type y2geoo:OSI_Rural_Area ; geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . yago:Republic_of_Ireland geo:hasGeometry ?i . ?i geo:asWKT ?geoWKT2 FILTER geof:sfIntersects(?geoWKT1, ?geoWKT) FILTER geof:sfWithin(?geoWKT, ?geoWKT2) } "
    },
    {
        "question": "How many beaches are next to cities?",
        "sparql": " SELECT (COUNT(DISTINCT ?beach) AS ?beaches) WHERE { ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?city rdf:type y2geoo:OSM_city ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER geof:sfTouches(?geoWKT1, ?geoWKT2) } "
    },
    {
        "question": "Which districts of Suffolk have forests within them?",
        "sparql": " SELECT DISTINCT ?district WHERE { yago:Suffolk geo:hasGeometry ?Suffolk_geo . ?Suffolk_geo geo:asWKT ?Suffolk_geoWKT . ?district rdf:type y2geoo:OS_District ; geo:hasGeometry ?district_geo . ?district_geo geo:asWKT ?district_geoWKT FILTER geof:sfWithin(?district_geoWKT, ?Suffolk_geoWKT) ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?forest_geo . ?forest_geo geo:asWKT ?forest_geoWKT FILTER geof:sfWithin(?forest_geoWKT, ?district_geoWKT) } "
    },
    {
        "question": "How many localities are adjacent to forests?",
        "sparql": " SELECT (COUNT(DISTINCT ?locality) AS ?localities) WHERE { ?locality rdf:type y2geoo:OSM_locality ; geo:hasGeometry ?localityGeometry . ?localityGeometry geo:asWKT ?localityWKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?forestGeometry . ?forestGeometry geo:asWKT ?forestWKT FILTER geof:sfTouches(?localityWKT, ?forestWKT) } "
    },
    {
        "question": "Which Irish counties that border County Kildare intersect with canals?",
        "sparql": " SELECT DISTINCT ?county WHERE { yago:County_Kildare geo:hasGeometry ?kildare_geo . ?kildare_geo geo:asWKT ?kildare_geoWKT . ?county rdf:type y2geoo:OSI_County_Council ; geo:hasGeometry ?county_geo . ?county_geo geo:asWKT ?county_geoWKT FILTER geof:sfTouches(?county_geoWKT, ?kildare_geoWKT) ?canal rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?canal_geo . ?canal_geo geo:asWKT ?canal_geoWKT FILTER geof:sfIntersects(?canal_geoWKT, ?county_geoWKT) } "
    },
    {
        "question": "What is the total number of villages that are inside lakes in England?",
        "sparql": " SELECT (COUNT(DISTINCT ?village) AS ?villages) WHERE { yago:England geo:hasGeometry ?oGeo . ?oGeo geo:asWKT ?oWKT . ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?villageGeom . ?villageGeom geo:asWKT ?xWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lakeGeom . ?lakeGeom geo:asWKT ?yWKT FILTER ( geof:sfContains(?oWKT, ?yWKT) && geof:sfContains(?yWKT, ?xWKT) ) } "
    },
    {
        "question": "Which municipalities of Attica have at least one beach?",
        "sparql": " SELECT DISTINCT ?Municip WHERE { ?Municip geo:sfWithin <http://yago-knowledge.org/resource/Attica_(region)> . ?Municp rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?MunicpGeo . ?MunicpGeo geo:asWKT ?MunicpPolygon . ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?beachGeo . ?beachGeo geo:asWKT ?beachPolygon FILTER geof:sfWithin(?beachPolygon, ?MunicpPolygon) } "
    },
    {
        "question": "Which are the 10 smallest towns in the island of Ireland?",
        "sparql": " SELECT DISTINCT ?town (strdf:area(?wkt1) AS ?totalArea) WHERE { ?town rdf:type y2geoo:OSM_town ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 { yago:Republic_of_Ireland geo:hasGeometry ?g2 } UNION { yago:Northern_Ireland geo:hasGeometry ?g2 } ?g2 geo:asWKT ?wkt2 FILTER geof:sfWithin(?wkt1, ?wkt2) } ORDER BY ?totalArea LIMIT 10 "
    },
    {
        "question": "In Ireland, which townloads and lakes are next to eachother?",
        "sparql": " SELECT DISTINCT ?townName ?lakeName WHERE { ?city rdf:type y2geoo:OSI_Townland ; y2geoo:hasOSM_Name ?townName ; geo:hasGeometry ?cityGeo . ?cityGeo geo:asWKT ?cityWKT . ?vilg rdf:type y2geoo:OSM_lake ; y2geoo:hasOSM_Name ?lakeName ; geo:hasGeometry ?vilgGeo . ?vilgGeo geo:asWKT ?vilgWKT . yago:Republic_of_Ireland geo:hasGeometry ?IrGeo . ?IrGeo geo:asWKT ?IrWKT FILTER ( ( geof:sfContains(?IrWKT, ?cityWKT) && geof:sfContains(?IrWKT, ?vilgWKT) ) && geof:sfTouches(?cityWKT, ?vilgWKT) ) } "
    },
    {
        "question": "Is Chania east of Athens?",
        "sparql": " ASK WHERE { yago:geoentity_Chania_8133762 geo:hasGeometry ?g1 . yago:geoentity_Dimos_Athens_8133876 geo:hasGeometry ?g2 . ?g1 geo:asWKT ?w1 . ?g2 geo:asWKT ?w2 FILTER strdf:right(?w1, ?w2) } "
    },
    {
        "question": "Where is Drogheda located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Drogheda geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Is Ballymoe located in County Longford?",
        "sparql": " ASK WHERE { yago:Ballymoe geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT . yago:County_Longford geo:hasGeometry ?g2 . ?g2 geo:asWKT ?geoWKT2 FILTER geof:sfWithin(?geoWKT, ?geoWKT2) } "
    },
    {
        "question": "How many towns have canals in Northern Ireland?",
        "sparql": " SELECT (COUNT(DISTINCT ?town) AS ?towns) WHERE { ?town rdf:type y2geoo:OSM_town ; geo:hasGeometry ?geomT . ?geomT geo:asWKT ?fWKT . ?canal rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT . yago:Northern_Ireland geo:hasGeometry ?geom . ?geom geo:asWKT ?mWKT FILTER ( ( geof:sfWithin(?lWKT, ?mWKT) && geof:sfWithin(?fWKT, ?mWKT) ) && geof:sfTouches(?lWKT, ?fWKT) ) } "
    },
    {
        "question": "What is the aggregate surface area of Liverpool?",
        "sparql": " SELECT DISTINCT (strdf:area(?geoWKT) AS ?totalArea) WHERE { yago:Liverpool geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which is the number of inhabitants residing on the islands situated within Greece?",
        "sparql": " SELECT DISTINCT ?pop ?x WHERE { ?x rdf:type y2geoo:OSM_island ; geo:hasGeometry ?xGeom ; y2geoo:hasGAG_Population ?pop . ?xGeom geo:asWKT ?xWKT . yago:Greece geo:hasGeometry ?o1 . ?o1 geo:asWKT ?iWKT FILTER geof:sfWithin(?xWKT, ?iWKT) } "
    },
    {
        "question": "Is Cambridge south of London?",
        "sparql": " ASK WHERE { yago:London geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT_London . yago:geoentity_Cambridge_District_7290660 geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT_Cambridge FILTER strdf:below(?geoWKT_Cambridge, ?geoWKT_London) } "
    },
    {
        "question": "Where is Kilkenny located?",
        "sparql": " SELECT ?geoWKT WHERE { yago:geoentity_Kilkenny_10130170 geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which are the forests and the canals of Edinburgh?",
        "sparql": " SELECT DISTINCT ?forest ?canal WHERE { yago:Edinburgh geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT . ?canal rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?geomLC2 . ?geomLC2 geo:asWKT ?lcnWKT2 FILTER ( geof:sfWithin(?lWKT, ?lcnWKT) && geof:sfWithin(?lcnWKT2, ?lcnWKT) ) } "
    },
    {
        "question": "In which country is the Loch Ness lake located?",
        "sparql": " SELECT ?country WHERE { ?country rdf:type y2geoo:GADM_1stOrder_AdministrativeUnit ; geo:hasGeometry ?cgeom . ?cgeom geo:asWKT ?cwkt . yago:Loch_Ness geo:hasGeometry ?lgeom . ?lgeom geo:asWKT ?lwkt FILTER geof:sfContains(?cwkt, ?lwkt) } "
    },
    {
        "question": "Which lakes are linked to a woodland area?",
        "sparql": " SELECT DISTINCT ?x WHERE { ?x rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT . ?o rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?oGeom . ?oGeom geo:asWKT ?iWKT FILTER geof:sfIntersects(?xWKT, ?iWKT) } "
    },
    {
        "question": "Which villages are south of beaches in Peloponnese?",
        "sparql": " SELECT DISTINCT ?village WHERE { <http://yago-knowledge.org/resource/Peloponnese_(region)> geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER ( ( strdf:within(?geoWKT1, ?geoWKT) && strdf:within(?geoWKT2, ?geoWKT) ) && strdf:below(?geoWKT1, ?geoWKT2) ) } "
    },
    {
        "question": "What is the number of people that live in the Municipalities of Central Greece?",
        "sparql": " SELECT (SUM(DISTINCT ?pop) AS ?people) WHERE { ?x rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?xGeom ; y2geoo:hasGAG_Population ?pop . ?xGeom geo:asWKT ?xWKT . <http://yago-knowledge.org/resource/Central_Greece_(region)> geo:hasGeometry ?o1 . ?o1 geo:asWKT ?iWKT FILTER geof:sfWithin(?xWKT, ?iWKT) } "
    },
    {
        "question": "Which rural areas border with Castleblayney?",
        "sparql": " SELECT DISTINCT ?rural_area WHERE { yago:Castleblayney geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcWKT . ?rural_area rdf:type y2geoo:OSI_Rural_Area ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?cWKT FILTER geof:sfTouches(?lcWKT, ?cWKT) } "
    },
    {
        "question": "Which is the municipality by area in Western Macedonia?",
        "sparql": " SELECT DISTINCT ?park (strdf:area(?pWKT) AS ?totalArea) WHERE { ?park rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?pGeom . ?pGeom geo:asWKT ?pWKT . yago:geoentity_Western_Macedonia_6697811 geo:hasGeometry ?lcGeom . ?lcGeom geo:asWKT ?lcWKT FILTER geof:sfWithin(?pWKT, ?lcWKT) } ORDER BY DESC(?totalArea) LIMIT 1 "
    },
    {
        "question": "Which is the smallest barony in County Wicklow?",
        "sparql": " SELECT DISTINCT ?forest (strdf:area(?sWKT) AS ?area) WHERE { yago:County_Wicklow geo:hasGeometry ?lgeo . ?lgeo geo:asWKT ?lWKT . ?forest rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?sgeo . ?sgeo geo:asWKT ?sWKT FILTER geof:sfWithin(?sWKT, ?lWKT) } ORDER BY ASC(?area) LIMIT 1 "
    }
]