[
    {
        "question": "Which municipalities intersect with parks in the Central Athens regional unit.",
        "sparql": " SELECT DISTINCT ?m WHERE { ?m rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?om . ?om geo:asWKT ?geoWKTm . yago:geoentity_Perifereiak\u00ed_En\u00f3tita_Kentriko\u00fa_Tom\u00e9a_Athin\u00f3n_8200482 geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geomP . ?geomP geo:asWKT ?geoWKTP FILTER geof:sfWithin(?geoWKTm, ?geoWKT1) FILTER geof:sfIntersects(?geoWKTP, ?geoWKTm) } "
    },
    {
        "question": "Which forests are in a radius of 10km from Lincolnshire.",
        "sparql": " SELECT DISTINCT ?x WHERE { ?x rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT . yago:Lincolnshire geo:hasGeometry ?o1 . ?o1 geo:asWKT ?iWKT FILTER ( geof:distance(?xWKT, ?iWKT, uom:metre) <= 10000 ) } "
    },
    {
        "question": "How large is the largest county in Ireland?",
        "sparql": " SELECT DISTINCT (MAX(?area) AS ?maxArea) WHERE { { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } ?county geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:Republic_of_Ireland geo:hasGeometry ?irlG . ?irlG geo:asWKT ?irlWKT FILTER geof:sfWithin(?geoWKT, ?irlWKT) BIND(strdf:area(?geoWKT) AS ?area) } "
    },
    {
        "question": "Which country contains Clondalkin?",
        "sparql": " SELECT DISTINCT ?region WHERE { yago:Clondalkin geo:hasGeometry ?iGeom . ?iGeom geo:asWKT ?iWKT . ?region rdf:type y2geoo:GADM_1stOrder_AdministrativeUnit ; geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT FILTER geof:sfContains(?xWKT, ?iWKT) } "
    },
    {
        "question": "Where is Coventry located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Coventry geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Where is Kifisia located?",
        "sparql": " SELECT ?wkt WHERE { yago:geoentity_Dimos_Kifisia_8133694 geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?wkt } "
    },
    {
        "question": "How many nature reserves intersect with forests?",
        "sparql": " SELECT (COUNT(DISTINCT ?nature_reserve) AS ?nature_reserves) WHERE { ?nature_reserve rdf:type y2geoo:OSM_nature_reserve ; geo:hasGeometry ?nature_reserve_geo . ?nature_reserve_geo geo:asWKT ?nature_reserve_geoWKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?forest_geo . ?forest_geo geo:asWKT ?forest_geoWKT FILTER geof:sfIntersects(?forest_geoWKT, ?nature_reserve_geoWKT) } "
    },
    {
        "question": "Does Attica have more lakes than Crete?",
        "sparql": " ASK WHERE { { SELECT (COUNT(DISTINCT ?lake1) AS ?atticaLakes) WHERE { ?lake1 rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lgeom1 . ?lgeom1 geo:asWKT ?lwkt1 . <http://yago-knowledge.org/resource/Attica_(region)> geo:hasGeometry ?ogeom1 . ?ogeom1 geo:asWKT ?owkt1 FILTER geof:sfWithin(?lwkt1, ?owkt1) } } { SELECT (COUNT(DISTINCT ?lake2) AS ?creteLakes) WHERE { ?lake2 rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lgeom2 . ?lgeom2 geo:asWKT ?lwkt2 . yago:Crete geo:hasGeometry ?ogeom2 . ?ogeom2 geo:asWKT ?owkt2 FILTER geof:sfWithin(?lwkt2, ?owkt2) } } FILTER ( ?atticaLakes > ?creteLakes ) } "
    },
    {
        "question": "Which parks are in Manchester?",
        "sparql": " SELECT DISTINCT ?park WHERE { yago:Manchester geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?lcnWKT) } "
    },
    {
        "question": "How many canals are there in the Republic of Ireland?",
        "sparql": " SELECT (COUNT(DISTINCT ?canal) AS ?numCanals) WHERE { ?canal rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?cgeo . ?cgeo geo:asWKT ?cWKT . yago:Republic_of_Ireland geo:hasGeometry ?iGeom . ?iGeom geo:asWKT ?iWKT FILTER geof:sfWithin(?cWKT, ?iWKT) } "
    },
    {
        "question": "Which villages are north of beaches, in Thessaly?",
        "sparql": " SELECT DISTINCT ?village WHERE { yago:Thessaly geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?o3 . ?o3 geo:asWKT ?geoWKT3 FILTER ( ( geof:sfWithin(?geoWKT2, ?geoWKT1) && geof:sfWithin(?geoWKT3, ?geoWKT1) ) && strdf:above(?geoWKT2, ?geoWKT3) ) } "
    },
    {
        "question": "Which streams cross counties that border County Longford?",
        "sparql": " SELECT DISTINCT ?stream WHERE { yago:County_Longford geo:hasGeometry ?lgeo . ?lgeo geo:asWKT ?lWKT { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } ?county geo:hasGeometry ?geo . ?geo geo:asWKT ?WKT . ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?sgeo . ?sgeo geo:asWKT ?sWKT FILTER geof:sfTouches(?lWKT, ?WKT) FILTER geof:sfCrosses(?WKT, ?sWKT) } "
    },
    {
        "question": "Which municipalities have lakes in Central Macedonia?",
        "sparql": " SELECT DISTINCT ?municipality WHERE { ?municipality rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?wkt2 . yago:Central_Macedonia geo:hasGeometry ?g3 . ?g3 geo:asWKT ?wkt3 FILTER ( geof:sfWithin(?wkt2, ?wkt3) && geof:sfContains(?wkt1, ?wkt2) ) } "
    },
    {
        "question": "Which barony in Ireland has the most lakes?",
        "sparql": " SELECT DISTINCT ?barony (COUNT(?lake) AS ?numberOfLakes) WHERE { ?barony rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?lcnWKT) } GROUP BY ?barony ORDER BY DESC(?numberOfLakes) LIMIT 1 "
    },
    {
        "question": "How many municipalities does Greece have?",
        "sparql": " SELECT (COUNT(DISTINCT ?muni) AS ?count) WHERE { ?muni rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?geom . ?geom geo:asWKT ?wkt . yago:Greece geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT FILTER geof:sfWithin(?wkt, ?geoWKT) } "
    },
    {
        "question": "How many beaches are there in England and what is their total area?",
        "sparql": " SELECT (COUNT(DISTINCT ?beach) AS ?numBeaches) (SUM(strdf:area(?bWKT)) AS ?totalArea) WHERE { ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?bgeo . ?bgeo geo:asWKT ?bWKT . yago:England geo:hasGeometry ?eGeom . ?eGeom geo:asWKT ?eWKT FILTER geof:sfWithin(?bWKT, ?eWKT) } "
    },
    {
        "question": "How many lakes does Scotland have?",
        "sparql": " SELECT (COUNT(?lake) AS ?numLakes) WHERE { yago:Scotland geo:hasGeometry ?geom . ?geom geo:asWKT ?mWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geol . ?geol geo:asWKT ?lWKT FILTER geof:sfContains(?mWKT, ?lWKT) } "
    },
    {
        "question": "What is the population of Piraeus?",
        "sparql": " SELECT ?population WHERE { yago:Piraeus y2geoo:hasGAG_Population ?population } "
    },
    {
        "question": "Where is Mitchelstown located?",
        "sparql": " SELECT ?geoWKT WHERE { yago:Mitchelstown geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Is Ballymoe west of Ratoath?",
        "sparql": " ASK WHERE { yago:Ballymoe geo:hasGeometry ?g1 . yago:Ratoath geo:hasGeometry ?g2 . ?g1 geo:asWKT ?w1 . ?g2 geo:asWKT ?w2 FILTER strdf:left(?w1, ?w2) } "
    },
    {
        "question": "Where is Chichester located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Chichester geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Can you provide me with the names of 4 villages located in rural areas south of Dublin?",
        "sparql": " SELECT DISTINCT ?vil WHERE { yago:Dublin geo:hasGeometry ?dblnGeo . ?dblnGeo geo:asWKT ?dblnPolygon . ?vil rdf:type y2geoo:OSM_village ; geo:hasGeometry ?vilGeo . ?vilGeo geo:asWKT ?vilPolygon . ?ra rdf:type y2geoo:OSI_Rural_Area ; geo:hasGeometry ?raGeo . ?raGeo geo:asWKT ?raPolygon FILTER ( strdf:below(?raPolygon, ?dblnPolygon) && geof:sfWithin(?vilPolygon, ?raPolygon) ) } LIMIT 4 "
    },
    {
        "question": "Is Albany north of New York city?",
        "sparql": " ASK WHERE { <http://yago-knowledge.org/resource/Albany_County,_New_York> geo:hasGeometry ?albanyGeom . ?albanyGeom geo:asWKT ?albanyWKT . yago:New_York_City geo:hasGeometry ?newYorkGeom . ?newYorkGeom geo:asWKT ?newYorkWKT FILTER strdf:above(?albanyWKT, ?newYorkWKT) } "
    },
    {
        "question": "How many lakes are inside forests?",
        "sparql": " SELECT (COUNT(DISTINCT ?lake) AS ?lakes) WHERE { ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?forestGeom . ?forestGeom geo:asWKT ?forestWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lakeGeom . ?lakeGeom geo:asWKT ?lakeWKT FILTER geof:sfWithin(?lakeWKT, ?forestWKT) } "
    },
    {
        "question": "What is the location of Selby District?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Selby_District geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which towns have lakes in the Kilmacrenan barony?",
        "sparql": " SELECT DISTINCT ?town WHERE { yago:geoentity_Kilmacrenan_2963284 geo:hasGeometry ?o1 . ?o1 geo:asWKT ?baronyWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?lakeWKT . ?town rdf:type y2geoo:OSI_Townland ; geo:hasGeometry ?o3 . ?o3 geo:asWKT ?townWKT FILTER geof:sfWithin(?townWKT, ?baronyWKT) FILTER geof:sfWithin(?lakeWKT, ?townWKT) } "
    },
    {
        "question": "What is the 10th largest town in Alaska?",
        "sparql": " SELECT ?town WHERE { { SELECT DISTINCT ?town (strdf:area(?lWKT) AS ?area) WHERE { yago:Alaska geo:hasGeometry ?geom . ?geom geo:asWKT ?mWKT . ?town rdf:type y2geoo:OSM_town ; geo:hasGeometry ?geol . ?geol geo:asWKT ?lWKT FILTER geof:sfContains(?mWKT, ?lWKT) } ORDER BY DESC(?area) LIMIT 10 } } ORDER BY ASC(?area) LIMIT 1 "
    },
    {
        "question": "Which is the largest Greek region?",
        "sparql": " SELECT DISTINCT ?region (strdf:area(?geoWKT) AS ?regionArea) WHERE { ?region rdf:type y2geoo:GAG_Region ; geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } ORDER BY DESC(?regionArea) LIMIT 1 "
    },
    {
        "question": "What is the area of each forest in the Scarawalsh Barony?",
        "sparql": " SELECT ?forest (strdf:area(?forestWKT) AS ?forestArea) WHERE { yago:geoentity_Scarawalsh_Bridge_3304299 geo:hasGeometry ?o1 . ?o1 geo:asWKT ?baronyWKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?o3 . ?o3 geo:asWKT ?forestWKT FILTER geof:sfWithin(?forestWKT, ?baronyWKT) } "
    },
    {
        "question": "Does Kallithea share a border with Nea Smyrni?",
        "sparql": " ASK WHERE { yago:Kallithea geo:hasGeometry ?ko . ?ko geo:asWKT ?kWKT . yago:Nea_Smyrni geo:hasGeometry ?no . ?ko geo:asWKT ?nWKT FILTER geof:sfTouches(?kWKT, ?nWKT) } "
    },
    {
        "question": "Is Agia Paraskevi west of Chalandri?",
        "sparql": " ASK WHERE { yago:Agia_Paraskevi geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . yago:Chalandri geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER strdf:left(?geoWKT1, ?geoWKT2) } "
    },
    {
        "question": "How many parks contain streams?",
        "sparql": " SELECT (COUNT(DISTINCT ?park) AS ?parks) WHERE { ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?parkGeometry . ?parkGeometry geo:asWKT ?parkWKT . ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?streamGeometry . ?streamGeometry geo:asWKT ?streamWKT FILTER geof:sfContains(?parkWKT, ?streamWKT) } "
    },
    {
        "question": "Which lakes are in Cambridge?",
        "sparql": " SELECT DISTINCT ?lake WHERE { yago:Cambridge geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?geoWKT2 FILTER geof:sfContains(?geoWKT, ?geoWKT2) } "
    },
    {
        "question": "How many municipalities have at least one beach?",
        "sparql": " SELECT (COUNT(DISTINCT ?municipality) AS ?muns) WHERE { ?municipality rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?lcnWKT) } "
    },
    {
        "question": "How many parks have lakes running through them?",
        "sparql": " SELECT (COUNT(DISTINCT ?lake) AS ?lakes) WHERE { ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?geoWKT2 FILTER geof:sfCrosses(?geoWKT, ?geoWKT2) } "
    },
    {
        "question": "How close is Dublin to Scotland?",
        "sparql": " SELECT (geof:distance(?dWKT, ?sWKT, uom:metre) AS ?distance) WHERE { yago:Dublin geo:hasGeometry ?dGeom . ?dGeom geo:asWKT ?dWKT . yago:Scotland geo:hasGeometry ?sGeom . ?sGeom geo:asWKT ?sWKT } "
    },
    {
        "question": "Is Thessaly south of Attica?",
        "sparql": " ASK WHERE { yago:Thessaly geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . <http://yago-knowledge.org/resource/Attica_(region)> geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER strdf:below(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "What is the total area of the United Kingdom?",
        "sparql": " SELECT (strdf:area(?cwkt) AS ?area) WHERE { yago:United_Kingdom geo:hasGeometry ?cgeom . ?cgeom geo:asWKT ?cwkt } "
    },
    {
        "question": "What's the location of Birmingham?",
        "sparql": " SELECT ?wkt WHERE { yago:Birmingham geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?wkt } "
    },
    {
        "question": "How many Greek municipalities contain at least one forest?",
        "sparql": " SELECT (COUNT(DISTINCT ?M) AS ?muns) WHERE { ?M rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?MGeo . ?MGeo geo:asWKT ?MPolygon . ?Forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?ForestGeo . ?ForestGeo geo:asWKT ?ForestPolygon . yago:Greece geo:hasGeometry ?o2 . ?o2 geo:asWKT ?iWKT FILTER geof:sfWithin(?MPolygon, ?iWKT) FILTER geof:sfWithin(?ForestPolygon, ?MPolygon) } "
    },
    {
        "question": "Is Ierapetra close to Athens?",
        "sparql": " ASK WHERE { yago:Ierapetra geo:hasGeometry ?xgeo . ?xgeo geo:asWKT ?xWKT . yago:geoentity_Dimos_Athens_8133876 geo:hasGeometry ?ygeo . ?ygeo geo:asWKT ?yWKT FILTER ( geof:distance(?xWKT, ?yWKT, uom:metre) < 5000 ) } "
    },
    {
        "question": "How many cities are adjacent to lakes?",
        "sparql": " SELECT (COUNT(DISTINCT ?county) AS ?cities) WHERE { ?county rdf:type y2geoo:OSM_city ; geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER geof:sfTouches(?lcnWKT, ?lWKT) } "
    },
    {
        "question": "Are there any rivers connected with lake Lough Corrib?",
        "sparql": " ASK WHERE { ?river rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?rgeom . ?rgeom geo:asWKT ?rwkt . yago:Lough_Corrib geo:hasGeometry ?lgeom . ?lgeom geo:asWKT ?lwkt FILTER geof:sfIntersects(?rwkt, ?lwkt) } "
    },
    {
        "question": "Is Sfakia located north of Peristeri?",
        "sparql": " ASK WHERE { yago:Sfakia geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT . yago:Peristeri geo:hasGeometry ?g2 . ?g2 geo:asWKT ?geoWKT2 FILTER strdf:above(?geoWKT, ?geoWKT2) } "
    },
    {
        "question": "Which are the two biggest baronies that intersect with Dublin?",
        "sparql": " SELECT ?barony WHERE { yago:Dublin geo:hasGeometry ?o . ?o geo:asWKT ?WKT . ?barony rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?WKT1 FILTER geof:sfIntersects(?WKT1, ?WKT) } ORDER BY DESC(strdf:area(?WKT1)) LIMIT 2 "
    },
    {
        "question": "Which regional unit in the region of Epirus has a lake?",
        "sparql": " SELECT DISTINCT ?city WHERE { <http://yago-knowledge.org/resource/Epirus_(region)> geo:hasGeometry ?o . ?o geo:asWKT ?A . ?city rdf:type y2geoo:GAG_RegionalUnit ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?C . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geomB . ?geomB geo:asWKT ?B FILTER ( geof:sfWithin(?B, ?A) && geof:sfWithin(?B, ?C) ) } "
    },
    {
        "question": "Where is Kalamata located?",
        "sparql": " SELECT ?geoWKT WHERE { yago:geoentity_Dimos_Kalamata_8133971 geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT } "
    },
    {
        "question": "Is Belfast south of Dublin?",
        "sparql": " ASK WHERE { yago:Belfast geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:Dublin geo:hasGeometry ?o1 ; rdf:type ?type . ?o1 geo:asWKT ?geoWKT1 FILTER strdf:below(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Is Delta a municipality within the Thessaloniki regional unit?",
        "sparql": " ASK WHERE { y2geor:gagentity_202 geo:hasGeometry ?gx . ?gx geo:asWKT ?xWKT . <http://yago-knowledge.org/resource/Delta,_Thessaloniki> geo:hasGeometry ?gy . ?gy geo:asWKT ?yWKT FILTER geof:sfWithin(?yWKT, ?xWKT) } "
    },
    {
        "question": "Is Scotland's capital also its largest city?",
        "sparql": " ASK WHERE { yago:Scotland yago:hasCapital ?capital . ?capital geo:hasGeometry ?cgeo . ?cgeo geo:asWKT ?cWKT . ?capital y2geoo:hasGADM_NationalLevel ?cnl . ?city y2geoo:hasGADM_NationalLevel ?cnl ; geo:hasGeometry ?citygeo . ?citygeo geo:asWKT ?cityWKT . yago:Scotland geo:hasGeometry ?sgeo . ?sgeo geo:asWKT ?sWKT FILTER strdf:contains(?sWKT, ?cityWKT) BIND(strdf:area(?cWKT) AS ?capitalArea) BIND(strdf:area(?cityWKT) AS ?cityArea) FILTER ( ?cityArea > ?capitalArea ) } "
    },
    {
        "question": "Is Sfakia in Greece?",
        "sparql": " ASK WHERE { yago:Sfakia geo:hasGeometry ?o . ?o geo:asWKT ?pWKT . yago:Greece geo:hasGeometry ?o1 . ?o1 geo:asWKT ?sWKT FILTER geof:sfWithin(?pWKT, ?sWKT) } "
    },
    {
        "question": "Is Scotland north of Dublin?",
        "sparql": " ASK WHERE { yago:Dublin geo:hasGeometry ?geomDub . ?geomDub geo:asWKT ?wktDub . yago:Scotland geo:hasGeometry ?geomSco . ?geomSco geo:asWKT ?wktSco FILTER strdf:above(?wktSco, ?wktDub) } "
    },
    {
        "question": "Is Manchester part of the Northwestern European region?",
        "sparql": " ASK WHERE { yago:Manchester geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . y2geor:osentity_North_West_Euro_Region_41431 geo:hasGeometry ?o1 ; rdf:type ?type . ?o1 geo:asWKT ?geoWKT1 FILTER geof:sfWithin(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "How many islands does the UK have?",
        "sparql": " SELECT (COUNT(?island) AS ?islands) WHERE { yago:United_Kingdom geo:hasGeometry ?ukGeo . ?ukGeo geo:asWKT ?ukWKT . ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?iGeo . ?iGeo geo:asWKT ?iWKT FILTER geof:sfWithin(?iWKT, ?ukWKT) } "
    },
    {
        "question": "What is the total area of County Galway?",
        "sparql": " SELECT (strdf:area(?WKT) AS ?area) WHERE { yago:County_Galway geo:hasGeometry ?o . ?o geo:asWKT ?WKT } "
    },
    {
        "question": "Which region that borders Thessaly has the largest population ?",
        "sparql": " SELECT DISTINCT ?rg ?pop WHERE { yago:Thessaly geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tWKT . ?rg rdf:type y2geoo:GAG_Region ; geo:hasGeometry ?rggeo . ?rggeo geo:asWKT ?rgWKT . ?rg y2geoo:hasGAG_Population ?pop FILTER geof:sfTouches(?rgWKT, ?tWKT) } ORDER BY DESC(?pop) LIMIT 1 "
    },
    {
        "question": "Which 3rd order administrative units border Hampshire?",
        "sparql": " SELECT DISTINCT ?city WHERE { yago:Hampshire geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?city rdf:type y2geoo:GADM_3rdOrder_AdministrativeUnit ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?cWKT FILTER geof:sfTouches(?geoWKT, ?cWKT) } "
    },
    {
        "question": "Which metropolitan districts border Manchester ?",
        "sparql": " SELECT DISTINCT ?Mdistrict WHERE { yago:Manchester geo:hasGeometry ?egeo . ?egeo geo:asWKT ?eWKT . ?Mdistrict rdf:type y2geoo:OS_MetropolitanDistrict ; geo:hasGeometry ?cgeo . ?cgeo geo:asWKT ?cWKT FILTER geof:sfTouches(?eWKT, ?cWKT) } "
    },
    {
        "question": "Which 2nd Order Administrative Units border Dublin ?",
        "sparql": " SELECT DISTINCT ?adm WHERE { y2geor:gadmentity_Dublin_IRL.6_1 geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT . ?adm rdf:type y2geoo:GADM_2ndOrder_AdministrativeUnit ; geo:hasGeometry ?yGeom . ?yGeom geo:asWKT ?yWKT FILTER geof:sfTouches(?xWKT, ?yWKT) } "
    },
    {
        "question": "How many greek regions have a beach?",
        "sparql": " SELECT (COUNT(DISTINCT ?region) AS ?regions) WHERE { ?region rdf:type y2geoo:GAG_Region ; geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?WRT1 . ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?WRT2 FILTER geof:sfWithin(?WRT2, ?WRT1) } "
    },
    {
        "question": "Which island of Greece has the most beaches?",
        "sparql": " SELECT DISTINCT ?island WHERE { yago:Greece geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER ( geof:sfWithin(?geoWKT1, ?geoWKT) && geof:sfWithin(?geoWKT2, ?geoWKT1) ) } GROUP BY ?island ORDER BY DESC(COUNT(?beach)) LIMIT 1 "
    },
    {
        "question": "Which bays are east of a reservoir in Greece?",
        "sparql": " SELECT DISTINCT ?bay WHERE { yago:Greece geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?WKT1 . ?reservoir rdf:type y2geoo:OSM_reservoir ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?WKT2 FILTER geof:sfWithin(?WKT2, ?WKT1) ?bay rdf:type y2geoo:OSM_bay ; geo:hasGeometry ?rep3 . ?rep3 geo:asWKT ?WKT3 FILTER strdf:right(?WKT3, ?WKT2) } "
    },
    {
        "question": "Is Kallithea located on the border of Nea Smyrni?",
        "sparql": " ASK WHERE { yago:Kallithea geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:Nea_Smyrni geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER geof:sfTouches(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Which states does Lake Michigan intersect?",
        "sparql": " SELECT ?state WHERE { yago:United_States geo:hasGeometry ?usGeo . ?usGeo geo:asWKT ?usWKT . ?state rdf:type y2geoo:GADM_2ndOrder_AdministrativeUnit ; geo:hasGeometry ?sGeo . ?sGeo geo:asWKT ?sWKT FILTER geof:sfContains(?usWKT, ?sWKT) yago:Lake_Michigan geo:hasGeometry ?laGeom . ?laGeom geo:asWKT ?laWKT FILTER geof:sfIntersects(?sWKT, ?laWKT) } "
    },
    {
        "question": "Which are the 5 smallest district wards that are north of Liverpool?",
        "sparql": " SELECT ?District_Ward WHERE { yago:Liverpool geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcWKT . ?District_Ward rdf:type y2geoo:OS_DistrictWard ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?cWKT FILTER strdf:below(?lcWKT, ?cWKT) } ORDER BY strdf:area(?cWKT) LIMIT 5 "
    },
    {
        "question": "What is the total area of lakes in the state of Texas?",
        "sparql": " SELECT (SUM(?lakeArea) AS ?oSum) WHERE { { SELECT (strdf:area(?lakeWKT) AS ?lakeArea) WHERE { yago:Texas geo:hasGeometry ?o1 . ?o1 geo:asWKT ?baronyWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?lakeWKT FILTER geof:sfWithin(?lakeWKT, ?baronyWKT) } } } "
    },
    {
        "question": "Is Dublin south of Belfast?",
        "sparql": " ASK WHERE { yago:Dublin geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:geoentity_City_of_Belfast_3333223 geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER strdf:below(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Which is the largest US State?",
        "sparql": " SELECT ?state (strdf:area(?sWKT) AS ?sArea) WHERE { yago:United_States geo:hasGeometry ?usGeo . ?usGeo geo:asWKT ?usWKT . ?state rdf:type y2geoo:GADM_2ndOrder_AdministrativeUnit ; geo:hasGeometry ?sGeo . ?sGeo geo:asWKT ?sWKT FILTER geof:sfWithin(?sWKT, ?usWKT) } ORDER BY DESC(?sArea) LIMIT 1 "
    },
    {
        "question": "How many islands are within a Greek region?",
        "sparql": " SELECT (COUNT(DISTINCT ?island) AS ?islands) WHERE { ?region rdf:type y2geoo:GAG_Region ; geo:hasGeometry ?o . ?o geo:asWKT ?WKT . ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?WKT1 . yago:Greece geo:hasGeometry ?o2 . ?o2 geo:asWKT ?iWKT FILTER geof:sfWithin(?WKT, ?iWKT) FILTER geof:sfWithin(?WKT1, ?WKT) } "
    },
    {
        "question": "Is there a lake inside a forest in County Wicklow?",
        "sparql": " ASK WHERE { ?x1 rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT . ?x2 rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?x2Geo . ?x2Geo geo:asWKT ?x2WKT . yago:County_Wicklow geo:hasGeometry ?x3Geo . ?x3Geo geo:asWKT ?x3WKT FILTER geof:sfWithin(?x1WKT, ?x3WKT) FILTER geof:sfWithin(?x1WKT, ?x2WKT) } "
    },
    {
        "question": "Is Belfast close to Edinburgh?",
        "sparql": " ASK WHERE { yago:geoentity_City_of_Belfast_3333223 geo:hasGeometry ?o . ?o geo:asWKT ?bWKT . yago:Edinburgh geo:hasGeometry ?o1 . ?o1 geo:asWKT ?eWKT FILTER ( geof:distance(?bWKT, ?eWKT, uom:metre) < 5000 ) } "
    },
    {
        "question": "Which forests are in England?",
        "sparql": " SELECT DISTINCT ?forest WHERE { yago:England geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?lcnWKT) } "
    },
    {
        "question": "Which municipalities contain at least one beach and one village?",
        "sparql": " SELECT DISTINCT ?M WHERE { ?M rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?MGeo . ?MGeo geo:asWKT ?MPolygon . ?Forest rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?ForestGeo . ?ForestGeo geo:asWKT ?ForestPolygon . ?x rdf:type y2geoo:OSM_village ; geo:hasGeometry ?xgeo . ?xgeo geo:asWKT ?xWKT FILTER geof:sfWithin(?ForestPolygon, ?MPolygon) FILTER geof:sfWithin(?xWKT, ?MPolygon) } "
    },
    {
        "question": "Is County Donegal north of County Wexford?",
        "sparql": " ASK WHERE { yago:County_Donegal geo:hasGeometry ?gx . ?gx geo:asWKT ?xWKT . yago:County_Wexford geo:hasGeometry ?gy . ?gy geo:asWKT ?yWKT FILTER strdf:above(?xWKT, ?yWKT) } "
    },
    {
        "question": "What is the total surface area of the Andover Ponds?",
        "sparql": " SELECT (strdf:area(?WKT) AS ?totalArea) WHERE { yago:geoentity_Andover_Ponds_5095197 geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?WKT } "
    },
    {
        "question": "Where is Crewe located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Crewe geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Is Kythira within Attica?",
        "sparql": " ASK WHERE { yago:geoentity_Kythira_8133702 geo:hasGeometry ?o . ?o geo:asWKT ?WKT . <http://yago-knowledge.org/resource/Attica_(region)> geo:hasGeometry ?o1 . ?o1 geo:asWKT ?WKT1 FILTER geof:sfWithin(?WKT, ?WKT1) } "
    },
    {
        "question": "Which is the most populated municipality in Greece?",
        "sparql": " SELECT ?m WHERE { ?m rdf:type y2geoo:GAG_Municipality ; y2geoo:hasGAG_Population ?pop } ORDER BY DESC(?pop) LIMIT 1 "
    },
    {
        "question": "Which islands are south of beaches in Naxos?",
        "sparql": " SELECT DISTINCT ?island WHERE { yago:Naxos geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT . ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?geoIsl . ?geoIsl geo:asWKT ?IslWKT FILTER ( ( geof:sfWithin(?lWKT, ?lcnWKT) && strdf:below(?IslWKT, ?lWKT) ) && ( ?island != yago:Naxos ) ) } "
    },
    {
        "question": "Which parks intersect with forests in the US?",
        "sparql": " SELECT DISTINCT ?park WHERE { yago:United_States geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geomP . ?geomP geo:asWKT ?lWKT_P . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?geomF . ?geomF geo:asWKT ?lWKT_F FILTER ( geof:sfWithin(?lWKT_F, ?lcnWKT) && geof:sfIntersects(?lWKT_P, ?lWKT_F) ) } "
    },
    {
        "question": "Where is York located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:York geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "What is the total area of Cambridgeshire?",
        "sparql": " SELECT (strdf:area(?WKT) AS ?totalArea) WHERE { yago:Cambridge geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?WKT } "
    },
    {
        "question": "Is the distance between Liverpool and Manchester approximately 40 kilometers?",
        "sparql": " ASK WHERE { yago:Manchester geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:Liverpool geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER ( geof:distance(?geoWKT, ?geoWKT1, uom:metre) < 41000 ) FILTER ( geof:distance(?geoWKT, ?geoWKT1, uom:metre) > 39000 ) } "
    },
    {
        "question": "How many English districts contain parks?",
        "sparql": " SELECT (COUNT(DISTINCT ?district) AS ?districts) WHERE { ?district rdf:type y2geoo:OS_District ; geo:hasGeometry ?o . ?o geo:asWKT ?WKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?WKT1 . yago:England geo:hasGeometry ?egeo . ?egeo geo:asWKT ?eWKT FILTER ( geof:sfContains(?WKT, ?WKT1) && geof:sfContains(?eWKT, ?WKT) ) } "
    },
    {
        "question": "Which islands don't have any lakes but have forests?",
        "sparql": " SELECT DISTINCT ?island WHERE { ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?iGeo . ?iGeo geo:asWKT ?iWKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?fGeo . ?fGeo geo:asWKT ?fWKT FILTER geof:sfWithin(?fWKT, ?iWKT) FILTER NOT EXISTS { ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lGeo . ?lGeo geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?iWKT) } } "
    },
    {
        "question": "Which forests are entirely contained in counties that are west of the county of Norfolk?",
        "sparql": " SELECT DISTINCT ?l WHERE { yago:Norfolk geo:hasGeometry ?ng . ?ng geo:asWKT ?nw . ?m rdf:type y2geoo:OS_County ; geo:hasGeometry ?mg . ?mg geo:asWKT ?mw FILTER strdf:right(?nw, ?mw) ?l rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lw FILTER geof:sfWithin(?lw, ?mw) } "
    },
    {
        "question": "What villages are within 100 km from Dublin?",
        "sparql": " SELECT DISTINCT ?village WHERE { ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 . yago:Dublin geo:hasGeometry ?g2 . ?g2 geo:asWKT ?wkt2 FILTER ( geof:distance(?wkt2, ?wkt1, uom:metre) <= 100000 ) } "
    },
    {
        "question": "Is there a village south of a forest in Wicklow?",
        "sparql": " ASK WHERE { ?x1 rdf:type y2geoo:OSM_village ; geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT . ?x2 rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?x2Geo . ?x2Geo geo:asWKT ?x2WKT . yago:County_Wicklow geo:hasGeometry ?x3Geo . ?x3Geo geo:asWKT ?x3WKT FILTER geof:sfWithin(?x1WKT, ?x3WKT) FILTER strdf:below(?x1WKT, ?x2WKT) } "
    },
    {
        "question": "Find the 10 British Counties having the most forests.",
        "sparql": " SELECT ?m (COUNT(?l) AS ?count) WHERE { ?m rdf:type y2geoo:OS_County ; geo:hasGeometry ?mg . ?mg geo:asWKT ?mw . ?l rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lw FILTER geof:sfWithin(?lw, ?mw) } GROUP BY ?m ORDER BY DESC(?count) LIMIT 10 "
    },
    {
        "question": "What is the total area of Liverpool?",
        "sparql": " SELECT DISTINCT (strdf:area(?geoWKT) AS ?totalArea) WHERE { yago:Liverpool geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which forests intersect with streams in the UK?",
        "sparql": " SELECT DISTINCT ?a WHERE { yago:United_Kingdom geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?a rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?b rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER ( ( geof:sfWithin(?geoWKT1, ?geoWKT) && geof:sfWithin(?geoWKT2, ?geoWKT) ) && geof:sfIntersects(?geoWKT1, ?geoWKT2) ) } "
    }
]