[
    {
        "question": "Does Leicester lie to the east of Birmingham?",
        "sparql": " ASK WHERE { yago:Birmingham geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . y2geor:gadmentity_Leicester_GBR.1.50.1_1 geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER strdf:left(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Is Chios east of Paxi?",
        "sparql": " ASK WHERE { yago:Chios geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . yago:Paxi geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER strdf:right(?geoWKT1, ?geoWKT2) } "
    },
    {
        "question": "How many parks contain a lagoon within them?",
        "sparql": " SELECT (COUNT(DISTINCT ?park) AS ?parks) WHERE { ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?fWKT . ?lagoon rdf:type y2geoo:OSM_lagoon ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?fWKT) } "
    },
    {
        "question": "Is Limerick close to Waterford?",
        "sparql": " ASK WHERE { y2geor:gadmentity_Limerick_IRL.13_1 geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT . y2geor:gadmentity_Waterford_IRL.23_1 geo:hasGeometry ?yGeom . ?yGeom geo:asWKT ?yWKT FILTER ( geof:distance(?xWKT, ?yWKT, uom:metre) < 5000 ) } "
    },
    {
        "question": "What is the average area of a lake in Nevada?",
        "sparql": " SELECT (AVG(?areas) AS ?areas_avg) WHERE { SELECT (strdf:area(?forest_geoWKT) AS ?areas) WHERE { yago:Nevada geo:hasGeometry ?Cork_geo . ?Cork_geo geo:asWKT ?Cork_geoWKT . ?forest rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?forest_geo . ?forest_geo geo:asWKT ?forest_geoWKT FILTER geof:sfWithin(?forest_geoWKT, ?Cork_geoWKT) } } "
    },
    {
        "question": "Where is Muckross village located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:geoentity_Muckross_Village_9884064 geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "How many counties contain at least one reservoir?",
        "sparql": " SELECT (COUNT(DISTINCT ?county) AS ?counties) WHERE { ?res rdf:type y2geoo:OSM_reservoir ; geo:hasGeometry ?vgeo . ?vgeo geo:asWKT ?vWKT { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } UNION { ?county rdf:type y2geoo:OS_County } ?county geo:hasGeometry ?mgeo . ?mgeo geo:asWKT ?mWKT FILTER geof:sfContains(?mWKT, ?vWKT) } "
    },
    {
        "question": "How much of the UK is woodland?",
        "sparql": " SELECT (( SUM(strdf:area(?fWKT)) / ?ukArea ) AS ?woodland) WHERE { yago:United_Kingdom geo:hasGeometry ?ukGeo . ?ukGeo geo:asWKT ?ukWKT BIND(strdf:area(?ukWKT) AS ?ukArea) ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?fGeo . ?fGeo geo:asWKT ?fWKT FILTER geof:sfWithin(?fWKT, ?ukWKT) } GROUP BY ?forest ?ukArea "
    },
    {
        "question": "Is Athens south of Manchester?",
        "sparql": " ASK WHERE { yago:geoentity_Dimos_Athens_8133876 geo:hasGeometry ?geo1 . ?geo1 geo:asWKT ?wkt1 . yago:Manchester geo:hasGeometry ?geo2 . ?geo2 geo:asWKT ?wkt2 FILTER strdf:below(?wkt1, ?wkt2) } "
    },
    {
        "question": "Is Plymouth near Cardiff?",
        "sparql": " ASK WHERE { yago:Plymouth geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:Cardiff geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER ( geof:distance(?geoWKT, ?geoWKT1, uom:metre) < 5000 ) } "
    },
    {
        "question": "How many residents does Western Macedonia have?",
        "sparql": " SELECT ?pop WHERE { yago:geoentity_Western_Macedonia_6697811 y2geoo:hasGAG_Population ?pop } "
    },
    {
        "question": "Where is Cork City located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:geoentity_Cork_City_7778678 geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which districts border Warwickshire?",
        "sparql": " SELECT DISTINCT ?district WHERE { yago:Warwickshire geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?district rdf:type y2geoo:OS_District ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER geof:sfTouches(?geoWKT1, ?geoWKT2) } "
    },
    {
        "question": "Is Dublin east of the municipality of Thessaloniki?",
        "sparql": " ASK WHERE { yago:Dublin geo:hasGeometry ?geo1 . ?geo1 geo:asWKT ?wkt1 . yago:geoentity_Dimos_Thessaloniki_8133841 geo:hasGeometry ?geo2 . ?geo2 geo:asWKT ?wkt2 FILTER strdf:right(?wkt1, ?wkt2) } "
    },
    {
        "question": "Where is the municipality of Chania located?",
        "sparql": " SELECT ?gWKT WHERE { yago:geoentity_Chania_8133762 geo:hasGeometry ?g . ?g geo:asWKT ?gWKT } "
    },
    {
        "question": "Which are the parks of Dublin?",
        "sparql": " SELECT DISTINCT ?park WHERE { yago:Dublin geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?lcnWKT) } "
    },
    {
        "question": "How many rivers are inside forests?",
        "sparql": " SELECT (COUNT(DISTINCT ?r) AS ?rs) WHERE { ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?forestGeom . ?forestGeom geo:asWKT ?forestWKT . ?r rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?lakeGeom . ?lakeGeom geo:asWKT ?lakeWKT FILTER geof:sfWithin(?lakeWKT, ?forestWKT) } "
    },
    {
        "question": "Is Northern Ireland the least forested country in the UK?",
        "sparql": " ASK WHERE { { SELECT (SUM(strdf:area(?fccWKT)) AS ?areaCC) WHERE { yago:United_Kingdom geo:hasGeometry ?ukGeo . ?ukGeo geo:asWKT ?ukWKT . ?constituentCountry rdf:type y2geoo:GADM_2ndOrder_AdministrativeUnit ; geo:hasGeometry ?cGeo . ?cGeo geo:asWKT ?cWKT . ?forectCC rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?fccGeo . ?fccGeo geo:asWKT ?fccWKT FILTER ( ( ( ?constituentCountry != yago:Northern_Ireland ) && geof:sfWithin(?cWKT, ?ukWKT) ) && geof:sfWithin(?fccWKT, ?cWKT) ) } } { SELECT (SUM(strdf:area(?fccWKT)) AS ?areaNI) WHERE { yago:Northern_Ireland geo:hasGeometry ?niGeo . ?niGeo geo:asWKT ?niWKT . ?forectNI rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?fniGeo . ?fniGeo geo:asWKT ?fniWKT FILTER geof:sfWithin(?fniWKT, ?niWKT) } } FILTER ( ?areaNI < ?areaCC ) } "
    },
    {
        "question": "Where is the park of Sherwood located?",
        "sparql": " SELECT DISTINCT ?wkt WHERE { yago:geoentity_Sherwood_Park_5781312 geo:hasGeometry ?geo . ?geo geo:asWKT ?wkt } "
    },
    {
        "question": "How many lakes are in townlands in Ireland?",
        "sparql": " SELECT (COUNT(DISTINCT ?lake) AS ?lakes) WHERE { yago:Republic_of_Ireland geo:hasGeometry ?irlG . ?irlG geo:asWKT ?irlWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT . ?t rdf:type y2geoo:OSI_Townland ; geo:hasGeometry ?x2Geo . ?x2Geo geo:asWKT ?x2WKT FILTER ( geof:sfWithin(?x2WKT, ?irlWKT) && geof:sfWithin(?x1WKT, ?x2WKT) ) } "
    },
    {
        "question": "Is Texas north of Kentucky?",
        "sparql": " ASK WHERE { yago:Kentucky geo:hasGeometry ?kGeom . ?kGeom geo:asWKT ?kWKT . yago:Texas geo:hasGeometry ?tGeom . ?tGeom geo:asWKT ?tWKT FILTER strdf:above(?tWKT, ?kWKT) } "
    },
    {
        "question": "How many baronies have parks inside them?",
        "sparql": " SELECT (COUNT(DISTINCT ?counties) AS ?countiesss) WHERE { ?counties rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER geof:sfWithin(?geoWKT1, ?geoWKT) } "
    },
    {
        "question": "Which districts that are located south of Staffordshire have forests?",
        "sparql": " SELECT DISTINCT ?district WHERE { yago:Staffordshire geo:hasGeometry ?Staffordshire_geo . ?Staffordshire_geo geo:asWKT ?Staffordshire_geoWKT . ?district rdf:type y2geoo:OS_District ; geo:hasGeometry ?district_geo . ?district_geo geo:asWKT ?district_geoWKT FILTER strdf:below(?district_geoWKT, ?Staffordshire_geoWKT) ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?forest_geo . ?forest_geo geo:asWKT ?forest_geoWKT FILTER geof:sfWithin(?forest_geoWKT, ?district_geoWKT) } "
    },
    {
        "question": "Which US state has no lakes?",
        "sparql": " SELECT ?state WHERE { yago:United_States geo:hasGeometry ?usGeo . ?usGeo geo:asWKT ?usWKT . ?state rdf:type y2geoo:GADM_2ndOrder_AdministrativeUnit ; geo:hasGeometry ?sGeo . ?sGeo geo:asWKT ?sWKT FILTER geof:sfWithin(?sWKT, ?usWKT) FILTER NOT EXISTS { ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lGeo . ?lGeo geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?sWKT) } } "
    },
    {
        "question": "Which Greek municipality has the biggest surface area?",
        "sparql": " SELECT DISTINCT ?region (strdf:area(?geoWKT) AS ?regionArea) WHERE { ?region rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } ORDER BY DESC(?regionArea) LIMIT 1 "
    },
    {
        "question": "Where is Selby District located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Selby_District geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "How many English counties have lakes inside them?",
        "sparql": " SELECT (COUNT(DISTINCT ?counties) AS ?countiesss) WHERE { ?county rdf:type y2geoo:OS_County . ?counties geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . yago:England geo:hasGeometry ?eGeom . ?eGeom geo:asWKT ?eWKT FILTER ( geof:sfWithin(?geoWKT, ?eWKT) && geof:sfWithin(?geoWKT1, ?geoWKT) ) } "
    },
    {
        "question": "Which 10 municipalities west of Athens have the lowest population?",
        "sparql": " SELECT DISTINCT ?municipality WHERE { yago:geoentity_Dimos_Athens_8133876 geo:hasGeometry ?o . ?o geo:asWKT ?WKT . ?municipality rdf:type y2geoo:GAG_Municipality ; y2geoo:hasGAG_Population ?population ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?WKT1 FILTER strdf:left(?WKT1, ?WKT) } ORDER BY ?population LIMIT 10 "
    },
    {
        "question": "How many parks and how many streams are there in Essex?",
        "sparql": " SELECT (COUNT(DISTINCT ?park) AS ?total_parks) (COUNT(DISTINCT ?stream) AS ?total_streams) WHERE { yago:Essex geo:hasGeometry ?o . ?o geo:asWKT ?A . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geomB . ?geomB geo:asWKT ?B . ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?C FILTER geof:sfWithin(?B, ?A) FILTER geof:sfWithin(?C, ?A) } "
    },
    {
        "question": "Which forests are entirely within an English County?",
        "sparql": " SELECT DISTINCT ?l WHERE { ?m rdf:type y2geoo:OS_County ; geo:hasGeometry ?mg . ?mg geo:asWKT ?mw . ?l rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lw . yago:England geo:hasGeometry ?o3 . ?o3 geo:asWKT ?englGeo FILTER geof:sfWithin(?mw, ?englGeo) FILTER geof:sfWithin(?lw, ?mw) } "
    },
    {
        "question": "Which county of England has the most parks?",
        "sparql": " SELECT ?county (COUNT(?park) AS ?parkCount) WHERE { yago:England geo:hasGeometry ?eGeo . ?eGeo geo:asWKT ?eWKT . ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?countyWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?parkWKT FILTER ( geof:sfWithin(?countyWKT, ?eWKT) && geof:sfWithin(?parkWKT, ?countyWKT) ) } GROUP BY ?county ORDER BY DESC(?parkCount) LIMIT 1 "
    },
    {
        "question": "What is the population of the municipality of Lemnos?",
        "sparql": " SELECT ?population WHERE { yago:Lemnos y2geoo:hasGAG_Population ?population } "
    },
    {
        "question": "Is County Cavan located on the border of County Laois?",
        "sparql": " ASK WHERE { yago:County_Cavan geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT_Cavan . yago:County_Laois geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT_Laois FILTER geof:sfTouches(?geoWKT_Cavan, ?geoWKT_Laois) } "
    },
    {
        "question": "Which regional units of the Peloponnese have more than 30.000 inhabitants?",
        "sparql": " SELECT DISTINCT ?x1 WHERE { ?x1 rdf:type y2geoo:GAG_RegionalUnit . <http://yago-knowledge.org/resource/Peloponnese_(region)> geo:hasGeometry ?aGeo . ?aGeo geo:asWKT ?A . ?x1 y2geoo:hasGAG_Population ?p ; geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT FILTER ( ?p > 30000 ) FILTER geof:sfWithin(?x1WKT, ?A) } "
    },
    {
        "question": "Which beaches are at most 100 km away from Athens?",
        "sparql": " SELECT DISTINCT ?beach WHERE { ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT . yago:geoentity_Dimos_Athens_8133876 geo:hasGeometry ?x2Geo . ?x2Geo geo:asWKT ?x2WKT FILTER ( geof:distance(?x1WKT, ?x2WKT, uom:metre) <= 100000 ) } "
    },
    {
        "question": "Which municipalities are contained in the South Athens Regional Unit?",
        "sparql": " SELECT DISTINCT ?y WHERE { yago:geoentity_Perifereiak\u00ed_En\u00f3tita_Not\u00edou_Tom\u00e9a_Athin\u00f3n_8200483 geo:hasGeometry ?gx . ?gx geo:asWKT ?xWKT . ?y rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?gy . ?gy geo:asWKT ?yWKT FILTER geof:sfContains(?xWKT, ?yWKT) } "
    },
    {
        "question": "Which villages in Birmingham are north of canals?",
        "sparql": " SELECT DISTINCT ?village WHERE { yago:Birmingham geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?prkWKT . ?canal rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?geoPrk . ?geoPrk geo:asWKT ?lWKT . ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?cWKT FILTER ( geof:sfWithin(?lWKT, ?prkWKT) && strdf:above(?cWKT, ?lWKT) ) } "
    },
    {
        "question": "Is Sfakia in Scotland?",
        "sparql": " ASK WHERE { yago:Sfakia geo:hasGeometry ?o . ?o geo:asWKT ?pWKT . yago:Scotland geo:hasGeometry ?o1 . ?o1 geo:asWKT ?sWKT FILTER geof:sfWithin(?pWKT, ?sWKT) } "
    },
    {
        "question": "How many rivers cross baronies?",
        "sparql": " SELECT (COUNT(DISTINCT ?river) AS ?rivers) WHERE { ?river rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 . ?county rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?wkt2 FILTER geof:sfCrosses(?wkt1, ?wkt2) } "
    },
    {
        "question": "How large is Trichonida?",
        "sparql": " SELECT DISTINCT (strdf:area(?geoWKT) AS ?area) WHERE { yago:Lake_Trichonida geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which counties are adjacent to the county of Meath?",
        "sparql": " SELECT DISTINCT ?county WHERE { yago:County_Meath geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } ?county geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER geof:sfTouches(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Which municipality on the border of Wester Macedonia has the smallest population?",
        "sparql": " SELECT DISTINCT ?rg ?pop WHERE { yago:geoentity_Western_Macedonia_6697811 geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tWKT . ?rg rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?rggeo . ?rggeo geo:asWKT ?rgWKT . ?rg y2geoo:hasGAG_Population ?pop FILTER geof:sfTouches(?rgWKT, ?tWKT) } ORDER BY ASC(?pop) LIMIT 1 "
    },
    {
        "question": "Give me 10 nature reserves that are west of townlands.",
        "sparql": " SELECT DISTINCT ?nr WHERE { ?nr rdf:type y2geoo:OSM_nature_reserve ; geo:hasGeometry ?nrGeo . ?nrGeo geo:asWKT ?nrWKt . ?townland rdf:type y2geoo:OSI_Townland ; geo:hasGeometry ?TownlandGeo . ?TownlandGeo geo:asWKT ?TownlandWKt FILTER strdf:left(?nrWKt, ?TownlandWKt) } LIMIT 10 "
    },
    {
        "question": "Which Greek municipalities have beaches?",
        "sparql": " SELECT DISTINCT ?municipality WHERE { ?municipality rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?munWKT . ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?beachWKT . yago:Greece geo:hasGeometry ?grgeo . ?grgeo geo:asWKT ?grWKT FILTER ( geof:sfWithin(?beachWKT, ?munWKT) && geof:sfWithin(?munWKT, ?grWKT) ) } "
    },
    {
        "question": "Does Texas have more counties than Alabama?",
        "sparql": " ASK WHERE { { SELECT (COUNT(?texanCounty) AS ?texanCounties) WHERE { yago:Texas geo:hasGeometry ?tGeo . ?tGeo geo:asWKT ?tWKT . ?texanCounty rdf:type y2geoo:GADM_3rdOrder_AdministrativeUnit ; geo:hasGeometry ?tcGeo . ?tcGeo geo:asWKT ?tcWKT FILTER geof:sfWithin(?tcWKT, ?tWKT) } } { SELECT (COUNT(?alabamaCounty) AS ?alabamaCounties) WHERE { yago:Alabama geo:hasGeometry ?aGeo . ?aGeo geo:asWKT ?aWKT . ?alabamaCounty rdf:type y2geoo:GADM_3rdOrder_AdministrativeUnit ; geo:hasGeometry ?acGeo . ?acGeo geo:asWKT ?acWKT FILTER geof:sfWithin(?acWKT, ?aWKT) } } FILTER ( ?texanCounties > ?alabamaCounties ) } "
    },
    {
        "question": "Which are the cities north of Dublin?",
        "sparql": " SELECT DISTINCT ?citiesAbove WHERE { yago:Dublin geo:hasGeometry ?dublinGeometry . ?dublinGeometry geo:asWKT ?wktDublin . ?citiesAbove rdf:type y2geoo:OSM_city ; geo:hasGeometry ?citiesAboveGeometry . ?citiesAboveGeometry geo:asWKT ?wktCitiesAbove FILTER strdf:above(?wktCitiesAbove, ?wktDublin) } "
    },
    {
        "question": "Where is Lough Derg located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { <http://yago-knowledge.org/resource/Lough_Derg_(Shannon)> geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Out of all lakes in England, which is the smallest?",
        "sparql": " SELECT DISTINCT ?forest (strdf:area(?bWKT) AS ?totalArea) WHERE { ?forest rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?bGeom . ?bGeom geo:asWKT ?bWKT . yago:England geo:hasGeometry ?lcGeom . ?lcGeom geo:asWKT ?lcWKT FILTER geof:sfWithin(?bWKT, ?lcWKT) } ORDER BY ASC(?totalArea) LIMIT 1 "
    },
    {
        "question": "Is the largest US State larger than England?",
        "sparql": " ASK WHERE { { SELECT ?area WHERE { ?state rdf:type yago:wikicategory_States_of_the_United_States ; yago:hasArea ?area } ORDER BY DESC(?area) LIMIT 1 } yago:England yago:hasArea ?enarea FILTER ( ?area > ?enarea ) } "
    },
    {
        "question": "Which are the 3 most populated municipalities of Crete?",
        "sparql": " SELECT DISTINCT ?Dimos WHERE { yago:Crete geo:hasGeometry ?CreteGeo . ?CreteGeo geo:asWKT ?CreteWKT . ?Dimos rdf:type y2geoo:GAG_Municipality ; y2geoo:hasGAG_Population ?pop ; geo:hasGeometry ?DimosGeo . ?DimosGeo geo:asWKT ?DimosWKT FILTER geof:sfWithin(?DimosWKT, ?CreteWKT) } ORDER BY DESC(?pop) LIMIT 3 "
    },
    {
        "question": "How many villages are right next to cities?",
        "sparql": " SELECT (COUNT(DISTINCT ?village) AS ?villages) WHERE { ?City rdf:type y2geoo:OSM_city ; geo:hasGeometry ?CityGeo . ?CityGeo geo:asWKT ?CityPolygon . ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?villageGeo . ?villageGeo geo:asWKT ?villagePolygon FILTER geof:sfTouches(?villagePolygon, ?CityPolygon) } "
    },
    {
        "question": "Is the city of Cork located to the south of the city of Galway?",
        "sparql": " ASK WHERE { yago:geoentity_Cork_City_7778678 geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:geoentity_Galway_City_7778676 geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER strdf:below(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "What is the smallest forest area that intersects with Essex?",
        "sparql": " SELECT ?forest (strdf:area(?WKT1) AS ?area1) WHERE { yago:Essex geo:hasGeometry ?o . ?o geo:asWKT ?WKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?WKT1 FILTER geof:sfIntersects(?WKT1, ?WKT) } ORDER BY ?area1 LIMIT 1 "
    },
    {
        "question": "How large is Newport?",
        "sparql": " SELECT (strdf:area(?geoWKT) AS ?area) WHERE { yago:geoentity_Newport_3333246 geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which county in the British Isles is the smallest by area ?",
        "sparql": " SELECT DISTINCT ?county (strdf:area(?cWKT) AS ?totalArea) WHERE { { ?county rdf:type y2geoo:OS_County } UNION { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } ?county geo:hasGeometry ?geoC . ?geoC geo:asWKT ?cWKT } ORDER BY ?totalArea LIMIT 1 "
    },
    {
        "question": "Is there a village in Scotland with an area smaller than 0.05 square kilometers?",
        "sparql": " ASK WHERE { ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?vg . ?vg geo:asWKT ?vgeoWKT . yago:Scotland geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT FILTER strdf:within(?vgeoWKT, ?geoWKT) FILTER ( strdf:area(?vgeoWKT) < 0.05 ) } "
    },
    {
        "question": "Which is the largest uninhabited island?",
        "sparql": " SELECT ?island WHERE { SELECT ?island (strdf:area(?iWKT) AS ?iArea) WHERE { ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?iGeo . ?iGeo geo:asWKT ?iWKT OPTIONAL { ?island yago:hasPopulation ?pop } FILTER ( ! bound(?pop) ) } } ORDER BY DESC(?iArea) LIMIT 1 "
    },
    {
        "question": "Do Kallithea and Nea Smyrni share a border?",
        "sparql": " ASK WHERE { yago:Kallithea geo:hasGeometry ?ko . ?ko geo:asWKT ?kWKT . yago:Nea_Smyrni geo:hasGeometry ?no . ?ko geo:asWKT ?nWKT FILTER geof:sfTouches(?kWKT, ?nWKT) } "
    },
    {
        "question": "What is the location of the county of Cambridge?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Cambridge geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Is Denbighshire located in Wales?",
        "sparql": " ASK WHERE { yago:Denbighshire geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:Wales geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER geof:sfWithin(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Are there any parks in Worcestershire County?",
        "sparql": " ASK WHERE { yago:Worcestershire geo:hasGeometry ?o1 . ?o1 geo:asWKT ?countyGeo . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?parkGeo FILTER geof:sfWithin(?parkGeo, ?countyGeo) } "
    },
    {
        "question": "How many nature reserves are located in cities?",
        "sparql": " SELECT (COUNT(DISTINCT ?nature_reserve) AS ?nature_reserves) WHERE { ?nature_reserve rdf:type y2geoo:OSM_nature_reserve ; geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT . ?c rdf:type y2geoo:OSM_city ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?geoWKT2 FILTER geof:sfWithin(?geoWKT, ?geoWKT2) } "
    },
    {
        "question": "How many villages are on islands?",
        "sparql": " SELECT (COUNT(DISTINCT ?p1) AS ?villages) WHERE { ?p1 rdf:type y2geoo:OSM_village ; geo:hasGeometry ?p1geo . ?p1geo geo:asWKT ?p1WKT . ?p2 rdf:type y2geoo:OSM_island ; geo:hasGeometry ?p2geo . ?p2geo geo:asWKT ?p2WKT FILTER geof:sfWithin(?p1WKT, ?p2WKT) } "
    },
    {
        "question": "What is the national level of Plymouth?",
        "sparql": " SELECT ?nationalLevel WHERE { yago:Plymouth y2geoo:hasGADM_NationalLevel ?nationalLevel } "
    },
    {
        "question": "What is the number of forests that intersect with lakes?",
        "sparql": " SELECT (COUNT(DISTINCT ?townland) AS ?forests) WHERE { ?townland rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?o . ?o geo:asWKT ?WKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?WKT1 FILTER geof:sfIntersects(?WKT, ?WKT1) } "
    },
    {
        "question": "Which county has the most townlands in Ireland?",
        "sparql": " SELECT DISTINCT ?county (COUNT(?town) AS ?num) WHERE { { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } ?town rdf:type y2geoo:OSI_Townland . ?county geo:hasGeometry ?geoc . ?geoc geo:asWKT ?cWKT . ?town geo:hasGeometry ?geot . ?geot geo:asWKT ?tWKT . yago:Republic_of_Ireland geo:hasGeometry ?irlG . ?irlG geo:asWKT ?irlWKT FILTER ( geof:sfWithin(?tWKT, ?irlWKT) && geof:sfWithin(?tWKT, ?cWKT) ) } GROUP BY ?county ORDER BY DESC(?num) LIMIT 1 "
    },
    {
        "question": "Which localities are in towns that intersect with County Roscommon?",
        "sparql": " SELECT DISTINCT ?locality WHERE { yago:County_Roscommon geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?WKT1 . ?town rdf:type y2geoo:OSM_town ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?WKT2 FILTER geof:sfIntersects(?WKT2, ?WKT1) ?locality rdf:type y2geoo:OSM_locality ; geo:hasGeometry ?rep3 . ?rep3 geo:asWKT ?WKT3 FILTER geof:sfWithin(?WKT3, ?WKT2) } "
    },
    {
        "question": "Which 5 municipalities in Central Macedonia have the smallest population?",
        "sparql": " SELECT DISTINCT ?municipality WHERE { yago:Central_Macedonia geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?WKT1 . ?municipality rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?WKT2 FILTER geof:sfWithin(?WKT2, ?WKT1) ?municipality y2geoo:hasGAG_Population ?population } ORDER BY ASC(?population) LIMIT 5 "
    },
    {
        "question": "Which is the closest forest to Manchester",
        "sparql": " SELECT ?x WHERE { ?x rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT . yago:Manchester geo:hasGeometry ?o1 . ?o1 geo:asWKT ?iWKT } ORDER BY geof:distance(?xWKT, ?iWKT, uom:metre) LIMIT 1 "
    },
    {
        "question": "How many villages border towns?",
        "sparql": " SELECT (COUNT(DISTINCT ?village) AS ?villages) WHERE { ?town rdf:type y2geoo:OSM_town ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER geof:sfTouches(?geoWKT1, ?geoWKT2) } "
    },
    {
        "question": "What's the location of Cardiff?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Cardiff geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Where is Luton located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Luton geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "What is the total area of town Ballinasloe?",
        "sparql": " SELECT DISTINCT (strdf:area(?geoWKT) AS ?totalArea) WHERE { yago:Ballinasloe geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Which is the largest lake in Northern Ireland?",
        "sparql": " SELECT ?county (strdf:area(?lWKT) AS ?lArea) WHERE { yago:Northern_Ireland geo:hasGeometry ?iGeo . ?iGeo geo:asWKT ?iWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lGeo . ?lGeo geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?iWKT) } ORDER BY DESC(?lArea) LIMIT 1 "
    },
    {
        "question": "Is Elafonisos farther west than Galatsi?",
        "sparql": " ASK WHERE { yago:Elafonisos geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:Galatsi geo:hasGeometry ?o1 ; rdf:type ?type . ?o1 geo:asWKT ?geoWKT1 FILTER strdf:left(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "What is the average number of beaches located in the municipalities to the west of Pyrgos in the Elis region?",
        "sparql": " SELECT ?reg_unit (AVG(?no_of_beaches) AS ?avg_no_of_beaches) WHERE { <http://yago-knowledge.org/resource/Pyrgos,_Elis> geo:hasGeometry ?pirgos_geo . ?pirgos_geo geo:asWKT ?pirgos_geoWKT . ?reg_unit rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?reg_unitgeo . ?reg_unitgeo geo:asWKT ?reg_unitgeoWKT FILTER strdf:left(?reg_unitgeoWKT, ?pirgos_geoWKT) ?locality rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?locality_geo . ?locality_geo geo:asWKT ?locality_geoWKT FILTER geof:sfWithin(?locality_geoWKT, ?reg_unitgeoWKT) } GROUP BY ?reg_unit "
    },
    {
        "question": "Are Thessaly and Western Macedonia neighboring regions?",
        "sparql": " ASK WHERE { yago:geoentity_Western_Macedonia_6697811 geo:hasGeometry ?WestMakGeo . ?WestMakGeo geo:asWKT ?WestMakPolygon . yago:Thessaly geo:hasGeometry ?ThessGeo . ?ThessGeo geo:asWKT ?ThessPolygon FILTER geof:sfTouches(?WestMakPolygon, ?ThessPolygon) } "
    },
    {
        "question": "Is Athens south of Oxford?",
        "sparql": " ASK WHERE { yago:geoentity_Dimos_Athens_8133876 geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:Oxford geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER strdf:below(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Which townlands border with Dublin?",
        "sparql": " SELECT DISTINCT ?townland WHERE { yago:Dublin geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?WKT1 . ?townland rdf:type y2geoo:OSI_Townland ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?WKT2 FILTER geof:sfTouches(?WKT2, ?WKT1) } "
    },
    {
        "question": "Is the distance between Dublin and Arklow greater than 10km?",
        "sparql": " ASK WHERE { yago:Dublin geo:hasGeometry ?DublnGeo . ?DublnGeo geo:asWKT ?DublnPolygon . yago:Arklow geo:hasGeometry ?Geo . ?Geo geo:asWKT ?Polygon FILTER ( geof:distance(?DublnPolygon, ?Polygon, uom:metre) > 10000 ) } "
    },
    {
        "question": "Is Doolin to the south of Dublin?",
        "sparql": " ASK WHERE { yago:Doolin geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:Dublin geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER strdf:below(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Which English county has the most forests?",
        "sparql": " SELECT ?county WHERE { yago:England geo:hasGeometry ?eGeo . ?eGeo geo:asWKT ?eWKT . ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?cGeo . ?cGeo geo:asWKT ?cWKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?fGeo . ?fGeo geo:asWKT ?fWKT FILTER ( geof:sfWithin(?cWKT, ?eWKT) && geof:sfWithin(?fWKT, ?cWKT) ) } GROUP BY ?county ORDER BY DESC(COUNT(?forest)) LIMIT 1 "
    },
    {
        "question": "Which is the largest lake by area in Ireland?",
        "sparql": " SELECT DISTINCT ?lake (strdf:area(?fWKT) AS ?totalArea) WHERE { ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?fGeom . ?fGeom geo:asWKT ?fWKT . yago:Republic_of_Ireland geo:hasGeometry ?lcGeom . ?lcGeom geo:asWKT ?lcWKT FILTER geof:sfWithin(?fWKT, ?lcWKT) } ORDER BY DESC(?totalArea) LIMIT 1 "
    },
    {
        "question": "What is the maximum area among lakes located in County Cavan?",
        "sparql": " SELECT DISTINCT (MAX(strdf:area(?geoWKT2)) AS ?maxLakeArea) WHERE { yago:County_Cavan geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER geof:sfWithin(?geoWKT2, ?geoWKT1) } "
    },
    {
        "question": "Which US states border with Texas?",
        "sparql": " SELECT ?state WHERE { yago:United_States geo:hasGeometry ?usGeo . ?usGeo geo:asWKT ?usWKT . yago:Texas geo:hasGeometry ?mGeo . ?mGeo geo:asWKT ?mWKT . ?state rdf:type y2geoo:GADM_2ndOrder_AdministrativeUnit ; geo:hasGeometry ?sGeo . ?sGeo geo:asWKT ?sWKT FILTER ( geof:sfWithin(?sWKT, ?usWKT) && geof:sfTouches(?sWKT, ?mWKT) ) } "
    },
    {
        "question": "Where is Oxford located?",
        "sparql": " SELECT ?gWKT WHERE { yago:Oxford geo:hasGeometry ?g . ?g geo:asWKT ?gWKT } "
    },
    {
        "question": "Which baronies border Ardee?",
        "sparql": " SELECT DISTINCT ?barony WHERE { yago:Ardee geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcWKT . ?barony rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?cWKT FILTER geof:sfTouches(?lcWKT, ?cWKT) } "
    },
    {
        "question": "Is Lesbos west of Chania?",
        "sparql": " ASK WHERE { yago:Lesbos geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:geoentity_Chania_8133762 geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER strdf:left(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "What is the total area of city of Dundee?",
        "sparql": " SELECT DISTINCT (strdf:area(?geoWKT) AS ?totalArea) WHERE { yago:geoentity_Dundee_City_3333225 geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "What is the area of West Sussex?",
        "sparql": " SELECT (strdf:area(?geoWKT) AS ?area) ?g WHERE { yago:West_Sussex geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT } "
    }
]