[
    {
        "question": "How many cities intersect with beaches in Thessaly?",
        "sparql": " SELECT (COUNT(DISTINCT ?city) AS ?cities) WHERE { ?city rdf:type y2geoo:OSM_city ; geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?cWKT . ?park rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?bWKT . yago:Thessaly geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tWKT FILTER ( ( geof:sfWithin(?cWKT, ?tWKT) && geof:sfWithin(?bWKT, ?tWKT) ) && geof:sfIntersects(?cWKT, ?bWKT) ) } "
    },
    {
        "question": "Which townlands border the county council of Dublin?",
        "sparql": " SELECT DISTINCT ?city WHERE { yago:Dublin geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?city rdf:type y2geoo:OSI_Townland ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?cWKT FILTER geof:sfTouches(?geoWKT, ?cWKT) } "
    },
    {
        "question": "Which are the unitary authority wards of York?",
        "sparql": " SELECT DISTINCT ?districtWard WHERE { yago:York geo:hasGeometry ?o . ?o geo:asWKT ?WKT . ?districtWard rdf:type y2geoo:OS_UnitaryAuthorityWard ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?WKT1 FILTER geof:sfWithin(?WKT1, ?WKT) } "
    },
    {
        "question": "Which villages are located east of beaches, in Corfu?",
        "sparql": " SELECT DISTINCT ?village WHERE { yago:Corfu geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 FILTER ( ( geof:sfWithin(?geoWKT1, ?geoWKT) && geof:sfWithin(?geoWKT2, ?geoWKT) ) && strdf:right(?geoWKT1, ?geoWKT2) ) } "
    },
    {
        "question": "How many parks have streams crossing them in Plymouth?",
        "sparql": " SELECT (COUNT(DISTINCT ?park) AS ?parks) WHERE { ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 . yago:Plymouth geo:hasGeometry ?o . ?o geo:asWKT ?WKT FILTER ( ( geof:sfWithin(?geoWKT, ?WKT) && geof:sfWithin(?geoWKT1, ?WKT) ) && geof:sfCrosses(?geoWKT1, ?geoWKT) ) } "
    },
    {
        "question": "Which islands are north of towns in Paros?",
        "sparql": " SELECT DISTINCT ?island WHERE { yago:Paros geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?beach rdf:type y2geoo:OSM_town ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT . ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?geoIsl . ?geoIsl geo:asWKT ?IslWKT FILTER ( geof:sfWithin(?lWKT, ?lcnWKT) && strdf:above(?IslWKT, ?lWKT) ) } "
    },
    {
        "question": "How many cities have bays?",
        "sparql": " SELECT (COUNT(DISTINCT ?city) AS ?cities) WHERE { ?city rdf:type y2geoo:OSM_city ; geo:hasGeometry ?geoC . ?geoC geo:asWKT ?cWKT . ?beach rdf:type y2geoo:OSM_bay ; geo:hasGeometry ?geoB . ?geoB geo:asWKT ?bWKT FILTER geof:sfWithin(?bWKT, ?cWKT) } "
    },
    {
        "question": "Are Dublin and Arklow more than 10km apart?",
        "sparql": " ASK WHERE { yago:Dublin geo:hasGeometry ?DublnGeo . ?DublnGeo geo:asWKT ?DublnPolygon . yago:Arklow geo:hasGeometry ?Geo . ?Geo geo:asWKT ?Polygon FILTER ( geof:distance(?DublnPolygon, ?Polygon, uom:metre) > 10000 ) } "
    },
    {
        "question": "Is York larger than New York?",
        "sparql": " ASK WHERE { yago:York geo:hasGeometry ?yGeo . ?yGeo geo:asWKT ?yWKT . yago:New_York_City geo:hasGeometry ?nyGeo . ?nyGeo geo:asWKT ?nyWKT FILTER ( strdf:area(?yWKT) > strdf:area(?nyWKT) ) } "
    },
    {
        "question": "Which streams intersect with Cork?",
        "sparql": " SELECT DISTINCT ?stream WHERE { y2geor:gadmentity_Cork_IRL.4_1 geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?cWKT . ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?sWKT FILTER geof:sfIntersects(?sWKT, ?cWKT) } "
    },
    {
        "question": "Which districts border the Greater London Authority?",
        "sparql": " SELECT DISTINCT ?x WHERE { ?x rdf:type y2geoo:OS_District ; geo:hasGeometry ?g . ?g geo:asWKT ?gWKT . ?y rdf:type y2geoo:OS_GreaterLondonAuthority ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?g1WKT . ?y geo:sfTouches ?x } "
    },
    {
        "question": "Which is the biggest park in Dublin?",
        "sparql": " SELECT ?park (strdf:area(?lWKT) AS ?area) WHERE { yago:Dublin geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?lcnWKT) } ORDER BY DESC(?area) LIMIT 1 "
    },
    {
        "question": "Is there a lake that shares a border with a British county?",
        "sparql": " ASK WHERE { ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?wkt1 . ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?wkt2 FILTER geof:sfTouches(?wkt1, ?wkt2) } "
    },
    {
        "question": "Which streams cross counties that border Cumbria ?",
        "sparql": " SELECT DISTINCT ?stream WHERE { yago:Cumbria geo:hasGeometry ?lgeo . ?lgeo geo:asWKT ?lWKT . ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?geo . ?geo geo:asWKT ?WKT . ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?sgeo . ?sgeo geo:asWKT ?sWKT FILTER geof:sfTouches(?lWKT, ?WKT) FILTER geof:sfCrosses(?WKT, ?sWKT) } "
    },
    {
        "question": "Which lakes are north of a canal in London?",
        "sparql": " SELECT DISTINCT ?a WHERE { ?a rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?g1 . ?b rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?g2 . yago:Greater_London geo:hasGeometry ?o3 . ?o3 geo:asWKT ?g3 FILTER geof:sfWithin(?g1, ?g3) FILTER geof:sfCrosses(?g2, ?g3) FILTER strdf:above(?g2, ?g1) } "
    },
    {
        "question": "Which parks are in Suffolk?",
        "sparql": " SELECT DISTINCT ?park WHERE { yago:Suffolk geo:hasGeometry ?o1 . ?o1 geo:asWKT ?countyGeo . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?o3 . ?o3 geo:asWKT ?parkGeo FILTER geof:sfWithin(?parkGeo, ?countyGeo) } "
    },
    {
        "question": "What is the number of inhabitants residing in Amarynthos?",
        "sparql": " SELECT ?pop WHERE { yago:Amarynthos y2geoo:hasGAG_Population ?pop } "
    },
    {
        "question": "Give me exactly one park of Dublin that is south of a canal.",
        "sparql": " SELECT DISTINCT ?x2 WHERE { yago:Dublin geo:hasGeometry ?o2 . ?o2 geo:asWKT ?xWKT2 . ?x2 rdf:type y2geoo:OSM_park ; geo:hasGeometry ?x2Geom . ?x2Geom geo:asWKT ?iWKT2 . ?x1 rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?x1Geom . ?x1Geom geo:asWKT ?iWKT1 FILTER ( geof:sfWithin(?iWKT2, ?xWKT2) && strdf:below(?iWKT2, ?iWKT1) ) } LIMIT 1 "
    },
    {
        "question": "What is the location of the city of Houston?",
        "sparql": " SELECT ?wkt WHERE { yago:geoentity_City_of_Houston_11788285 geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?wkt } "
    },
    {
        "question": "Which municipalities border the Municipality of Makrakomi?",
        "sparql": " SELECT DISTINCT ?x WHERE { yago:Makrakomi geo:hasGeometry ?geo1 . ?geo1 geo:asWKT ?g1wkt . ?x rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?geo2 . ?geo2 geo:asWKT ?g2wkt FILTER geof:sfTouches(?g1wkt, ?g2wkt) } "
    },
    {
        "question": "Is Lake Yliki north of the municipality of Athens",
        "sparql": " ASK WHERE { yago:Lake_Yliki geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT . yago:geoentity_Dimos_Athens_8133876 geo:hasGeometry ?yGeom . ?yGeom geo:asWKT ?yWKT FILTER strdf:above(?xWKT, ?yWKT) } "
    },
    {
        "question": "What is the size of Oklahoma?",
        "sparql": " SELECT (strdf:area(?wkt) AS ?oarea) WHERE { yago:Oklahoma geo:hasGeometry ?geo . ?geo geo:asWKT ?wkt } "
    },
    {
        "question": "What is the population of Aegina ?",
        "sparql": " SELECT ?pop WHERE { yago:Aegina y2geoo:hasGAG_Population ?pop } "
    },
    {
        "question": "Where is Mullingar, the county town, located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Mullingar geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "What's the location of Killarney Beach?",
        "sparql": " SELECT ?wkt WHERE { yago:geoentity_Killarney_Beach_8215737 geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?wkt } "
    },
    {
        "question": "Find the 10 Irish Baronies with the most forests and at least 2 lakes.",
        "sparql": " SELECT ?mname (COUNT(?f) AS ?count_f) WHERE { { SELECT ?mw (COUNT(?l) AS ?count_inner) WHERE { ?m rdf:type y2geoo:OSI_Barony ; geo:hasGeometry ?mg . ?mg geo:asWKT ?mw . ?m y2geoo:hasGAG_Name ?mname . ?l rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lg . ?lg geo:asWKT ?lw FILTER geof:sfWithin(?lw, ?mw) } GROUP BY ?mw } FILTER ( ?count_inner > 1 ) ?f rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?fg . ?fg geo:asWKT ?fw . ?f geo:sfWithin ?m } GROUP BY ?mname ORDER BY DESC(?count_f) LIMIT 10 "
    },
    {
        "question": "Which states do not contain any lakes?",
        "sparql": " SELECT ?state WHERE { yago:United_States geo:hasGeometry ?usGeo . ?usGeo geo:asWKT ?usWKT . ?state rdf:type y2geoo:GADM_2ndOrder_AdministrativeUnit ; geo:hasGeometry ?sGeo . ?sGeo geo:asWKT ?sWKT FILTER geof:sfWithin(?sWKT, ?usWKT) FILTER NOT EXISTS { ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lGeo . ?lGeo geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?sWKT) } } "
    },
    {
        "question": "Which counties of England border Wales?",
        "sparql": " SELECT ?county WHERE { ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?cGeom . ?cGeom geo:asWKT ?cWKT . yago:Wales geo:hasGeometry ?wGeom . ?wGeom geo:asWKT ?wWKT . yago:England geo:hasGeometry ?eGeom . ?eGeom geo:asWKT ?eWKT FILTER geof:sfContains(?eWKT, ?cWKT) FILTER geof:sfTouches(?cWKT, ?wWKT) } "
    },
    {
        "question": "Is Nafpaktia west of Athens?",
        "sparql": " ASK WHERE { yago:Nafpaktia geo:hasGeometry ?geomNaf . ?geomNaf geo:asWKT ?wktNaf . yago:geoentity_Dimos_Athens_8133876 geo:hasGeometry ?geomAth . ?geomAth geo:asWKT ?wktAth FILTER strdf:left(?wktNaf, ?wktAth) } "
    },
    {
        "question": "Is Tullyhaw within Northern Ireland?",
        "sparql": " ASK WHERE { yago:geoentity_Tully_2635377 geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:Northern_Ireland geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER geof:sfWithin(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Which regional units border the regional unit of Thessaloniki?",
        "sparql": " SELECT DISTINCT ?neighboring WHERE { y2geor:gagentity_202 geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT . ?neighboring rdf:type y2geoo:GAG_RegionalUnit ; geo:hasGeometry ?yGeom . ?yGeom geo:asWKT ?yWKT FILTER geof:sfTouches(?xWKT, ?yWKT) } "
    },
    {
        "question": "Is Elafonisos west of Galatsi?",
        "sparql": " ASK WHERE { yago:Elafonisos geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:Galatsi geo:hasGeometry ?o1 ; rdf:type ?type . ?o1 geo:asWKT ?geoWKT1 FILTER strdf:left(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Which reservoirs are located within third-order administrative units in Greece?",
        "sparql": " SELECT DISTINCT ?a WHERE { ?a rdf:type y2geoo:OSM_reservoir ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?g1 . ?b rdf:type y2geoo:GADM_3rdOrder_AdministrativeUnit ; geo:hasGeometry ?o2 . ?o2 geo:asWKT ?g2 . yago:Greece geo:hasGeometry ?o3 . ?o3 geo:asWKT ?g3 FILTER geof:sfWithin(?g1, ?g2) FILTER geof:sfWithin(?g2, ?g3) } "
    },
    {
        "question": "What is the number of islands that have lakes?",
        "sparql": " SELECT (COUNT(DISTINCT ?island) AS ?islands) WHERE { ?island rdf:type y2geoo:OSM_island ; geo:hasGeometry ?island_geo . ?island_geo geo:asWKT ?island_geoWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lake_geo . ?lake_geo geo:asWKT ?lake_geoWKT FILTER geof:sfWithin(?lake_geoWKT, ?island_geoWKT) } "
    },
    {
        "question": "What is the number of forests that are adjacent to a lake?",
        "sparql": " SELECT (COUNT(DISTINCT ?forest) AS ?forests) WHERE { ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?x2Geo . ?x2Geo geo:asWKT ?x2WKT FILTER geof:sfTouches(?x1WKT, ?x2WKT) } "
    },
    {
        "question": "What is the size of Greece?",
        "sparql": " SELECT (strdf:area(?WKT) AS ?area) WHERE { yago:Greece geo:hasGeometry ?o . ?o geo:asWKT ?WKT } "
    },
    {
        "question": "What is the population of San Francisco?",
        "sparql": " SELECT (xsd:integer(?population) AS ?pop) WHERE { yago:San_Francisco yago:hasPopulation ?population } "
    },
    {
        "question": "What is the number of parks located within cities?",
        "sparql": " SELECT (COUNT(DISTINCT ?x1) AS ?parks) WHERE { ?x1 rdf:type y2geoo:OSM_park ; geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT . ?x2 rdf:type y2geoo:OSM_city ; geo:hasGeometry ?x2Geo . ?x2Geo geo:asWKT ?x2WKT FILTER geof:sfWithin(?x1WKT, ?x2WKT) } "
    },
    {
        "question": "How many parks does Dublin have and what is their total area?",
        "sparql": " SELECT (COUNT(?park) AS ?count) (SUM(strdf:area(?lWKT)) AS ?total_area_of_parks) WHERE { yago:Dublin geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER geof:sfWithin(?lWKT, ?lcnWKT) } "
    },
    {
        "question": "Is there a lake that touches both a forest and a village?",
        "sparql": " ASK WHERE { ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lGeo . ?lGeo geo:asWKT ?lWKT . ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?vGeo . ?vGeo geo:asWKT ?vWKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?fGeo . ?fGeo geo:asWKT ?fWKT FILTER ( geof:sfTouches(?vWKT, ?lWKT) && geof:sfTouches(?fWKT, ?lWKT) ) } "
    },
    {
        "question": "How many lakes overlap with metropolitan districts?",
        "sparql": " SELECT (COUNT(DISTINCT ?Lake) AS ?lakes) WHERE { ?MD rdf:type y2geoo:OS_MetropolitanDistrict ; geo:hasGeometry ?MDGeo . ?MDGeo geo:asWKT ?MDPolygon . ?Lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?LakeGeo . ?LakeGeo geo:asWKT ?LakePolygon FILTER strdf:overlaps(?MDPolygon, ?LakePolygon) } "
    },
    {
        "question": "Which is the smallest forest by area in Greater London?",
        "sparql": " SELECT DISTINCT ?forest (strdf:area(?bWKT) AS ?totalArea) WHERE { ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?bGeom . ?bGeom geo:asWKT ?bWKT . yago:Greater_London geo:hasGeometry ?lcGeom . ?lcGeom geo:asWKT ?lcWKT FILTER geof:sfWithin(?bWKT, ?lcWKT) } ORDER BY ASC(?totalArea) LIMIT 1 "
    },
    {
        "question": "How many British counties have lakes and canals in or as parts of them?",
        "sparql": " SELECT (COUNT(DISTINCT ?park) AS ?parks) WHERE { ?park rdf:type y2geoo:OS_County ; geo:hasGeometry ?geomP . ?geomP geo:asWKT ?lWKT_P . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?geomF . ?geomF geo:asWKT ?lWKT_F . ?lagoon rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT_L FILTER geof:sfIntersects(?lWKT_P, ?lWKT_F) FILTER geof:sfIntersects(?lWKT_P, ?lWKT_L) } "
    },
    {
        "question": "Where is Nottinghamshire located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Nottinghamshire geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "How many municipalities in Greece contain beaches?",
        "sparql": " SELECT (COUNT(DISTINCT ?municipality) AS ?municipalities) WHERE { ?municipality rdf:type y2geoo:GAG_Municipality ; geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER geof:sfContains(?lcnWKT, ?lWKT) } "
    },
    {
        "question": "Is Wales to the east of Cambridge?",
        "sparql": " ASK WHERE { yago:Wales geo:hasGeometry ?wGeom . ?wGeom geo:asWKT ?wWKT . yago:geoentity_Cambridge_District_7290660 geo:hasGeometry ?cGeom . ?cGeom geo:asWKT ?cWKT FILTER strdf:right(?wWKT, ?cWKT) } "
    },
    {
        "question": "Are there any beaches near the city of Chania?",
        "sparql": " ASK WHERE { yago:geoentity_Chania_8133762 geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER ( geof:distance(?lcnWKT, ?lWKT, uom:metre) < 5000 ) } "
    },
    {
        "question": "Where is Crete located?",
        "sparql": " SELECT DISTINCT ?xWKT WHERE { yago:Crete geo:hasGeometry ?xgeo . ?xgeo geo:asWKT ?xWKT } "
    },
    {
        "question": "Which forests are located within a distance of 20km from Dublin?",
        "sparql": " SELECT DISTINCT ?park WHERE { yago:Dublin geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?park rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER ( geof:distance(?geoWKT, ?geoWKT1, uom:metre) <= 20000 ) } "
    },
    {
        "question": "How many lakes in Scotland are south of canals in Scotland?",
        "sparql": " SELECT (COUNT(DISTINCT ?lake) AS ?lakes) WHERE { yago:Scotland geo:hasGeometry ?oGeo . ?oGeo geo:asWKT ?oWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lakeGeometry . ?lakeGeometry geo:asWKT ?lakeWKT . ?canal rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?canalGeometry . ?canalGeometry geo:asWKT ?canalWKT FILTER ( ( geof:sfContains(?oWKT, ?lakeWKT) && geof:sfContains(?oWKT, ?canalWKT) ) && strdf:below(?lakeWKT, ?canalWKT) ) } "
    },
    {
        "question": "Which towns have beaches?",
        "sparql": " SELECT DISTINCT ?town WHERE { ?town rdf:type y2geoo:OSM_town ; geo:hasGeometry ?geoC . ?geoC geo:asWKT ?cWKT . ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?geoB . ?geoB geo:asWKT ?bWKT FILTER geof:sfWithin(?bWKT, ?cWKT) } "
    },
    {
        "question": "What is the population of Syros?",
        "sparql": " SELECT ?pop WHERE { yago:Syros y2geoo:hasGAG_Population ?pop } "
    },
    {
        "question": "What is the geographical position of Petroupoli?",
        "sparql": " SELECT DISTINCT ?dimos_geoWKT WHERE { yago:Petroupoli geo:hasGeometry ?dimos_geo . ?dimos_geo geo:asWKT ?dimos_geoWKT } "
    },
    {
        "question": "Which counties border county Essex?",
        "sparql": " SELECT DISTINCT ?county WHERE { yago:Essex geo:hasGeometry ?geomEss . ?geomEss geo:asWKT ?wktEss . ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?geomC . ?geomC geo:asWKT ?wktC FILTER geof:sfTouches(?wktEss, ?wktC) } "
    },
    {
        "question": "How many lakes intersect forests?",
        "sparql": " SELECT (COUNT(DISTINCT ?lake) AS ?lakes) WHERE { ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT . ?f rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?g2 . ?g2 geo:asWKT ?geoWKT2 FILTER geof:sfIntersects(?geoWKT, ?geoWKT2) } "
    },
    {
        "question": "Which are the lakes inside Central Macedonia?",
        "sparql": " SELECT DISTINCT ?lake WHERE { yago:Central_Macedonia geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER geof:sfWithin(?geoWKT1, ?geoWKT) } "
    },
    {
        "question": "Where is Galway located?",
        "sparql": " SELECT ?wkt WHERE { y2geor:gadmentity_Galway_IRL.7_1 geo:hasGeometry ?geom . ?geom geo:asWKT ?wkt } "
    },
    {
        "question": "Which beaches are at most 100 km away from Ormos Vourkari?",
        "sparql": " SELECT DISTINCT ?beach WHERE { ?beach rdf:type y2geoo:OSM_beach ; geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT . yago:geoentity_\u00d3rmos_Vourk\u00e1ri_251740 geo:hasGeometry ?x2Geo . ?x2Geo geo:asWKT ?x2WKT FILTER ( geof:distance(?x1WKT, ?x2WKT, uom:metre) <= 100000 ) } "
    },
    {
        "question": "Which county in Wales has the smallest number of villages?",
        "sparql": " SELECT ?county WHERE { SELECT ?county (COUNT(?village) AS ?villages) WHERE { ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?cGeom . ?cGeom geo:asWKT ?cWKT . yago:Wales geo:hasGeometry ?wGeom . ?wGeom geo:asWKT ?wWKT . ?village rdf:type y2geoo:OSM_village ; geo:hasGeometry ?villageGeom . ?villageGeom geo:asWKT ?xWKT FILTER ( geof:sfWithin(?cWKT, ?wWKT) && geof:sfWithin(?xWKT, ?cWKT) ) } GROUP BY ?county } ORDER BY ?villages LIMIT 1 "
    },
    {
        "question": "Which rural areas located south of County Longford have forests?",
        "sparql": " SELECT DISTINCT ?Rural_Area WHERE { yago:County_Longford geo:hasGeometry ?Longford_geo . ?Longford_geo geo:asWKT ?Longford_geoWKT . ?Rural_Area rdf:type y2geoo:OSI_Rural_Area ; geo:hasGeometry ?Rural_Area_geo . ?Rural_Area_geo geo:asWKT ?Rural_Area_geoWKT FILTER strdf:below(?Rural_Area_geoWKT, ?Longford_geoWKT) ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?forest_geo . ?forest_geo geo:asWKT ?forest_geoWKT FILTER geof:sfWithin(?forest_geoWKT, ?Rural_Area_geoWKT) } "
    },
    {
        "question": "What is the population of the Greek region of Epirus?",
        "sparql": " SELECT DISTINCT ?population WHERE { <http://yago-knowledge.org/resource/Epirus_(region)> y2geoo:hasGAG_Population ?population } "
    },
    {
        "question": "Which is the largest forest in a 1000km radius from Kastanas beach?",
        "sparql": " SELECT ?forest (strdf:area(?fWKT) AS ?forestArea) WHERE { yago:geoentity_Paral\u00eda_Kastan\u00e1s_10277719 geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?kWKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?fWKT FILTER ( geof:distance(?kWKT, ?fWKT, uom:metre) < 1000000 ) } ORDER BY DESC(?forestArea) LIMIT 1 "
    },
    {
        "question": "What is the distance between Glasgow and Edinburgh?",
        "sparql": " SELECT (geof:distance(?gwkt, ?ewkt, uom:metre) AS ?distance) WHERE { yago:geoentity_Glasgow_City_3333231 geo:hasGeometry ?ggeom . ?ggeom geo:asWKT ?gwkt . yago:Edinburgh geo:hasGeometry ?egeom . ?egeom geo:asWKT ?ewkt } "
    },
    {
        "question": "What is the population of Pylos?",
        "sparql": " SELECT ?o WHERE { yago:Pylos-Nestor y2geoo:hasGAG_Population ?o } "
    },
    {
        "question": "Which city has the largest park in Texas?",
        "sparql": " SELECT ?city (strdf:area(?parkWKT) AS ?area) WHERE { yago:Texas geo:hasGeometry ?usaGeo . ?usaGeo geo:asWKT ?usaWKT . ?city rdf:type y2geoo:OSM_city ; geo:hasGeometry ?cityGeo . ?cityGeo geo:asWKT ?cityWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?parkGeo . ?parkGeo geo:asWKT ?parkWKT FILTER ( geof:sfContains(?usaWKT, ?parkWKT) && geof:sfContains(?cityWKT, ?parkWKT) ) } ORDER BY DESC(?area) LIMIT 1 "
    },
    {
        "question": "Which regional units border with Thessaly?",
        "sparql": " SELECT DISTINCT ?rg WHERE { yago:Thessaly geo:hasGeometry ?tgeo . ?tgeo geo:asWKT ?tWKT . ?rg rdf:type y2geoo:GAG_RegionalUnit ; geo:hasGeometry ?rggeo . ?rggeo geo:asWKT ?rgWKT FILTER geof:sfTouches(?rgWKT, ?tWKT) } "
    },
    {
        "question": "Which are the canals of Wales?",
        "sparql": " SELECT DISTINCT ?canal WHERE { yago:Wales geo:hasGeometry ?geomLC . ?geomLC geo:asWKT ?lcnWKT . ?canal rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?geomLC2 . ?geomLC2 geo:asWKT ?lcnWKT2 FILTER geof:sfWithin(?lcnWKT2, ?lcnWKT) } "
    },
    {
        "question": "Which are the districts that border Copeland district?",
        "sparql": " SELECT DISTINCT ?district WHERE { ?district rdf:type y2geoo:OS_District ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?districtGeo . yago:geoentity_Copeland_District_7290665 geo:hasGeometry ?o2 . ?o2 geo:asWKT ?copelandGeo FILTER geof:sfTouches(?copelandGeo, ?districtGeo) } "
    },
    {
        "question": "How many lakes does Greece have?",
        "sparql": " SELECT (COUNT(?x) AS ?cnt) WHERE { ?x rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT . yago:Greece geo:hasGeometry ?o1 . ?o1 geo:asWKT ?iWKT FILTER geof:sfWithin(?xWKT, ?iWKT) } "
    },
    {
        "question": "Which counties border County Clare?",
        "sparql": " SELECT DISTINCT ?county WHERE { yago:County_Clare geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } ?county geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER geof:sfTouches(?geoWKT, ?geoWKT1) } "
    },
    {
        "question": "Where is Alaska located?",
        "sparql": " SELECT DISTINCT ?geoWKT WHERE { yago:Alaska geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT } "
    },
    {
        "question": "Is Ballymoe within the county of Longford?",
        "sparql": " ASK WHERE { yago:Ballymoe geo:hasGeometry ?g . ?g geo:asWKT ?geoWKT . yago:County_Longford geo:hasGeometry ?g2 . ?g2 geo:asWKT ?geoWKT2 FILTER geof:sfWithin(?geoWKT, ?geoWKT2) } "
    },
    {
        "question": "Which districts share a border with the Greater London Authority?",
        "sparql": " SELECT DISTINCT ?x WHERE { ?x rdf:type y2geoo:OS_District ; geo:hasGeometry ?g . ?g geo:asWKT ?gWKT . ?y rdf:type y2geoo:OS_GreaterLondonAuthority ; geo:hasGeometry ?g1 . ?g1 geo:asWKT ?g1WKT . ?y geo:sfTouches ?x } "
    },
    {
        "question": "Is the area of any canal that intersects with Dublin greater than zero?",
        "sparql": " ASK WHERE { ?x rdf:type y2geoo:OSM_canal ; geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT . yago:Dublin geo:hasGeometry ?o1 . ?o1 geo:asWKT ?iWKT FILTER ( geof:sfIntersects(?xWKT, ?iWKT) && ( strdf:area(?xWKT) > 0 ) ) } "
    },
    {
        "question": "Are there forests less than 50 kilometres away from the municipality of Missolonghi?",
        "sparql": " ASK WHERE { yago:geoentity_Dimos_Missolonghi_8133706 geo:hasGeometry ?o . ?o geo:asWKT ?WKT . ?forest rdf:type y2geoo:OSM_forest ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?WKT1 FILTER ( geof:distance(?WKT, ?WKT1, uom:metre) < 50000 ) } "
    },
    {
        "question": "Which Irish county has the highest number of lakes?",
        "sparql": " SELECT DISTINCT ?county WHERE { ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } ?county geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 FILTER geof:sfWithin(?geoWKT, ?geoWKT1) } GROUP BY ?county ORDER BY DESC(COUNT(?lake)) LIMIT 1 "
    },
    {
        "question": "What is the largest lake in Cambridgeshire?",
        "sparql": " SELECT ?park (strdf:area(?parkWKT) AS ?parkArea) WHERE { yago:Cambridge geo:hasGeometry ?cGeom . ?cGeom geo:asWKT ?cWKT . ?park rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?parkGeom . ?parkGeom geo:asWKT ?parkWKT FILTER geof:sfWithin(?parkWKT, ?cWKT) } ORDER BY DESC(?parkArea) LIMIT 1 "
    },
    {
        "question": "Which county of Ireland has the most nature reserves?",
        "sparql": " SELECT DISTINCT ?county WHERE { ?lake rdf:type y2geoo:OSM_nature_reserve ; geo:hasGeometry ?o1 . ?o1 geo:asWKT ?geoWKT1 { ?county rdf:type y2geoo:OSI_County_Council } UNION { ?county rdf:type y2geoo:OSI_City_and_County_Council } ?county geo:hasGeometry ?o2 . ?o2 geo:asWKT ?geoWKT2 . yago:Republic_of_Ireland geo:hasGeometry ?irlG . ?irlG geo:asWKT ?irlWKT FILTER ( geof:sfWithin(?geoWKT2, ?irlWKT) && geof:sfWithin(?geoWKT1, ?geoWKT2) ) } GROUP BY ?county ORDER BY DESC(COUNT(?lake)) LIMIT 1 "
    },
    {
        "question": "How many county councils does the Republic of Ireland have?",
        "sparql": " SELECT (COUNT(DISTINCT ?x) AS ?totalX) WHERE { ?x rdf:type y2geoo:OSI_County_Council ; geo:hasGeometry ?cGeom . ?cGeom geo:asWKT ?cWKT . yago:Republic_of_Ireland geo:hasGeometry ?iGeom . ?iGeom geo:asWKT ?iWKT FILTER geof:sfContains(?iWKT, ?cWKT) } "
    },
    {
        "question": "What is the total area of Manchester?",
        "sparql": " SELECT DISTINCT (strdf:area(?xWKT) AS ?totalArea) WHERE { yago:Manchester geo:hasGeometry ?xGeom . ?xGeom geo:asWKT ?xWKT } "
    },
    {
        "question": "Which countries make up the UK?",
        "sparql": " SELECT ?constituentCountry WHERE { yago:United_Kingdom geo:hasGeometry ?ukGeo . ?ukGeo geo:asWKT ?ukWKT . ?constituentCountry rdf:type y2geoo:GADM_2ndOrder_AdministrativeUnit ; geo:hasGeometry ?cGeo . ?cGeo geo:asWKT ?cWKT FILTER geof:sfWithin(?cWKT, ?ukWKT) } "
    },
    {
        "question": "Which Irish city councils have parks?",
        "sparql": " SELECT DISTINCT ?x WHERE { ?x rdf:type y2geoo:OSI_City_Council ; geo:hasGeometry ?geomLC . yago:Republic_of_Ireland geo:hasGeometry ?irlG . ?irlG geo:asWKT ?irlWKT . ?geomLC geo:asWKT ?lcnWKT . ?park rdf:type y2geoo:OSM_park ; geo:hasGeometry ?geomL . ?geomL geo:asWKT ?lWKT FILTER ( geof:sfWithin(?lWKT, ?irlWKT) && geof:sfContains(?lcnWKT, ?lWKT) ) } "
    },
    {
        "question": "How many nature reserves are in rural areas?",
        "sparql": " SELECT (COUNT(DISTINCT ?nature_reserve) AS ?reserves) WHERE { ?nature_reserve rdf:type y2geoo:OSM_nature_reserve ; geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT . ?rural_area rdf:type y2geoo:OSI_Rural_Area ; geo:hasGeometry ?x2Geo . ?x2Geo geo:asWKT ?x2WKT FILTER geof:sfWithin(?x1WKT, ?x2WKT) } "
    },
    {
        "question": "How many bays are adjacent to villages?",
        "sparql": " SELECT (COUNT(DISTINCT ?x1) AS ?bays) WHERE { ?x1 rdf:type y2geoo:OSM_bay ; geo:hasGeometry ?x1Geo . ?x1Geo geo:asWKT ?x1WKT . ?x2 rdf:type y2geoo:OSM_village ; geo:hasGeometry ?x2Geo . ?x2Geo geo:asWKT ?x2WKT FILTER geof:sfTouches(?x1WKT, ?x2WKT) } "
    },
    {
        "question": "What are the largest parks that belong to counties north of Budgebury Forest?",
        "sparql": " SELECT DISTINCT ?locality WHERE { yago:Bedgebury_Forest geo:hasGeometry ?for_geo . ?for_geo geo:asWKT ?for_geoWKT . ?county rdf:type y2geoo:OS_County ; geo:hasGeometry ?county_geo . ?county_geo geo:asWKT ?county_geoWKT FILTER strdf:below(?for_geoWKT, ?county_geoWKT) ?locality rdf:type y2geoo:OSM_park ; geo:hasGeometry ?locality_geo . ?locality_geo geo:asWKT ?locality_geoWKT FILTER geof:sfWithin(?locality_geoWKT, ?county_geoWKT) } ORDER BY DESC(?parkarea) LIMIT 1 "
    },
    {
        "question": "How many lakes are there in Los Angeles?",
        "sparql": " SELECT (COUNT(DISTINCT ?lake) AS ?lakes) WHERE { yago:geoentity_Los_Angeles_City_Center_6946540 geo:hasGeometry ?laGeom . ?laGeom geo:asWKT ?laWKT . ?lake rdf:type y2geoo:OSM_lake ; geo:hasGeometry ?lakeGeom . ?lakeGeom geo:asWKT ?lakeWKT FILTER geof:sfContains(?laWKT, ?lakeWKT) } "
    },
    {
        "question": "What is the smallest metropolitan district that borders Manchester?",
        "sparql": " SELECT DISTINCT ?Mdistrict (strdf:area(?cWKT) AS ?area) WHERE { yago:Manchester geo:hasGeometry ?egeo . ?egeo geo:asWKT ?eWKT . ?Mdistrict rdf:type y2geoo:OS_MetropolitanDistrict ; geo:hasGeometry ?cgeo . ?cgeo geo:asWKT ?cWKT FILTER geof:sfTouches(?eWKT, ?cWKT) } ORDER BY ?area LIMIT 1 "
    },
    {
        "question": "Is NYC less than 100km from Cambridge?",
        "sparql": " ASK WHERE { yago:New_York_City geo:hasGeometry ?o . ?o geo:asWKT ?geoWKT . yago:geoentity_Cambridge_District_7290660 geo:hasGeometry ?o1 ; rdf:type ?type . ?o1 geo:asWKT ?geoWKT1 FILTER ( geof:distance(?geoWKT, ?geoWKT1, uom:metre) <= 100000 ) } "
    },
    {
        "question": "Which is the largest stream that intersects with Cork?",
        "sparql": " SELECT ?stream (strdf:area(?sWKT) AS ?streamArea) WHERE { y2geor:gadmentity_Cork_IRL.4_1 geo:hasGeometry ?rep1 . ?rep1 geo:asWKT ?cWKT . ?stream rdf:type y2geoo:OSM_stream ; geo:hasGeometry ?rep2 . ?rep2 geo:asWKT ?sWKT FILTER geof:sfIntersects(?sWKT, ?cWKT) } ORDER BY DESC(?streamArea) LIMIT 1 "
    },
    {
        "question": "How many villages does Northern Ireland have?",
        "sparql": " SELECT (COUNT(DISTINCT ?lake) AS ?totalX) WHERE { yago:Northern_Ireland geo:hasGeometry ?geom . ?geom geo:asWKT ?mWKT . ?lake rdf:type y2geoo:OSM_village ; geo:hasGeometry ?geol . ?geol geo:asWKT ?lWKT FILTER geof:sfContains(?mWKT, ?lWKT) } "
    }
]